{
  "templates": [
    {
      "id": "1",
      "key": "dr",
      "name": "DR",
      "url": "https://example.com/szablony/dr"
    },
    {
      "id": "2",
      "key": "mbp",
      "name": "MBP",
      "url": "https://example.com/szablony/mbp"
    }
  ],
  "InformationMSB": [
    {
      "type": "section",
      "title": "Zasady ogólne i odpowiedzialność"
    },
    {
      "lp": 1,
      "standard": "KSRF 200 – Ogólne cele niezależnego biegłego rewidenta oraz przeprowadzenie badania zgodnie z Międzynarodowymi Standardami Badania",
      "zastosowanie": "Stosuje się w każdym badaniu.",
      "cele": "Przy przeprowadzaniu badania sprawozdań finansowych ogólne cele biegłego rewidenta stanowią:\na) uzyskanie wystarczającej pewności, czy sprawozdania finansowe jako całość nie zawierają istotnego zniekształcenia, niezależnie od tego, czy zostało ono spowodowane błędem lub oszustwem, co umożliwi biegłemu rewidentowi wyrażenie opinii o tym, czy sprawozdania finansowe zostały, we wszystkich istotnych aspektach, sporządzone zgodnie z mającymi zastosowanie ramowymi zasadami sprawozdawczości finansowej,\nb) sporządzenie sprawozdania na temat sprawozdań finansowych i przekazanie stosownie do wymogów MSB informacji zgodnych z ustaleniami biegłego rewidenta.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/516,KRBR-uchwala-2783-52-2015-KSRF-200.pdf"
    },
    {
      "lp": 2,
      "standard": "KSRF 210 – Uzgadnianie warunków zlecenia badania",
      "zastosowanie": "Stosuje się w każdym badaniu.",
      "cele": "Celem biegłego rewidenta jest przyjęcie lub kontynuacja zlecenia badania tylko wtedy, gdy zasady, w oparciu o które zlecenie badania będzie wykonane, zostały uzgodnione przez:\na) ustalenie, czy istnieją wstępne warunki badania oraz\nb) potwierdzenie, że pomiędzy biegłym rewidentem a kierownictwem oraz – tam gdzie to odpowiednie – osobami sprawującymi nadzór istnieje wzajemne zrozumienie co do warunków zlecenia badania.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/497,KRBR-uchwala-2783-52-2015-KSRF-210.pdf"
    },
    {
      "lp": 3,
      "standard": "KSRF 220 – Kontrola jakości badania sprawozdań finansowych",
      "zastosowanie": "Stosuje się w każdym badaniu.",
      "cele": "Celem biegłego rewidenta jest wdrożenie procedur kontroli jakości na poziomie zlecenia badania, które dostarczą biegłemu rewidentowi wystarczającą pewność, że:\na) badanie spełnia zawodowe standardy oraz obowiązujące wymogi prawne i regulacyjne oraz\nb) sprawozdanie biegłego rewidenta jest odpowiednie do okoliczności.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/498,KRBR-uchwala-2783-52-2015-KSRF-220.pdf"
    },
    {
      "lp": 4,
      "standard": "KSRF 230 – Dokumentacja badania",
      "zastosowanie": "Stosuje się w każdym badaniu.",
      "cele": "Celem biegłego rewidenta jest sporządzenie dokumentacji, która zawiera:\na) wystarczające i odpowiednie zapisy uzasadniające sprawozdanie biegłego rewidenta oraz\nb) dowody na to, że badanie zostało zaplanowane i przeprowadzone zgodnie z MSB oraz mającymi zastosowanie wymogami prawnymi i regulacyjnymi.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/510,KRBR-uchwala-2783-52-2015-KSRF-230.pdf"
    },
    {
      "lp": 5,
      "standard": "KSRF 240 – Odpowiedzialność biegłego rewidenta podczas badania sprawozdań finansowych",
      "zastosowanie": "Stosuje się w każdym badaniu.",
      "cele": "Celami biegłego rewidenta są:\na) zidentyfikowanie i ocena ryzyka istotnego zniekształcenia sprawozdań finansowych spowodowanego oszustwem,\nb) uzyskanie wystarczających i odpowiednich dowodów oszustw badania na temat oszacowanego ryzyka istotnego zniekształcenia spowodowanego oszustwem, poprzez zaprojektowanie i zastosowanie właściwej reakcji oraz\nc) właściwa reakcja na wykryte lub domniemane oszustwo zidentyfikowane podczas badania.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/503,KRBR-uchwala-2783-52-2015-KSRF-240.pdf"
    },
    {
      "lp": 6,
      "standard": "KSRF 250 – Uwzględnienie prawa i regulacji podczas badania sprawozdań finansowych",
      "zastosowanie": "Stosuje się w każdym badaniu.",
      "cele": "Celem biegłego rewidenta jest:\na) uzyskanie wystarczających i odpowiednich dowodów badania dotyczących przestrzegania tych praw i regulacji, które ogólnie uznaje się za mające bezpośredni wpływ na ustalanie istotnych kwot i ujawnień w sprawozdaniach finansowych,\nb) przeprowadzenie określonych procedur badania pomocnych w rozpoznaniu przypadków naruszenia innych praw i regulacji, które mogą mieć istotny wpływ na sprawozdania finansowe oraz\nc) właściwa reakcja na rozpoznane podczas badania przypadki naruszenia lub podejrzenia naruszenia prawa i regulacji.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/504,KRBR-uchwala-2783-52-2015-KSRF-250.pdf"
    },
    {
      "lp": 7,
      "standard": "KSRF 260 – Komunikowanie się z osobami sprawującymi nadzór",
      "zastosowanie": "Stosuje się w każdym badaniu.",
      "cele": "Celem biegłego rewidenta jest:\na) komunikowanie się w sposób jasny z osobami sprawującymi nadzór w sprawach związanych z odpowiedzialnością biegłego rewidenta za badanie sprawozdań finansowych jak również przeglądem zaplanowanego zakresu i rozłożenia w czasie badania,\nb) uzyskanie od osób sprawujących nadzór informacji ważnych dla badania,\nc) przekazanie osobom sprawującym nadzór bez zwłoki wynikających z badania spostrzeżeń, które są znaczące i odpowiednie z uwagi na odpowiedzialność tych osób za nadzorowanie procesu sprawozdawczości finansowej oraz\nd) promowanie skutecznego dwustronnego komunikowania się biegłego rewidenta z osobami sprawującymi nadzór.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/515,KRBR-uchwala-2783-52-2015-KSRF-260.pdf"
    },
    {
      "lp": 8,
      "standard": "KSRF 265 – Komunikowanie się z osobami sprawującymi nadzór i kierownictwem w sprawie słabości kontroli wewnętrznej",
      "zastosowanie": "Stosuje się w każdym badaniu, jeżeli zidentyfikowane zostaną słabości kontroli wewnętrznej",
      "cele": "Celem biegłego rewidenta jest odpowiednie informowanie osób sprawujących nadzór i kierownictwa o słabości kontroli wewnętrznej, którą biegły rewident rozpoznał podczas badania, i która, zgodnie z jego zawodowym osądem, ma na tyle duże znaczenie, że zasługuje na poświęcenie jej uwagi.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/513,KRBR-uchwala-2783-52-2015-KSRF-265.pdf"
    },
    {
      "type": "section",
      "title": "Szacowanie ryzyk i wynikająca z tego reakcja rewizyjna"
    },
    {
      "lp": 9,
      "standard": "KSRF 300 – Planowanie badania sprawozdań finansowych",
      "zastosowanie": "Stosuje się w każdym badaniu.",
      "cele": "Celem biegłego rewidenta jest takie zaplanowanie badania, aby badanie zostało przeprowadzone w sposób efektywny.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/502,KRBR-uchwala-2783-52-2015-KSRF-300.pdf"
    },
    {
      "lp": 10,
      "standard": "KSRF 315 – Identyfikacja i ocena ryzyk istotnego zniekształcenia dzięki zrozumieniu jednostki i jej otoczenia",
      "zastosowanie": "Stosuje się w każdym badaniu.",
      "cele": "Celem biegłego rewidenta jest identyfikacja i ocena ryzyk istotnego zniekształcenia, niezależnie od tego, czy powstało ono na skutek oszustwa lub błędu na poziomie sprawozdania finansowego, czy stwierdzeń, dzięki zrozumieniu jednostki i jej otoczenia, w tym kontroli wewnętrznej jednostki, co stanowi podstawę do zaprojektowania i wdrożenia reakcji na ocenione ryzyka istotnego zniekształcenia.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/518,KRBR-uchwala-2783-52-2015-KSRF-315.pdf"
    },
    {
      "lp": 11,
      "standard": "KSRF 320 – Istotność przy planowaniu i przeprowadzaniu badania",
      "zastosowanie": "Stosuje się w każdym badaniu.",
      "cele": "Celem biegłego rewidenta jest odpowiednie zastosowanie koncepcji istotności przy planowaniu i przeprowadzaniu badania.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/507,KRBR-uchwala-2783-52-2015-KSRF-320.pdf"
    },
    {
      "lp": 12,
      "standard": "KSRF 330 – Postępowanie biegłego rewidenta w odpowiedzi na ocenę ryzyka",
      "zastosowanie": "Stosuje się w każdym badaniu.",
      "cele": "Celem biegłego rewidenta jest uzyskanie wystarczających i odpowiednich dowodów badania ocenionego ryzyka istotnego zniekształcenia dzięki zaprojektowaniu i zastosowaniu odpowiednich do tego ryzyka reakcji.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/508,KRBR-uchwala-2783-52-2015-KSRF-330.pdf"
    },
    {
      "lp": 13,
      "standard": "KSRF 402 – Okoliczności wymagające uwzględnienia przy badaniu jednostki korzystającej z organizacji usługowej",
      "zastosowanie": "Stosuje się, gdy badana jednostka korzysta z organizacji usługowych.",
      "cele": "Celem biegłego rewidenta jednostki korzystającej z usług organizacji usługowej jest:\na) poznanie istoty i znaczenia usług organizacji usługowej oraz ich wpływu na mającą znaczenie dla badania kontrolę wewnętrzną jednostki korzystającej z usług organizacji usługowej w zakresie wystarczającym do rozpoznania i oceny ryzyka istotnego zniekształcenia,\nb) zaprojektowanie oraz przeprowadzenie procedur badania, będących odpowiedzią na to ryzyko.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/505,KRBR-uchwala-2783-52-2015-KSRF-402.pdf"
    },
    {
      "lp": 14,
      "standard": "KSRF 450 – Ocena zniekształceń rozpoznanych w trakcie badania",
      "zastosowanie": "Stosuje się w każdym badaniu.",
      "cele": "Celem biegłego rewidenta jest ocena:\na) wpływu rozpoznanych zniekształceń na badanie oraz\nb) wpływu nieskorygowanych zniekształceń, jeśli takie występują, na sprawozdania finansowe.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/496,KRBR-uchwala-2783-52-2015-KSRF-450.pdf"
    },
    {
      "type": "section",
      "title": "Dowody badania"
    },
    {
      "lp": 15,
      "standard": "KSRF 500 – Dowody badania",
      "zastosowanie": "Stosuje się w każdym badaniu.",
      "cele": "Celem biegłego rewidenta jest zaprojektowanie i przeprowadzenie procedur badania w sposób, który zapewni uzyskanie wystarczających i odpowiednich dowodów badania, umożliwiających sformułowanie racjonalnych wniosków leżących u podstaw opinii biegłego rewidenta.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/517,KRBR-uchwala-2783-52-2015-KSRF-500.pdf"
    },
    {
      "lp": 16,
      "standard": "KSRF 501 – Dowody badania – szczególne zagadnienia: wybrane pozycje",
      "zastosowanie": "Stosuje się, jeśli dotyczą jednostki badanej zapasy, roszczenia z tytułu sporów sądowych lub informacje pochodzące od osób trzecich.",
      "cele": "Cele biegłego rewidenta to uzyskanie wystarczających i odpowiednich dowodów badania dotyczących:\na) istnienia i stanu zapasów,\nb) kompletności ujawnień dotyczących sporów sądowych oraz\nc) prawidłowości informacji uzyskanych od osób trzecich.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/499,KRBR-uchwala-2783-52-2015-KSRF-501.pdf"
    },
    {
      "lp": 17,
      "standard": "KSRF 505 – Potwierdzenia zewnętrzne",
      "zastosowanie": "Stosuje się w każdym badaniu, jeśli wykorzystywane są potwierdzenia zewnętrzne.",
      "cele": "Celem biegłego rewidenta jest zaprojektowanie i przeprowadzenie procedur potwierdzeń zewnętrznych, które pozwolą uzyskać wystarczające i odpowiednie dowody badania oraz właściwie ocenić ich wiarygodność.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/506,KRBR-uchwala-2783-52-2015-KSRF-505.pdf"
    },
    {
      "lp": 18,
      "standard": "KSRF 510 – Pierwsze badanie – salda otwarcia",
      "zastosowanie": "Stosuje się przy pierwszym badaniu jednostki.",
      "cele": "Celem biegłego rewidenta jest uzyskanie wystarczających i odpowiednich dowodów badania, że:\na) salda otwarcia nie zawierają istotnych zniekształceń, które wpływałyby na sprawozdania finansowe bieżącego okresu,\nb) zasady rachunkowości stosowane przy sporządzaniu sald otwarcia zostały prawidłowo przeniesione oraz są konsekwentnie stosowane.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/500,KRBR-uchwala-2783-52-2015-KSRF-510.pdf"
    },
    {
      "lp": 19,
      "standard": "KSRF 520 – Procedury analityczne",
      "zastosowanie": "Stosuje się w każdym badaniu.",
      "cele": "Celem biegłego rewidenta jest stosowanie procedur analitycznych jako procedur:\na) analitycznych na etapie planowania,\nb) analitycznych jako procedur wiarygodności (jeśli są stosowane),\nc) analitycznych na zakończenie badania w celu całościowej oceny sprawozdań finansowych.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/511,KRBR-uchwala-2783-52-2015-KSRF-520.pdf"
    },
    {
      "lp": 20,
      "standard": "KSRF 530 – Dobór próby do badania",
      "zastosowanie": "Stosuje się, jeśli biegły rewident stosuje podejście oparte na próbie.",
      "cele": "Celem biegłego rewidenta jest zaprojektowanie i zastosowanie próby badania w sposób, który pozwala na uzyskanie wystarczających i odpowiednich dowodów badania, dających podstawę do wnioskowania o całej populacji.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/512,KRBR-uchwala-2783-52-2015-KSRF-530.pdf"
    },
    {
      "lp": 21,
      "standard": "KSRF 540 – Badanie szacunków księgowych i ujawnień",
      "zastosowanie": "Stosuje się, jeśli sprawozdanie finansowe zawiera szacunki księgowe.",
      "cele": "Celem biegłego rewidenta jest uzyskanie wystarczających i odpowiednich dowodów badania dotyczących tego, czy szacunki księgowe, w tym szacunki wartości godziwej, oraz związane z nimi ujawnienia są wolne od istotnych zniekształceń.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/501,KRBR-uchwala-2783-52-2015-KSRF-540.pdf"
    },
    {
      "lp": 22,
      "standard": "KSRF 550 – Podmioty powiązane",
      "zastosowanie": "Stosuje się w każdym badaniu.",
      "cele": "Celem biegłego rewidenta jest uzyskanie wystarczających i odpowiednich dowodów badania, że:\na) wszystkie relacje i transakcje z podmiotami powiązanymi zostały rozpoznane i ujawnione zgodnie z mającymi zastosowanie ramowymi zasadami sprawozdawczości finansowej,\nb) skutki tych relacji i transakcji zostały prawidłowo ujęte w sprawozdaniach finansowych.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/509,KRBR-uchwala-2783-52-2015-KSRF-550.pdf"
    },
    {
      "lp": 23,
      "standard": "KSRF 560 – Zdarzenia następujące po dniu bilansowym",
      "zastosowanie": "Stosuje się w każdym badaniu.",
      "cele": "Cele biegłego rewidenta to:\na) uzyskanie wystarczających i odpowiednich dowodów badania, że zdarzenia po dniu bilansowym zostały prawidłowo ujęte i ujawnione,\nb) odpowiednia reakcja na fakty ujawnione po dacie sprawozdania biegłego rewidenta, które mogłyby wpłynąć na jego opinię.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/514,KRBR-uchwala-2783-52-2015-KSRF-560.pdf"
    },
    {
      "lp": 24,
      "standard": "KSRF 570 – Kontynuacja działalności",
      "zastosowanie": "Stosuje się w każdym badaniu.",
      "cele": "Cele biegłego rewidenta to:\na) uzyskanie wystarczających i odpowiednich dowodów badania co do zasadności założenia kontynuacji działalności,\nb) ustalenie, czy istnieją istotne niepewności w tym zakresie,\nc) odpowiednie ujęcie i ujawnienie informacji o kontynuacji działalności.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/519,KRBR-uchwala-2783-52-2015-KSRF-570.pdf"
    },
    {
      "lp": 25,
      "standard": "KSRF 580 – Oświadczenia kierownictwa",
      "zastosowanie": "Stosuje się w każdym badaniu.",
      "cele": "Celem biegłego rewidenta jest uzyskanie pisemnych oświadczeń od kierownictwa potwierdzających odpowiedzialność za sprawozdania finansowe i dostarczone informacje, oraz reagowanie w przypadku odmowy ich podpisania.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/520,KRBR-uchwala-2783-52-2015-KSRF-580.pdf"
    },
    {
      "type": "section",
      "title": "Wnioski i sprawozdawczość"
    },
    {
      "lp": 26,
      "standard": "KSRF 600 – Wykorzystanie pracy innego biegłego rewidenta",
      "zastosowanie": "Stosuje się, jeśli badanie obejmuje jednostki zależne lub skonsolidowane.",
      "cele": "Celem biegłego rewidenta jest ustalenie, czy praca innego biegłego rewidenta dostarcza wystarczających i odpowiednich dowodów badania dotyczących sprawozdań finansowych jednostki, dla której wydaje opinię.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/523,KRBR-uchwala-2783-52-2015-KSRF-600.pdf"
    },
    {
      "lp": 27,
      "standard": "KSRF 610 – Wykorzystanie pracy audytorów wewnętrznych",
      "zastosowanie": "Stosuje się, jeśli jednostka posiada audyt wewnętrzny.",
      "cele": "Celem biegłego rewidenta jest ustalenie, w jakim zakresie może polegać na pracy audytorów wewnętrznych przy planowaniu i przeprowadzaniu badania.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/524,KRBR-uchwala-2783-52-2015-KSRF-610.pdf"
    },
    {
      "lp": 28,
      "standard": "KSRF 620 – Wykorzystanie pracy eksperta",
      "zastosowanie": "Stosuje się, jeśli biegły rewident korzysta z pracy eksperta.",
      "cele": "Celem biegłego rewidenta jest ustalenie, czy praca eksperta jest odpowiednia do celów badania.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/525,KRBR-uchwala-2783-52-2015-KSRF-620.pdf"
    },
    {
      "lp": 29,
      "standard": "KSRF 700 – Formułowanie opinii i sprawozdania z badania",
      "zastosowanie": "Stosuje się w każdym badaniu.",
      "cele": "Cele biegłego rewidenta to:\na) sformułowanie opinii na temat sprawozdania finansowego,\nb) sporządzenie sprawozdania biegłego rewidenta zgodnie z wymaganiami MSB.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/526,KRBR-uchwala-2783-52-2015-KSRF-700.pdf"
    },
    {
      "lp": 30,
      "standard": "KSRF 705 – Modyfikacje opinii w sprawozdaniu biegłego rewidenta",
      "zastosowanie": "Stosuje się, gdy zachodzą przesłanki do modyfikacji opinii.",
      "cele": "Celem biegłego rewidenta jest wyrażenie odpowiedniego rodzaju zmodyfikowanej opinii, jeśli sprawozdania finansowe zawierają istotne zniekształcenia lub jeśli nie uzyskał wystarczających i odpowiednich dowodów badania.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/527,KRBR-uchwala-2783-52-2015-KSRF-705.pdf"
    },
    {
      "lp": 31,
      "standard": "KSRF 706 – Akapity objaśniające i inne akapity w sprawozdaniu biegłego rewidenta",
      "zastosowanie": "Stosuje się, gdy istnieje potrzeba dodatkowego podkreślenia określonych kwestii.",
      "cele": "Celem biegłego rewidenta jest właściwe uwzględnienie w sprawozdaniu akapitów objaśniających lub innych akapitów, które zwracają uwagę użytkowników na istotne sprawy.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/528,KRBR-uchwala-2783-52-2015-KSRF-706.pdf"
    },
    {
      "lp": 32,
      "standard": "KSRF 710 – Informacje porównawcze",
      "zastosowanie": "Stosuje się, jeśli sprawozdania finansowe zawierają dane porównawcze.",
      "cele": "Celem biegłego rewidenta jest uzyskanie wystarczających i odpowiednich dowodów badania, że informacje porównawcze zostały ujęte i ujawnione zgodnie z obowiązującymi zasadami.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/529,KRBR-uchwala-2783-52-2015-KSRF-710.pdf"
    },
    {
      "lp": 33,
      "standard": "KSRF 810 – Badanie skróconych sprawozdań finansowych",
      "zastosowanie": "Stosuje się, jeśli biegły rewident bada skrócone sprawozdanie finansowe.",
      "cele": "Celem biegłego rewidenta jest wyrażenie opinii, czy skrócone sprawozdanie finansowe jest zgodne z pełnym sprawozdaniem finansowym, które zostało wcześniej zbadane.",
      "czy": "TAK",
      "link": "https://www.pibr.org.pl/assets/file/530,KRBR-uchwala-2783-52-2015-KSRF-810.pdf"
    }
  ],
  "Users": [
    {
      "id": 1,
      "name": "Anna Kowalska",
      "email": "anna.kowalska@example.com",
      "active": true,
      "role": "Administrator",
      "last": "2025-08-21",
      "actFrom": "2024-11-05",
      "actTo": "2025-03-20",
      "projects": [
        "DR/2025/123456",
        "DR/2025/123356",
        "DR/2025/123357"
      ]
    },
    {
      "id": 2,
      "name": "Jan Nowak",
      "email": "jan.nowak@example.com",
      "active": false,
      "role": "Kierownik",
      "last": "2025-08-17",
      "actFrom": "2024-10-01",
      "actTo": "2025-03-01",
      "projects": [
        "DR/2025/123111"
      ]
    },
    {
      "id": 3,
      "name": "Katarzyna Wiśniewska",
      "email": "katarzyna.wisniewska@example.com",
      "active": true,
      "role": "Asystent",
      "last": "2025-08-23",
      "actFrom": "2024-09-10",
      "actTo": "2025-03-10",
      "projects": [
        "DR/2025/123222"
      ]
    },
    {
      "id": 4,
      "name": "Piotr Zieliński",
      "email": "piotr.zielinski@example.com",
      "active": true,
      "role": "Asystent",
      "last": "2025-08-01",
      "actFrom": "2024-09-10",
      "actTo": "2025-03-15",
      "projects": [
        "DR/2025/123333"
      ]
    },
    {
      "id": 5,
      "name": "Magdalena Lewandowska",
      "email": "magdalena.lewandowska@example.com",
      "active": false,
      "role": "Klient",
      "last": "2025-07-11",
      "actFrom": "2024-09-10",
      "actTo": "2025-02-01",
      "projects": [
        "DR/2025/123444"
      ]
    },
    {
      "id": 6,
      "name": "Tomasz Kamiński",
      "email": "tomasz.kaminski@example.com",
      "active": true,
      "role": "Asystent",
      "last": "2025-08-27",
      "actFrom": "2024-09-10",
      "actTo": "2025-03-30",
      "projects": [
        "DR/2025/123555"
      ]
    },
    {
      "id": 7,
      "name": "Agnieszka Dąbrowska",
      "email": "agnieszka.dabrowska@example.com",
      "active": true,
      "role": "Asystent",
      "last": "2025-08-26",
      "actFrom": "2024-09-10",
      "actTo": "2025-03-30",
      "projects": [
        "DR/2025/123666"
      ]
    },
    {
      "id": 8,
      "name": "Marek Wojciechowski",
      "email": "marek.wojciechowski@example.com",
      "active": false,
      "role": "Asystent",
      "last": "2025-08-15",
      "actFrom": "2024-09-10",
      "actTo": "2025-03-30",
      "projects": [
        "DR/2025/123777"
      ]
    },
    {
      "id": 9,
      "name": "Joanna Kaczmarek",
      "email": "joanna.kaczmarek@example.com",
      "active": true,
      "role": "Administrator",
      "last": "2025-08-25",
      "actFrom": "2024-09-10",
      "actTo": "2025-03-30",
      "projects": [
        "DR/2025/123888"
      ]
    },
    {
      "id": 10,
      "name": "Paweł Grabowski",
      "email": "pawel.grabowski@example.com",
      "active": true,
      "role": "Klient",
      "last": "2025-08-25",
      "actFrom": "2024-09-10",
      "actTo": "2025-03-30",
      "projects": [
        "DR/2025/123999"
      ]
    },
    {
      "id": 11,
      "name": "Ewa Majewska",
      "email": "ewa.majewska@example.com",
      "active": true,
      "role": "Asystent",
      "last": "2025-08-20",
      "actFrom": "2024-10-15",
      "actTo": "2025-03-22",
      "projects": [
        "DR/2025/124000"
      ]
    },
    {
      "id": 12,
      "name": "Krzysztof Bąk",
      "email": "krzysztof.bak@example.com",
      "active": false,
      "role": "Kierownik",
      "last": "2025-08-18",
      "actFrom": "2024-10-01",
      "actTo": "2025-03-02",
      "projects": [
        "DR/2025/124001"
      ]
    },
    {
      "id": 13,
      "name": "Monika Sikora",
      "email": "monika.sikora@example.com",
      "active": true,
      "role": "Asystent",
      "last": "2025-08-19",
      "actFrom": "2024-09-20",
      "actTo": "2025-03-15",
      "projects": [
        "DR/2025/124002"
      ]
    },
    {
      "id": 14,
      "name": "Robert Górski",
      "email": "robert.gorski@example.com",
      "active": true,
      "role": "Asystent",
      "last": "2025-08-21",
      "actFrom": "2024-09-15",
      "actTo": "2025-03-20",
      "projects": [
        "DR/2025/124003"
      ]
    },
    {
      "id": 15,
      "name": "Sylwia Król",
      "email": "sylwia.krol@example.com",
      "active": false,
      "role": "Klient",
      "last": "2025-07-25",
      "actFrom": "2024-09-10",
      "actTo": "2025-02-15",
      "projects": [
        "DR/2025/124004"
      ]
    },
    {
      "id": 16,
      "name": "Łukasz Pawlak",
      "email": "lukasz.pawlak@example.com",
      "active": true,
      "role": "Asystent",
      "last": "2025-08-24",
      "actFrom": "2024-09-12",
      "actTo": "2025-03-25",
      "projects": [
        "DR/2025/124005"
      ]
    },
    {
      "id": 17,
      "name": "Natalia Woźniak",
      "email": "natalia.wozniak@example.com",
      "active": true,
      "role": "Asystent",
      "last": "2025-08-26",
      "actFrom": "2024-09-18",
      "actTo": "2025-03-28",
      "projects": [
        "DR/2025/124006"
      ]
    },
    {
      "id": 18,
      "name": "Marcin Ostrowski",
      "email": "marcin.ostrowski@example.com",
      "active": false,
      "role": "Asystent",
      "last": "2025-08-15",
      "actFrom": "2024-09-20",
      "actTo": "2025-03-30",
      "projects": [
        "DR/2025/124007"
      ]
    },
    {
      "id": 19,
      "name": "Patrycja Czerwińska",
      "email": "patrycja.czerwinska@example.com",
      "active": true,
      "role": "Administrator",
      "last": "2025-08-27",
      "actFrom": "2024-09-10",
      "actTo": "2025-03-30",
      "projects": [
        "DR/2025/124008"
      ]
    },
    {
      "id": 20,
      "name": "Tadeusz Jankowski",
      "email": "tadeusz.jankowski@example.com",
      "active": true,
      "role": "Klient",
      "last": "2025-08-28",
      "actFrom": "2024-09-10",
      "actTo": "2025-03-30",
      "projects": [
        "DR/2025/124009"
      ]
    }
  ],
  "Projects": [
    {
      "id": 1,
      "name": "DR/2025/123456",
      "status": "active",
      "progress": 60,
      "deadline": "2025-09-30",
      "klient": "Alphatech Sp. z o.o.",
      "users": [
        "Anna Kowalska",
        "Jan Nowak"
      ],
      "contact": {
        "name": "Jan Kowalski",
        "email": "jan.kowalski@alphatech.com",
        "phone": "22 123 45 67"
      },
      "phases": [
        {
          "label": "I. Rozpoczęcie",
          "screens": [
            {
              "id": 1,
              "title": "I.1 Test niezależności kluczowego biegłego rewidenta",
              "tabs": [
                {
                  "title:": "Kwestionariusz",
                  "type": "CUSTOM",
                  "columns": [
                    {
                      "type": "no",
                      "label": "Lp."
                    },
                    {
                      "type": "description",
                      "label": "Opis"
                    },
                    {
                      "type": "yes_no",
                      "label": "Odpowiedź",
                      "default": "no"
                    },
                    {
                      "type": "comment",
                      "label": "Komentarz"
                    },
                    {
                      "type": "author",
                      "label": "Zatwierdź"
                    }
                  ],
                  "rows": [
                    {
                      "id": "1",
                      "q": "Czy FA posiada instrumenty finansowe, w tym udziały w kapitale własnym, papiery\nwartościowe w rozumieniu art. 3 pkt. 1 ustawy z dnia 29 lipca 2005 r. o obrocie\ninstrumentami finansowymi, kredyty, pożyczki lub inne instrumenty dłużne, w tym\nprawa i obowiązki do nabycia tych instrumentów finansowych oraz instrumentów\npochodnych bezpośrednio powiązanych z tymi instrumentami finansowymi,\nwyemitowane przez badaną jednostkę?\nUwaga! Nie dotyczy takich, które posiadane są pośrednio poprzez udział\nw zdywersyfikowanych programach zbiorowego inwestowania, w szczególności\nfunduszach emerytalnych, funduszach inwestycyjnych oraz ubezpieczeniowych\nfunduszach kapitałowych oferowanych przez zakłady ubezpieczeń, o ile\nprogramy te nie są kontrolowane przez Ciebie lub osoby blisko z Tobą związane,\nlub w stosunku do tych programów nie są podejmowane decyzje inwestycyjne,\nna które wpływ masz Ty lub osoby blisko z Tobą związane.",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "2",
                      "q": "Czy FA posiada instrumenty finansowe, w tym udziały w kapitale własnym, papiery\nwartościowe w rozumieniu art. 3 pkt. 1 ustawy z dnia 29 lipca 2005 r. o obrocie\ninstrumentami finansowymi, kredyty, pożyczki lub inne instrumenty dłużne, w tym\nprawa i obowiązki do nabycia tych instrumentów finansowych oraz instrumentów\npochodnych bezpośrednio powiązanych z tymi instrumentami finansowymi,\nwyemitowane przez jednostkę powiązaną z jednostką badaną?\nUwaga! Nie dotyczy takich, które posiadane są pośrednio poprzez udział\nw zdywersyfikowanych programach zbiorowego inwestowania, w szczególności\nfunduszach emerytalnych, funduszach inwestycyjnych oraz ubezpieczeniowych\nfunduszach kapitałowych oferowanych przez zakłady ubezpieczeń, o ile\nprogramy te nie są kontrolowane przez Ciebie lub osoby blisko z Tobą związane,\nlub w stosunku do tych programów nie są podejmowane decyzje inwestycyjne,\nna które wpływ masz Ty lub osoby blisko z Tobą związane.",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "3",
                      "q": "Czy FA uczestniczy/-yła w transakcjach, których przedmiotem są instrumenty finansowe określone w pkt. 1-4?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "4",
                      "q": "Czy FA łączy lub łączył z badaną jednostką stosunek gospodarczy lub inny stosunek, który może/mógł spowodować konflikt interesów?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "5",
                      "q": "Czy FA łączy lub łączył z badaną jednostką stosunek gospodarczy lub inny stosunek,który może/mógł być postrzegany jako powodujący konflikt interesów?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "6",
                      "q": "Czy FA uczestniczy / uczestniczyła w roku poprzedzającym rok badany, w roku badanym i w okresie bieżącego roku w prowadzeniu ksiąg rachunkowych badanej jednostki?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "7",
                      "q": "Czy FA uczestniczy / uczestniczyła w roku poprzedzającym rok badany, w roku badanym i w okresie bieżącego roku w sporządzaniu dokumentacji księgowej badanej jednostki?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "8",
                      "q": "Czy FA uczestniczy / uczestniczyła w roku poprzedzającym rok badany, w roku badanym i w okresie bieżącego roku w sporządzaniu sprawozdań finansowych badanej jednostki?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "9",
                      "q": "Czy FA jest / była przedstawicielem prawnym (pełnomocnikiem) badanej jednostki?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "10",
                      "q": "Czy FA jest / była członkiem organów nadzorczych badanej jednostki?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "11",
                      "q": "Czy FA jest / była członkiem organów zarządzających badanej jednostki?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "12",
                      "q": "Czy uczestniczysz / uczestniczyłeś w okresach określonych w pkt. 10 w sporządzaniu sprawozdań finansowych badanej jednostki?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "13",
                      "q": "Czy osoby blisko z Tobą związane uczestniczą / uczestniczyły w okresach określonych w pkt. 10 w prowadzeniu ksiąg rachunkowych badanej jednostki?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "14",
                      "q": "Czy osoby blisko z Tobą związane uczestniczą / uczestniczyły w okresach określonych\nw pkt. 10 w sporządzaniu dokumentacji księgowej badanej jednostki?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "15",
                      "q": "Czy osoby blisko z Tobą związane uczestniczą / uczestniczyły w okresach określonych\nw pkt. 10 w sporządzaniu sprawozdań finansowych badanej jednostki?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "16",
                      "q": "Czy jesteś / byłeś przedstawicielem prawnym (pełnomocnikiem) badanej jednostki?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "17",
                      "q": "Czy jesteś / byłeś członkiem organów nadzorczych badanej jednostki?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "18",
                      "q": "Czy jesteś / byłeś członkiem organów zarządzających badanej jednostki?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "19",
                      "q": "Czy jesteś / byłeś pracownikiem badanej jednostki?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "20",
                      "q": "Czy jesteś / byłeś przedstawicielem prawnym (pełnomocnikiem) jednostki powiązanej z badaną jednostką?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "21",
                      "q": "Czy jesteś / byłeś członkiem organów nadzorczych jednostki powiązanej z badaną jednostką?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "22",
                      "q": "Czy jesteś / byłeś członkiem organów zarządzających jednostki powiązanej z badaną jednostką?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "23",
                      "q": "Czy jesteś / byłeś pracownikiem jednostki powiązanej z badaną jednostką?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "24",
                      "q": "Czy osoby blisko z Tobą związane są / były przedstawicielem prawnym (pełnomocnikiem) badanej jednostki?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "25",
                      "q": "Czy osoby blisko z Tobą związane są / były członkiem organów nadzorczych badanej jednostki?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "26",
                      "q": "Czy osoby blisko z Tobą związane są / były członkiem organów zarządzających badanej jednostki?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "27",
                      "q": "Czy osoby blisko z Tobą związane są / były pracownikiem badanej jednostki?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "28",
                      "q": "Czy osoby blisko z Tobą związane są / były przedstawicielem prawnym (pełnomocnikiem) jednostki powiązanej z badaną jednostką?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "29",
                      "q": "Czy osoby blisko z Tobą związane są / były członkiem organów nadzorczych jednostki powiązanej z badaną jednostką?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "30",
                      "q": "Czy osoby blisko z Tobą związane są / były członkiem organów zarządzających jednostki powiązanej z badaną jednostką?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "31",
                      "q": "Czy osoby blisko z Tobą związane są / były pracownikiem jednostki powiązanej z badaną jednostką?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "32",
                      "q": "Czy bierzesz / brałeś udział w procesie zarządzania badaną jednostką?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "33",
                      "q": "Czy bierzesz / brałeś udział w procesie podejmowania decyzji przez badaną jednostkę?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "34",
                      "q": "Czy przyjąłeś / posiadasz od badanej jednostki, będącej bankiem lub podobną instytucją, pożyczkę lub poręczenie pożyczki udzieloną z pominięciem zwykłych procedur, warunków i wymogów kredytowych – podaj wartość kredytu/pożyczki?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "35",
                      "q": "Czy osoby blisko związane przyjęły / posiadają od badanej jednostki, będącej bankiem lub podobną instytucją, pożyczkę lub poręczenie pożyczki udzieloną z pominięciem zwykłych procedur, warunków i wymogów kredytowych – podaj wartość kredytu/pożyczki?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "36",
                      "q": "Czy przyjąłeś / posiadasz od badanej jednostki, niebędącej bankiem lub podobną instytucją, pożyczkę lub poręczenie pożyczki stanowiącą istotną wartość dla Ciebie oraz istotną dla pożyczkodawcy – podaj wartość pożyczki?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "37",
                      "q": "Czy osoby blisko związane przyjęły / posiadają od badanej jednostki, niebędącej bankiem lub podobną instytucją, pożyczkę lub poręczenie pożyczki stanowiącą istotną wartość dla pożyczkobiorcy oraz istotną dla pożyczkodawcy – podaj wartość pożyczki?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "38",
                      "q": "Czy udzieliłeś badanej jednostce niebędącej bankiem lub podobną instytucją / masz należność od badanej jednostki z tytułu pożyczki lub poręczenia pożyczki stanowiącej istotną wartość dla pożyczkobiorcy oraz istotną dla pożyczkodawcy – podaj wartość pożyczki?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "39",
                      "q": "Czy osoby blisko związane udzieliły badanej jednostce niebędącej bankiem lub podobną instytucją / mają należność od badanej jednostki z tytułu pożyczki lub poręczenia pożyczki stanowiącej istotną wartość dla pożyczkobiorcy oraz istotną dla pożyczkodawcy – podaj wartość pożyczki?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "40",
                      "q": "Czy posiadasz / posiadałeś bliskie powiązania gospodarcze z badaną jednostką lub z jego kierownictwem?",
                      "subquestions": [
                        {
                          "id": "40a",
                          "q": "Czy posiadasz / posiadałeś istotny udział finansowy we wspólnym przedsięwzięciu z badaną jednostką, jego właścicielem posiadającym pakiet kontrolny, członkiem zarządu lub kierownictwa wyższego szczebla badanej jednostki?",
                          "answer": {
                            "value": "",
                            "comment": ""
                          }
                        },
                        {
                          "id": "40b",
                          "q": "Czy występuje / występowało istotne powiązanie usług lub produktów z usługami lub produktami badanej jednostki i wprowadzanie ich na rynek pod wspólnym szyldem?",
                          "answer": {
                            "value": "",
                            "comment": ""
                          }
                        },
                        {
                          "id": "40c",
                          "q": "Czy ma / miało miejsce prowadzenie przez podmiot dystrybucji lub marketingu produktów lub usług badanej jednostki (i odwrotnie)?",
                          "answer": {
                            "value": "",
                            "comment": ""
                          }
                        }
                      ],
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "41",
                      "q": "Czy osoby blisko związane posiadają / posiadały bliskie powiązania gospodarcze z badaną jednostką lub z jej kierownictwem?",
                      "subquestions": [
                        {
                          "id": "41a",
                          "q": "Czy posiadają / posiadały istotny udział finansowy we wspólnym przedsięwzięciu z badaną jednostką, jego właścicielem posiadającym pakiet kontrolny, członkiem zarządu lub kierownictwa wyższego szczebla badanej jednostki?",
                          "answer": {
                            "value": "",
                            "comment": ""
                          }
                        },
                        {
                          "id": "41b",
                          "q": "Czy występuje / występowało istotne powiązanie usług lub produktów z usługami lub produktami badanej jednostki i wprowadzanie ich na rynek pod wspólnym szyldem?",
                          "answer": {
                            "value": "",
                            "comment": ""
                          }
                        },
                        {
                          "id": "41c",
                          "q": "Czy ma / miało miejsce prowadzenie przez podmiot dystrybucji lub marketingu produktów lub usług badanej jednostki (i odwrotnie)?",
                          "answer": {
                            "value": "",
                            "comment": ""
                          }
                        }
                      ],
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "42",
                      "q": "Czy żądałeś / przyjąłeś od badanej jednostki jakiekolwiek korzyści majątkowe lub osobiste, których wartość obiektywna, racjonalna i poinformowana osoba trzecia uznałaby za przekraczającą niewielką lub nieistotną?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "43",
                      "q": "Czy osoby blisko związane żądały / przyjęły od badanej jednostki jakiekolwiek korzyści majątkowe lub osobiste, których wartość obiektywna, racjonalna i poinformowana osoba trzecia uznałaby za przekraczającą niewielką lub nieistotną?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "44",
                      "q": "Czy żądałeś / przyjąłeś od jednostki powiązanej z badaną jednostką jakiekolwiek korzyści majątkowe lub osobiste, których wartość obiektywna, racjonalna i poinformowana osoba trzecia uznałaby za przekraczającą niewielką lub nieistotną?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "45",
                      "q": "Czy osoby blisko związane żądały / przyjęły od jednostki powiązanej z badaną jednostką jakiekolwiek korzyści majątkowe lub osobiste, których wartość obiektywna, racjonalna i poinformowana osoba trzecia uznałaby za przekraczającą niewielką lub nieistotną?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "46",
                      "q": "Czy istnieją jakiekolwiek inne okoliczności ograniczające Twoją bezstronność i niezależność od badanej jednostki? Określ jakie.",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "47",
                      "q": "Czy okres współpracy z klientem przekroczy dozwolony dla jzp okres 5 lat lub inny okres jeśli jest określony w wewnętrznych procedurach?",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    },
                    {
                      "id": "48",
                      "q": "Czy istnieją jakiekolwiek inne okoliczności ograniczające Twoją bezstronność i niezależność od badanej jednostki, w szczególności dotyczące wymogów Kodeksu Etyki Zawodowych Księgowych IFAC.",
                      "answer": {
                        "value": "",
                        "comment": ""
                      },
                      "author": "",
                      "approver": "",
                      "date": "",
                      "approvedAt": null
                    }
                  ]
                },
                {
                  "title:": "Zapotrzebowanie",
                  "type": "REQUEST"
                },
                {
                  "title:": "Pliki",
                  "type": "FILES"
                },
                {
                  "title:": "Dziennik zdarzeń",
                  "type": "ACTIVITY_LOG"
                }
              ]
            },
            {
              "id": 2,
              "title": "I.2 Test niezależności dla firmy audytorskiej",
              "tabs": [
                {
                  "title:": "Kwestionariusz",
                  "type": "CUSTOM",
                  "columns": [
                    {
                      "type": "no",
                      "label": "Lp."
                    },
                    {
                      "type": "description",
                      "label": "Opis"
                    },
                    {
                      "type": "yes_no",
                      "label": "Odpowiedź",
                      "default": "no"
                    },
                    {
                      "type": "comment",
                      "label": "Komentarz"
                    },
                    {
                      "type": "author",
                      "label": "Zatwierdź"
                    }
                  ],
                  "rows": [
                    {
                      "id": "1",
                      "q": "Czy FA posiada instrumenty finansowe, w tym udziały w kapitale własnym, papiery wartościowe w rozumieniu art. 3 pkt. 1 ustawy z dnia 29 lipca 2005 r. o obrocie instrumentami finansowymi, kredyty, pożyczki lub inne instrumenty dłużne, w tym prawa i obowiązki do nabycia tych instrumentów finansowych oraz instrumentów pochodnych bezpośrednio powiązanych z tymi instrumentami finansowymi, wyemitowane przez badaną jednostkę? Uwaga! Nie dotyczy takich, które posiadane są pośrednio poprzez udział w zdywersyfikowanych programach zbiorowego inwestowania, w szczególności funduszach emerytalnych, funduszach inwestycyjnych oraz ubezpieczeniowych funduszach kapitałowych oferowanych przez zakłady ubezpieczeń, o ile programy te nie są kontrolowane przez Ciebie lub osoby blisko z Tobą związane, lub w stosunku do tych programów nie są podejmowane decyzje inwestycyjne, na które wpływ masz Ty lub osoby blisko z Tobą związane.",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "2",
                      "q": "Czy FA posiada instrumenty finansowe, w tym udziały w kapitale własnym, papiery wartościowe w rozumieniu art. 3 pkt. 1 ustawy z dnia 29 lipca 2005 r. o obrocie instrumentami finansowymi, kredyty, pożyczki lub inne instrumenty dłużne, w tym prawa i obowiązki do nabycia tych instrumentów finansowych oraz instrumentów pochodnych bezpośrednio powiązanych z tymi instrumentami finansowymi, wyemitowane przez jednostkę powiązaną z jednostką badaną? Uwaga! Nie dotyczy takich, które posiadane są pośrednio poprzez udział w zdywersyfikowanych programach zbiorowego inwestowania, w szczególności funduszach emerytalnych, funduszach inwestycyjnych oraz ubezpieczeniowych funduszach kapitałowych oferowanych przez zakłady ubezpieczeń, o ile programy te nie są kontrolowane przez Ciebie lub osoby blisko z Tobą związane, lub w stosunku do tych programów nie są podejmowane decyzje inwestycyjne, na które wpływ masz Ty lub osoby blisko z Tobą związane.",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "3",
                      "q": "Czy FA uczestniczy/-yła w transakcjach, których przedmiotem są instrumenty finansowe określone w pkt. 1–4?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "4",
                      "q": "Czy FA łączy lub łączył z badaną jednostką stosunek gospodarczy lub inny stosunek, który może/mógł spowodować konflikt interesów?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "5",
                      "q": "Czy FA łączy lub łączył z badaną jednostką stosunek gospodarczy lub inny stosunek, który może/mógł być postrzegany jako powodujący konflikt interesów?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "6",
                      "q": "Czy FA uczestniczy / uczestniczyła w roku poprzedzającym rok badany, w roku badanym i w okresie bieżącego roku w prowadzeniu ksiąg rachunkowych badanej jednostki?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "7",
                      "q": "Czy FA uczestniczy / uczestniczyła w roku poprzedzającym rok badany, w roku badanym i w okresie bieżącego roku w sporządzaniu dokumentacji księgowej badanej jednostki?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "8",
                      "q": "Czy FA uczestniczy / uczestniczyła w roku poprzedzającym rok badany, w roku badanym i w okresie bieżącego roku w sporządzaniu sprawozdań finansowych badanej jednostki?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "9",
                      "q": "Czy FA jest / była przedstawicielem prawnym (pełnomocnikiem) badanej jednostki?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "10",
                      "q": "Czy FA jest / była członkiem organów nadzorczych badanej jednostki?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "11",
                      "q": "Czy FA jest / była członkiem organów zarządzających badanej jednostki?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "12",
                      "q": "Czy FA jest / była przedstawicielem prawnym (pełnomocnikiem) jednostki powiązanej z badaną jednostką?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "13",
                      "q": "Czy FA jest / była członkiem organów nadzorczych jednostki powiązanej z badaną jednostką?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "14",
                      "q": "Czy FA jest / była członkiem organów zarządzających jednostki powiązanej z badaną jednostką?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "15",
                      "q": "Czy FA bierze / brała udział w procesie zarządzania badaną jednostką?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "16",
                      "q": "Czy FA bierze / brała udział w procesie podejmowania decyzji przez badaną jednostkę?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "17",
                      "q": "Czy FA przyjęła / posiada od badanej jednostki, będącej bankiem lub podobną instytucją, pożyczkę lub poręczenie pożyczki udzieloną z pominięciem zwykłych procedur, warunków i wymogów kredytowych – podaj wartość kredytu/pożyczki?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "18",
                      "q": "Czy FA przyjęła / posiada od badanej jednostki, niebędącej bankiem lub podobną instytucją, pożyczkę lub poręczenie pożyczki stanowiącą istotną wartość dla Ciebie oraz istotną dla pożyczkodawcy – podaj wartość pożyczki?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "19",
                      "q": "Czy FA udzieliła badanej jednostce niebędącej bankiem lub podobną instytucją / masz należność od badanej jednostki z tytułu pożyczki lub poręczenia pożyczki stanowiącej istotną wartość dla pożyczkobiorcy oraz istotną dla pożyczkodawcy – podaj wartość pożyczki?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "20",
                      "q": "Czy FA posiada / posiadała bliskie powiązania gospodarcze z badaną jednostką lub z jej kierownictwem, w szczególności: a) czy FA posiada / posiadała istotny udział finansowy we wspólnym przedsięwzięciu z badaną jednostką, jej właścicielem posiadającym pakiet kontrolny, członkiem zarządu lub kierownictwa wyższego szczebla badanej jednostki? b) czy występuje / występowało istotne powiązanie usług lub produktów z usługami lub produktami badanej jednostki i wprowadzanie ich na rynek pod wspólnym szyldem? c) czy ma / miało miejsce prowadzenie przez podmiot dystrybucji lub marketingu produktów lub usług badanej jednostki (i odwrotnie)?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "21",
                      "q": "Czy FA żądała / przyjęła od badanej jednostki jakiekolwiek korzyści majątkowe lub osobiste, których wartość obiektywna, racjonalna i poinformowana osoba trzecia uznałaby za przekraczającą niewielką lub nieistotną?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "22",
                      "q": "Czy FA żądała / przyjęła od jednostki powiązanej z badaną jednostką jakiekolwiek korzyści majątkowe lub osobiste, których wartość obiektywna, racjonalna i poinformowana osoba trzecia uznałaby za przekraczającą niewielką lub nieistotną?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "23",
                      "q": "Czy istnieją jakiekolwiek inne okoliczności ograniczające bezstronność i niezależność FA od badanej jednostki? Określ jakie.",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "24",
                      "q": "Czy podmioty należące do wspólnej sieci z FA lub powiązane z FA w taki sposób, że mogą wywierać istotny wpływ na swoją działalność, posiadają bliskie powiązania gospodarcze z klientem badania lub z jego kierownictwem. W szczególności: a) czy FA lub firma powiązana z FA posiada istotny udział finansowy we wspólnym przedsięwzięciu z klientem badania, jego właścicielem posiadającym pakiet kontrolny, członkiem zarządu lub kierownictwa wyższego szczebla klienta badania? b) czy występuje istotne powiązanie usług lub produktów z usługami lub produktami klienta badania i wprowadzanie ich na rynek pod wspólnym szyldem? c) czy ma miejsce prowadzenie przez FA lub firmę powiązaną z FA dystrybucji lub marketingu produktów lub usług klienta badania (i odwrotnie)?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "25",
                      "q": "Czy FA w przynajmniej jednym roku, w okresie ostatnich 5 lat, osiągnęła z tytułu świadczenia usług na rzecz badanej jednostki nie będącej JZP przychód stanowiący co najmniej 40% całkowitego rocznego przychodu FA? Uwaga! Przepisu nie stosuje się do pierwszego roku działalności FA.",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "26",
                      "q": "Dla jednostek zainteresowania publicznego: Czy FA lub z nią powiązana lub jakikolwiek inny członek sieci działającej w państwach Unii Europejskiej, do której te firmy należą, nieprzerwanie przez okres 5 lat realizowały dla klienta badania zlecenie badania ustawowego?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "27",
                      "q": "Dla jednostek zainteresowania publicznego: Czy po ponownym podjęciu współpracy naruszony został 4-letni okres karencji?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "28",
                      "q": "Dla jednostek zainteresowania publicznego: Czy całkowite wynagrodzenie otrzymane od JZP za każde z trzech ostatnich lat obrotowych wynosi ponad 15% całkowitego wynagrodzenia uzyskanego przez FA przeprowadzającą badanie ustawowe w każdym z tych lat obrotowych?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "29",
                      "q": "Dla jednostek zainteresowania publicznego: Czy przez okres objęty badaniem i okres do chwili obecnej FA świadczyła na rzecz badanej jednostki, jej jednostki dominującej lub jednostek przez nią kontrolowanych usługi niebędące badaniem sprawozdań finansowych, inne niż wymienione w art. 136 ust. 2 ustawy o biegłych rewidentach?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "30",
                      "q": "Czy całkowite wynagrodzenie z usług, o których mowa w art. 136 ust. 2 ustawy o biegłych rewidentach, uzyskane w ciągu ostatnich kolejnych 3-ch lat przekroczyło 70% średniego wynagrodzenia płaconego w 3-ch kolejnych ostatnich latach obrotowych z tytułu badania ustawowego?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "31",
                      "q": "Czy FA przyjęła prezenty lub korzystała z gościnności badanej jednostki w wartości przekraczającej wielkości błahe i nieistotne? Określ ich wartość.",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "32",
                      "q": "Dla jednostek zainteresowania publicznego: Czy kluczowy biegły rewident będzie wykonywał czynności rewizji finansowej na rzecz badanej jednostki w okresie dłuższym niż 5 lat?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "33",
                      "q": "Dla jednostek zainteresowania publicznego: Czy minął okres krótszy niż 3 lata przerwy w odniesieniu do kluczowego biegłego rewidenta, który wykonywał badanie ustawowe dla badanej jednostki przez okres 5 lat?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    },
                    {
                      "id": "34",
                      "q": "Czy istnieją jakiekolwiek inne okoliczności ograniczające bezstronność i niezależność FA od badanej jednostki, w szczególności dotyczące wymogów Kodeksu Etyki Zawodowych Księgowych IFAC?",
                      "answer": {
                        "value": "Nie",
                        "comment": null
                      },
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null
                    }
                  ]
                },
                {
                  "title:": "Zapotrzebowanie",
                  "type": "REQUEST"
                },
                {
                  "title:": "Pliki",
                  "type": "FILES"
                },
                {
                  "title:": "Dziennik zdarzeń",
                  "type": "ACTIVITY_LOG"
                }
              ]
            },
            {
              "id": 3,
              "title": "I.3 Rola partnera odpowiedzialnego za zlecenie",
              "tabs": [
                {
                  "title:": "Kwestionariusz",
                  "type": "CUSTOM",
                  "columns": [
                    {
                      "type": "no",
                      "label": "Lp."
                    },
                    {
                      "type": "description",
                      "label": "Opis"
                    },
                    {
                      "type": "yes_no",
                      "label": "Odpowiedź",
                      "default": "no"
                    },
                    {
                      "type": "comment",
                      "label": "Komentarz"
                    },
                    {
                      "type": "author",
                      "label": "Zatwierdź"
                    }
                  ],
                  "rows": [
                    {
                      "sections": [
                        {
                          "type": "section",
                          "name": "Kompetencje firmy audytorskiej",
                          "questions": [
                            {
                              "id": "1",
                              "q": "Czy FA posiada odpowiednią wiedzę o branży i przedmiocie zlecenia?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "2",
                              "q": "Czy FA posiada odpowiednie doświadczenie w zakresie mających zastosowanie wymogów regulacyjnych (przepisów prawa)?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "3",
                              "q": "Czy FA posiada odpowiednie doświadczenie w zakresie wymogów sprawozdawczych?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "4",
                              "q": "Jeśli odpowiedź na pytania 2 i 3 jest przecząca lub wątpliwa, czy FA może skutecznie zdobyć i posiąść niezbędną wiedzę w tym zakresie?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "5",
                              "q": "Czy FA posiada wystarczający i odpowiedni personel posiadający niezbędne umiejętności i kompetencje?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "6",
                              "q": "Czy jest możliwy dostęp do ekspertów, kiedy zajdzie taka potrzeba?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "7",
                              "q": "Czy FA jest zdolna do zakończenia zlecenia w wyznaczonym terminie?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "8",
                              "q": "Czy istnieje dostęp do osób spełniających kryteria i wymogi dotyczące kontroli jakości wykonania zlecenia (weryfikacji), jeśli weryfikacja okaże się konieczna?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "9",
                              "q": "Czy FA posiada odpowiednie zasoby ludzkie do realizacji zlecenia w wyznaczonym terminie?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "10",
                              "q": "Czy FA jest w stanie zapewnić odpowiedni poziom nadzoru kluczowego biegłego rewidenta nad pracą pozostałych członków zespołu?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "11",
                              "q": "Czy zlecenie wymaga zaangażowania większego zespołu rewizyjnego lub kilku zespołów?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            }
                          ]
                        },
                        {
                          "type": "section",
                          "name": "Uczciwość klienta",
                          "questions": [
                            {
                              "id": "12",
                              "q": "Czy znasz klienta lub ktoś z Twojego otoczenia zna klienta?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "13",
                              "q": "Czy klient prowadzi działalność krajową czy międzynarodową?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "14",
                              "q": "Czy klient ma dobry wizerunek i reputację?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "15",
                              "q": "Opisz krótko charakter działalności gospodarczej klienta oraz jego praktyki gospodarcze.",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "16",
                              "q": "Czy reputacja głównych właścicieli, kierownictwa i podmiotów powiązanych nie budzi zastrzeżeń?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "17",
                              "q": "Czy znana jest tożsamość głównych właścicieli i kierownictwa klienta oraz organów nadzoru?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "18",
                              "q": "Czy inni biegli rewidenci odmówili świadczenia usług potencjalnemu klientowi?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "19",
                              "q": "Czy znane są przyczyny zmiany biegłego rewidenta?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "20",
                              "q": "Czy kontaktowałeś się z poprzednim biegłym rewidentem?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "21",
                              "q": "Czy klient zgłasza się pod koniec lub w II kwartale po roku badanym i oczekuje krótkiego terminu realizacji?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "22",
                              "q": "Czy klient wskazuje ograniczenia czasowe zakończenia badania z powodu publikacji wyników?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "23",
                              "q": "Jak długo poprzedni biegły rewident współpracował z klientem w zakresie badania?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "24",
                              "q": "Jak często klient dokonuje zmiany biegłego rewidenta?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "25",
                              "q": "Czy klient odmawia ujawnienia informacji finansowych lub danych niezbędnych do oszacowania pracochłonności badania?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "26",
                              "q": "Czy klient dąży do maksymalnego skrócenia czasu badania wywierając presję na termin zakończenia?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "27",
                              "q": "Czy znana jest reputacja podmiotów powiązanych z klientem?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "28",
                              "q": "Czy klient dąży do utrzymania honorarium na możliwie najniższym poziomie?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "29",
                              "q": "Czy klient stosuje agresywną interpretację standardów rachunkowości?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "30",
                              "q": "Czy istnieją przesłanki lub podejrzenia o działania sprzeczne z prawem?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "31",
                              "q": "Czy są oznaki mogące świadczyć o praniu brudnych pieniędzy lub innej działalności przestępczej?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "32",
                              "q": "Czy wobec klienta prowadzone jest dochodzenie?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "33",
                              "q": "Czy klient ma negatywny wizerunek lub jest powiązany z jednostkami o takim wizerunku?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "34",
                              "q": "Czy rozważyłeś rodzaj ewentualnych zastrzeżeń w opinii biegłego rewidenta z poprzedniego badania?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            }
                          ]
                        },
                        {
                          "type": "section",
                          "name": "Rozważenie czy FA i jej personel mogą przestrzegać odpowiednich wymogów etycznych",
                          "questions": [
                            {
                              "id": "35",
                              "q": "Czy FA i wszystkie osoby, od których jest to wymagane, spełniają wymóg niezależności wobec klienta?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "36",
                              "q": "Czy FA i wszystkie osoby, od których jest to wymagane, spełniają wymóg niezależności wizerunku wobec klienta?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "37",
                              "q": "Czy akceptacja zlecenia nie wywoła zagrożenia konfliktu interesów?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "38",
                              "q": "Czy wśród klientów FA są inne firmy z tej samej branży stanowiące dla siebie konkurencję?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "39",
                              "q": "Czy podjęcie współpracy wymaga powiadomienia innych klientów (konkurencyjnych) o zamiarze podjęcia współpracy?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "40",
                              "q": "Czy FA i jej personel przy realizacji zlecenia zdołają wystarczająco profesjonalnie postępować i prezentować odpowiedni poziom zawodowych kompetencji oraz obiektywizmu?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            }
                          ]
                        },
                        {
                          "type": "section",
                          "name": "Inne kwestie",
                          "questions": [
                            {
                              "id": "41",
                              "q": "Czy na poziom wynagrodzenia za badanie ma wpływ realizacja usług innych na rzecz badanego klienta?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "42",
                              "q": "Czy występują jakiekolwiek ustalenia co do wynagrodzenia warunkowego?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "43",
                              "q": "Czy badany klient zalega z wynagrodzeniami za inne usługi?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "44",
                              "q": "Czy pomiędzy firmą audytorską a badanym klientem toczy się spór lub czy istnieją przesłanki, że może do niego dojść?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "45",
                              "q": "Czy od klienta otrzymano jakiekolwiek znaczące upominki lub gesty gościnności albo czy klientowi przekazano jakiekolwiek znaczące upominki?",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            },
                            {
                              "id": "46",
                              "q": "Czy występują jakiekolwiek inne faktyczne lub domniemane konflikty interesów albo inne czynniki mogące zagrażać obiektywizmowi i niezależności? Jeśli tak, proszę je udokumentować wraz z zastosowanymi środkami zaradczymi.",
                              "answer": {
                                "value": null,
                                "comment": null
                              },
                              "author": null,
                              "approver": null,
                              "date": null,
                              "approvedAt": null
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "title:": "Zapotrzebowanie",
                  "type": "REQUEST"
                },
                {
                  "title:": "Pliki",
                  "type": "FILES"
                },
                {
                  "title:": "Dziennik zdarzeń",
                  "type": "ACTIVITY_LOG"
                }
              ]
            },
            {
              "id": 4,
              "title": "I.4 Rozpoznanie zagrożenia",
              "tabs": [
                {
                  "title:": "Kwestionariusz",
                  "type": "CUSTOM",
                  "columns": [
                    {
                      "type": "no",
                      "label": "Lp."
                    },
                    {
                      "type": "input",
                      "label": "Rozpoznane zagrożenie"
                    },
                    {
                      "type": "input",
                      "label": "Wdrożony środek zaradczy"
                    },
                    {
                      "type": "author",
                      "label": "Sporządził"
                    },
                    {
                      "type": "author",
                      "label": "Zatwierdź"
                    }
                  ],
                  "rows": []
                },
                {
                  "title:": "Zapotrzebowanie",
                  "type": "REQUEST"
                },
                {
                  "title:": "Pliki",
                  "type": "FILES"
                },
                {
                  "title:": "Dziennik zdarzeń",
                  "type": "ACTIVITY_LOG"
                }
              ]
            },
            {
              "id": 5,
              "title": "I.5 Wyznaczenie zespołu badającego",
              "tabs": [
                {
                  "title:": "Kwestionariusz",
                  "type": "Team",
                  "columns": [
                    { "type": "description", "title": "Rola" },
                    { "type": "input", "title": "Imię i nazwisko" },
                    { "type": "input", "title": "Numer identyfikacyjny" },
                    { "type": "description", "title": "Pytanie" },
                    { "type": "yes_no", "title": "Odpowiedź" },
                    { "type": "comment", "title": "Komentarz" },
                    { "type": "file", "title": "Załącznik" }
                  ],
                  "members": [
                    {
                      "role": "Kluczowy biegły rewident",
                      "imieNazwisko": "Jan Kowalski",
                      "idNumber": "12345",
                      "questions": [
                        {
                          "lp": 1,
                          "question": "Czy spełnia wymogi niezależności? (załącz test niezależności)",
                          "answer": null,
                          "comment": null,
                          "attachment": null
                        },
                        {
                          "lp": 2,
                          "question": "Czy ma prawo do wykonywania zawodu (czy jest zgłoszony jako biegły rewident wykonujący zawód)?",
                          "answer": null,
                          "comment": null,
                          "attachment": null
                        },
                        {
                          "lp": 3,
                          "question": "Czy toczy się przeciwko biegłemu postępowanie dyscyplinarne?",
                          "answer": null,
                          "comment": null,
                          "attachment": null
                        },
                        {
                          "lp": 4,
                          "question": "Czy został skazany przez Sąd Dyscyplinarny – określ rodzaj kary",
                          "answer": null,
                          "comment": null,
                          "attachment": null
                        },
                        {
                          "lp": 5,
                          "question": "Czy posiada odpowiednie doświadczenie zawodowe w specyfice działalności klienta badania?",
                          "answer": null,
                          "comment": null,
                          "attachment": null
                        },
                        {
                          "lp": 6,
                          "question": "Czy będzie w stanie nadzorować zespół audytorski w składzie jak poniżej?",
                          "answer": null,
                          "comment": null,
                          "attachment": null
                        },
                        {
                          "lp": 7,
                          "question": "Czy dysponuje odpowiednią ilością czasu?",
                          "answer": null,
                          "comment": null,
                          "attachment": null
                        },
                        {
                          "lp": 8,
                          "question": "Czy będzie zdolny do przestrzegania wszystkich zasad etyki zawodowej?",
                          "answer": null,
                          "comment": null,
                          "attachment": null
                        }
                      ]
                    },
                    {
                      "role": "Asystent",
                      "imieNazwisko": null,
                      "questions": [
                        {
                          "lp": 1,
                          "question": "Czy spełnia wymogi niezależności? (załącz test niezależności)",
                          "answer": null,
                          "comment": null,
                          "attachment": null
                        },
                        {
                          "lp": 2,
                          "question": "Czy posiada odpowiednie doświadczenie zawodowe w specyfice działalności klienta badania?",
                          "answer": null,
                          "comment": null,
                          "attachment": null
                        },
                        {
                          "lp": 3,
                          "question": "Czy dysponuje odpowiednią ilością czasu?",
                          "answer": null,
                          "comment": null,
                          "attachment": null
                        },
                        {
                          "lp": 4,
                          "question": "Czy będzie zdolny do przestrzegania wszystkich zasad etyki zawodowej?",
                          "answer": null,
                          "comment": null,
                          "attachment": null
                        }
                      ]
                    }
                          ]
                },
                {
                  "title:": "Zapotrzebowanie",
                  "type": "REQUEST"
                },
                {
                  "title:": "Pliki",
                  "type": "FILES"
                },
                {
                  "title:": "Dziennik zdarzeń",
                  "type": "ACTIVITY_LOG"
                },
                {
                  "title:": "Wniosek",
                  "type": "APPLICATION"
                }
              ]
            }
          ]
        },
        {
          "label": "II. Ryzyko",
          "sections": [
            {
              "name": "II.1 Wstępne zagadnienia",
              "screens": [
                {
                  "id": 1,
                  "title": "II.1.1 Plan badania",
                  "tabs": []
                },
                {
                  "id": 2,
                  "title": "II.1.2 Poznanie jednostki i otoczenia",
                  "tabs": []
                },
                {
                  "id": 3,
                  "title": "II.1.3 Wstępny przegląd analityczny",
                  "tabs": []
                },
                {
                  "id": 4,
                  "title": "II.1.4 Kontynuacja działalności",
                  "tabs": []
                },
                {
                  "id": 5,
                  "title": "II.1.5 Ustalenie poziomów istotności",
                  "tabs": []
                },
                {
                  "id": 6,
                  "title": "II.1.6 Bilans otwarcia / dane porównawcze",
                  "tabs": []
                },
                {
                  "id": 7,
                  "title": "II.1.7 Odpowiedzialność dotycząca oszustw - lista kontrolna",
                  "tabs": []
                },
                {
                  "id": 8,
                  "title": "II.1.8 Spotkania na etapie planowania",
                  "tabs": []
                },
                {
                  "id": 9,
                  "title": "II.1.9 Memorandum planowania badania",
                  "tabs": []
                },
                {
                  "id": 10,
                  "title": "II.1.10 Przykładowa lista kontrolna dotycząca zbioru stałego",
                  "tabs": []
                }
              ]
            },
            {
              "name": "II.2 Podejście do ryzyka nieodłącznego",
              "screens": [
                {
                  "id": 1,
                  "title": "II.2.1 Identyfikacja i ocena ryzyka na poziomie sprawozdania finansowego",
                  "tabs": []
                },
                {
                  "id": 2,
                  "title": "II.2.2 Identyfikacja i ocena ryzyka na poziomie stwierdzeń",
                  "tabs": []
                },
                {
                  "id": 3,
                  "title": "II.2.3 Identyfikacja i ocena ryzyka rozległego",
                  "tabs": []
                }
              ]
            },
            {
              "name": "II.3 Ogólne podejście do kontroli wewnętrznej",
              "screens": [
                {
                  "id": 1,
                  "title": "II.3.1 Program badania",
                  "tabs": []
                },
                {
                  "id": 2,
                  "title": "II.3.2 Dokumentacja zrozumienia kontroli wewnętrznej jednostki",
                  "tabs": []
                },
                {
                  "id": 3,
                  "title": "II.3.3 Opis kluczowych procesów i działań kontrolnych",
                  "tabs": []
                },
                {
                  "id": 4,
                  "title": "II.3.4 Przegląd kontroli wewnętrznej",
                  "tabs": []
                },
                {
                  "id": 5,
                  "title": "II.3.5 Testy kontroli wewnętrznej",
                  "tabs": []
                },
                {
                  "id": 6,
                  "title": "II.3.6 Ocena kontroli wewnętrznej",
                  "tabs": []
                }
              ]
            },
            {
              "name": "II.4 Macierz ryzyk",
              "screens": [
                {
                  "id": 1,
                  "title": "II.4 Macierz ryzyk",
                  "tabs": []
                }
              ]
            }
          ]
        },
        {
          "label": "III. Badanie",
          "screens": [
            {
              "id": 1,
              "title": "III.1 Tabela testu rewizyjnego",
              "tabs": [
                {
                  "title:": "Kwestionariusz",
                  "type": "CUSTOM",
                  "columns": [
                    { "type": "no", "label": "Lp." },
                    { "type": "description", "label": "Pytanie" },
                    { "type": "comment", "label": "Odpowiedź" },
                    { "type": "file", "label": "Załącznik" },
                    { "type": "author", "label": "Sporządził" },
                    { "type": "author", "label": "Zatwierdził" }
                  ],
                  "rows": [
                    { "lp": 1, "question": "Nr dok.", "answer": null, "attachment": null, "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null },
                    { "lp": 2, "question": "Test:", "answer": null, "attachment": null, "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null},
                    { "lp": 3, "question": "Cel:", "answer": null, "attachment": null,"author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null },
                    { "lp": 4, "question": "Wykorzystane dokumenty źródłowe:", "answer": null, "attachment": null,"author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null },
                    { "lp": 5, "question": "Poziom ryzyka dla tego obszaru:", "answer": null, "attachment": null,
                      "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null},
                    { "lp": 6, "question": "Stwierdzenia do przetestowania:", "answer": null, "attachment": null, "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null },
                    { "lp": 7, "question": "Wielkość próby i zasady jej wyboru:", "answer": null, "attachment": null,"author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null },
                    { "lp": 8, "question": "Objaśnienie wykonanych czynności z odpowiednimi odniesieniami do informacji o próbie:", "answer": null, "attachment": null,"author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null },
                    { "lp": 9, "question": "Sprawy rozważane:", "answer": null, "attachment": null, "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null },
                    { "lp": 10, "question": "Wnioski:", "answer": null, "attachment": null, "author": null,
                      "approver": null,
                      "date": null,
                      "approvedAt": null }
                  ]
                },

                {
                  "title:": "Zapotrzebowanie",
                  "type": "REQUEST"
                },
                {
                  "title:": "Pliki",
                  "type": "FILES"
                },
                {
                  "title:": "Dziennik zdarzeń",
                  "type": "ACTIVITY_LOG"
                }
              ]
            },
            {
              "id": 2,
              "title": "III.2 Wartości niematerialne i prawne",
              "tabs": [
                {
                  "title:": "Salda kont",
                  "type": "CUSTOM",
                  "columns": [
                    { "key": "nazwa", "type": "comment", "label": "Pytanie" },
                    { "key": "I", "type": "dynamic", "label": "I" },
                    { "key": "PiO", "type": "dynamic", "label": "PiO" },
                    { "key": "Ko", "type": "dynamic", "label": "Ko" },
                    { "key": "WiP", "type": "dynamic", "label": "WiP" },
                    { "key": "komentarz", "type": "comment", "label": "Komentarz" },
                    { "key": "sporzadzil", "type": "author", "label": "Sporządził" },
                    { "key": "data", "type": "date", "label": "Data" },
                    { "key": "plik", "type": "file", "label": "Załącznik" }
                  ],
                  "rows": [
                    {
                      "id": 1,
                      "nazwa": "Oszacowane ryzyko nieodłączne (RN) na poziomie stwierdzeń",
                      "I": { "value": "Średnie", "type": "select" },
                      "PiO": { "value": "Średnie", "type": "select" },
                      "Ko": { "value": "Średnie", "type": "select" },
                      "WiP": { "value": "Średnie", "type": "select" },
                      "komentarz": "",
                      "sporzadzil": null,
                      "data": null,
                      "plik": null
                    },
                    {
                      "id": 2,
                      "nazwa": "Oszacowane ryzyko kontroli (RK) na poziomie stwierdzeń",
                      "I": { "value": "Średnie", "type": "select" },
                      "PiO": { "value": "Średnie", "type": "select" },
                      "Ko": { "value": "Średnie", "type": "select" },
                      "WiP": { "value": "Średnie", "type": "select" },
                      "komentarz": "",
                      "sporzadzil": null,
                      "data": null,
                      "plik": null
                    },
                    {
                      "id": 3,
                      "nazwa": "Oszacowane ryzyko istotnego zniekształcenia na poziomie stwierdzeń",
                      "I": { "value": "Średnie", "type": "select" },
                      "PiO": { "value": "Średnie", "type": "select" },
                      "Ko": { "value": "Średnie", "type": "select" },
                      "WiP": { "value": "Średnie", "type": "select" },
                      "komentarz": "",
                      "sporzadzil": null,
                      "data": null,
                      "plik": null
                    },
                    {
                      "id": 4,
                      "nazwa": "Podsumowanie proponowanej reakcji na ryzyko – wybór kategorii procedur badania",
                      "I": { "value": "Średnie", "type": "select" },
                      "PiO": { "value": "Średnie", "type": "select" },
                      "Ko": { "value": "Średnie", "type": "select" },
                      "WiP": { "value": "Średnie", "type": "select" },
                      "komentarz": "",
                      "sporzadzil": null,
                      "data": null,
                      "plik": null
                    },
                    {
                      "id": 5,
                      "nazwa": "I. Szczegółowe procedury wiarygodności – podstawowe",
                      "I": { "value": false, "type": "checkbox" },
                      "PiO": { "value": false, "type": "checkbox" },
                      "Ko": { "value": false, "type": "checkbox" },
                      "WiP": { "value": false, "type": "checkbox" },
                      "komentarz": "",
                      "sporzadzil": null,
                      "data": null,
                      "plik": null
                    },
                    {
                      "id": 6,
                      "nazwa": "II. Szczegółowe procedury wiarygodności – dostosowane do konkretnych czynników ryzyka",
                      "I": { "value": false, "type": "checkbox" },
                      "PiO": { "value": false, "type": "checkbox" },
                      "Ko": { "value": false, "type": "checkbox" },
                      "WiP": { "value": false, "type": "checkbox" },
                      "komentarz": "",
                      "sporzadzil": null,
                      "data": null,
                      "plik": null
                    },
                    {
                      "id": 7,
                      "nazwa": "III. Analityczne procedury wiarygodności",
                      "I": { "value": false, "type": "checkbox" },
                      "PiO": { "value": false, "type": "checkbox" },
                      "Ko": { "value": false, "type": "checkbox" },
                      "WiP": { "value": false, "type": "checkbox" },
                      "komentarz": "",
                      "sporzadzil": null,
                      "data": null,
                      "plik": null
                    },
                    {
                      "id": 8,
                      "nazwa": "IV. Testy kontroli (skuteczność działania kontroli wewnętrznej)",
                      "I": { "value": false, "type": "checkbox" },
                      "PiO": { "value": false, "type": "checkbox" },
                      "Ko": { "value": false, "type": "checkbox" },
                      "WiP": { "value": false, "type": "checkbox" },
                      "komentarz": "",
                      "sporzadzil": null,
                      "data": null,
                      "plik": null
                    }
                  ]
                },
                {
                  "title:": "Prezentacja i ujawnienia",
                  "type": "CUSTOM",
                  "columns": [
                    { "type": "comment", "label": "Pytanie" },
                    { "type": "dynamic", "label": "WoPiO" },
                    { "type": "dynamic", "label": "Ko" },
                    { "type": "dynamic", "label": "KiZ" },
                    { "type": "dynamic", "label": "DiW" },
                    {  "type": "comment", "label": "Komentarz" },
                    {  "type": "author", "label": "Sporządził" },
                    { "type": "date", "label": "Data" },
                    { "type": "file", "label": "Załącznik" }
                  ],
                  "rows": [
                    {
                      "id": 1,
                      "nazwa": "Oszacowane ryzyko nieodłączne (RN) na poziomie stwierdzeń",
                      "WoPiO": { "value": "Średnie", "type": "select" },
                      "Ko": { "value": "Średnie", "type": "select" },
                      "KiZ": { "value": "Średnie", "type": "select" },
                      "DiW": { "value": "Średnie", "type": "select" },
                      "komentarz": "",
                      "sporzadzil": null,
                      "data": null,
                      "plik": null
                    },
                    {
                      "id": 2,
                      "nazwa": "Oszacowane ryzyko kontroli (RK) na poziomie stwierdzeń",
                      "WoPiO": { "value": "Średnie", "type": "select" },
                      "Ko": { "value": "Średnie", "type": "select" },
                      "KiZ": { "value": "Średnie", "type": "select" },
                      "DiW": { "value": "Średnie", "type": "select" },
                      "komentarz": "",
                      "sporzadzil": null,
                      "data": null,
                      "plik": null
                    },
                    {
                      "id": 3,
                      "nazwa": "Oszacowane ryzyko istotnego zniekształcenia na poziomie stwierdzeń",
                      "WoPiO": { "value": "Średnie", "type": "select" },
                      "Ko": { "value": "Średnie", "type": "select" },
                      "KiZ": { "value": "Średnie", "type": "select" },
                      "DiW": { "value": "Średnie", "type": "select" },
                      "komentarz": "",
                      "sporzadzil": null,
                      "data": null,
                      "plik": null
                    },
                    {
                      "id": 4,
                      "nazwa": "Podsumowanie proponowanej reakcji na ryzyko – wybór kategorii procedur badania",
                      "WoPiO": { "value": "Średnie", "type": "select" },
                      "Ko": { "value": "Średnie", "type": "select" },
                      "KiZ": { "value": "Średnie", "type": "select" },
                      "DiW": { "value": "Średnie", "type": "select" },
                      "komentarz": "",
                      "sporzadzil": null,
                      "data": null,
                      "plik": null
                    },
                    {
                      "id": 5,
                      "nazwa": "I. Szczegółowe procedury wiarygodności – podstawowe",
                      "WoPiO": { "value": false, "type": "checkbox" },
                      "Ko": { "value": false, "type": "checkbox" },
                      "KiZ": { "value": false, "type": "checkbox" },
                      "DiW": { "value": false, "type": "checkbox" },
                      "komentarz": "",
                      "sporzadzil": null,
                      "data": null,
                      "plik": null
                    },
                    {
                      "id": 6,
                      "nazwa": "II. Szczegółowe procedury wiarygodności – dostosowane do konkretnych czynników ryzyka",
                      "WoPiO": { "value": false, "type": "checkbox" },
                      "Ko": { "value": false, "type": "checkbox" },
                      "KiZ": { "value": false, "type": "checkbox" },
                      "DiW": { "value": false, "type": "checkbox" },
                      "komentarz": "",
                      "sporzadzil": null,
                      "data": null,
                      "plik": null
                    },
                    {
                      "id": 7,
                      "nazwa": "III. Analityczne procedury wiarygodności",
                      "WoPiO": { "value": false, "type": "checkbox" },
                      "Ko": { "value": false, "type": "checkbox" },
                      "KiZ": { "value": false, "type": "checkbox" },
                      "DiW": { "value": false, "type": "checkbox" },
                      "komentarz": "",
                      "sporzadzil": null,
                      "data": null,
                      "plik": null
                    },
                    {
                      "id": 8,
                      "nazwa": "IV. Testy kontroli (skuteczność działania kontroli wewnętrznej)",
                      "WoPiO": { "value": false, "type": "checkbox" },
                      "Ko": { "value": false, "type": "checkbox" },
                      "KiZ": { "value": false, "type": "checkbox" },
                      "DiW": { "value": false, "type": "checkbox" },
                      "komentarz": "",
                      "sporzadzil": null,
                      "data": null,
                      "plik": null
                    }
                  ]
                },
                {
                  "title:": "Cele badania",
                  "type": "CUSTOM",
                  "columns": [
                    { "type": "no", "label": "Lp." },
                    { "type": "description", "label": "Badane stwierdzenie" },
                    { "type": "description", "label": "Powiązane obszary" }
                  ],
                  "rows": [
                    {
                      "lp": 1,
                      "stwierdzenie": "Przy przeprowadzaniu badania sprawozdania finansowego twoim celem jest uzyskanie wystarczającej pewności, czy sprawozdanie finansowe jako całość nie zawiera istotnego zniekształcenia, niezależnie od tego, czy zostało ono spowodowane błędem lub oszustwem, co umożliwi ci wyrażenie opinii o tym, czy sprawozdanie finansowe jest, we wszystkich istotnych aspektach, sporządzone zgodnie z mającymi zastosowanie ramowymi założeniami sprawozdawczości finansowej. W związku z tym powinieneś zrealizować poniższe cele, które pozwolą ci osiągnąć określony powyżej cel ogólny. Pamiętaj, że twoim celem jest uzyskanie wystarczających i odpowiednich dowodów badania ocenionego ryzyka istotnego zniekształcenia dzięki zaprojektowaniu i zastosowaniu odpowiednich do tego ryzyka reakcji. Upewnij się, że wartości niematerialne i prawne są prawidłowo wykazane w sprawozdaniu finansowym zgodnie z odpowiednimi przepisami prawa i przyjętymi zasadami (polityką) rachunkowości.",
                      "obszary": ["I", "PiO", "Ko", "WiP"]
                    },
                    {
                      "lp": 2,
                      "stwierdzenie": "Upewnij się, że ujęte w sprawozdaniu finansowym wartości niematerialne i prawne istnieją i klient ma do nich ważny tytuł prawny.",
                      "obszary": ["I", "PiO"]
                    },
                    {
                      "lp": 3,
                      "stwierdzenie": "Upewnij się, że wycena wartości niematerialnych i prawnych jest zgodna z zasadami (polityką) rachunkowości klienta i zasady te stosowane są w sposób ciągły.",
                      "obszary": ["WiP"]
                    },
                    {
                      "lp": 4,
                      "stwierdzenie": "Upewnij się, że zwiększenie stanu wartości niematerialnych i prawnych jest zasadne, a ich zbycie zostało prawidłowo zarejestrowane.",
                      "obszary": ["Ko"]
                    },
                    {
                      "lp": 5,
                      "stwierdzenie": "Upewnij się, że wobec wartości niematerialnych i prawnych, podlegających amortyzacji, zastosowano prawidłowe stawki amortyzacji, w sposób: (a) zasadny i właściwy; (b) zgodny z podejściem zastosowanym w poprzednim roku.",
                      "obszary": ["WiP"]
                    },
                    {
                      "lp": 6,
                      "stwierdzenie": "Upewnij się, że utworzono odpis aktualizujący z tytułu utraty wartości.",
                      "obszary": ["WiP"]
                    },
                    {
                      "lp": 7,
                      "stwierdzenie": "Upewnij się, że w sprawozdaniu finansowym: - obszar został poprawnie zaprezentowany, - poprawnie ujawniono zastosowane zasady wyceny, - poprawnie i kompletnie przedstawiono wymagane przepisami i standardami rachunkowości ujawnienia związane z tym obszarem.",
                      "obszary": ["WoPiO", "Ko", "KiZ", "DiW"]
                    }
                  ]
                },
                {
                  "title:": "Program badania",
                  "type": "CUSTOM"
                },
                {
                  "title:": "Zapotrzebowanie",
                  "type": "REQUEST"
                },
                {
                  "title:": "Pliki",
                  "type": "FILES"
                },
                {
                  "title:": "Dziennik zdarzeń",
                  "type": "ACTIVITY_LOG"
                }
              ]
            },

            {
              "id": 3,
              "title": "III.3 Rzeczowe aktywa stałe",
              "tabs": []
            },
            {
              "id": 4,
              "title": "III.4 Inwestycje",
              "tabs": []
            },
            {
              "id": 5,
              "title": "III.5 Zapasy",
              "tabs": []
            },
            {
              "id": 6,
              "title": "III.6 Należności",
              "tabs": []
            },
            {
              "id": 7,
              "title": "III.7 Rozliczenia międzyokresowe",
              "tabs": []
            },
            {
              "id": 8,
              "title": "III.8 Środki pieniężne",
              "tabs": []
            },
            {
              "id": 9,
              "title": "III.9 Kapitały (fundusze) własne",
              "tabs": []
            },
            {
              "id": 10,
              "title": "III.10 Rezerwy na zobowiązania warunkowe i zabezpieczenia",
              "tabs": []
            },
            {
              "id": 11,
              "title": "III.11 Zobowiązania, fundusze specjalne i rozliczenia międzyokresowe (pasywa)",
              "tabs": []
            },
            {
              "id": 12,
              "title": "III.12 Przychody",
              "tabs": []
            },
            {
              "id": 13,
              "title": "III.13 Koszty",
              "tabs": []
            },
            {
              "id": 14,
              "title": "III.14 Podatek dochodowy",
              "tabs": []
            },
            {
              "id": 15,
              "title": "III.15 Rachunek przepływów pieniężnych",
              "tabs": []
            }
          ]
        },

        {
          "label": "IV. Procedury",
          "screens": [
            {
              "id": 1,
              "title": "IV.1 Zestawienie obrotów i sald",
              "tabs": []
            },
            {
              "id": 2,
              "title": "IV.2 Podmioty powiązane",
              "tabs": []
            },
            {
              "id": 3,
              "title": "IV.3 Przestrzeganie prawa i regulacji",
              "tabs": []
            },
            {
              "id": 4,
              "title": "IV.4 Późniejsze zdarzenia",
              "tabs": []
            },
            {
              "id": 5,
              "title": "IV.5 Kontynuacja działalności",
              "tabs": []
            },
            {
              "id": 6,
              "title": "IV.6 Sprawozdanie finansowe",
              "tabs": []
            },
            {
              "id": 7,
              "title": "IV.7 Sprawozdanie z działalności,",
              "tabs": []
            }
          ]
        },
        {
          "label": "V. Podsumowanie",
          "screens": [
            {
              "id": 1,
              "title": "V.1 Zagadnienia wymagające konsultacji",
              "tabs": []
            },
            {
              "id": 2,
              "title": "V.2 Końcowy przegląd analityczny - program badania",
              "tabs": []
            },
            {
              "id": 3,
              "title": "V.3 Zbiorcze zestawienie zniekształceń",
              "tabs": []
            },
            {
              "id": 4,
              "title": "V.4 Oświadczenia końcowe",
              "tabs": []
            },
            {
              "id": 5,
              "title": "V.5 Sprawozdanie biegłego rewidenta - kwestie do rozważenia",
              "tabs": []
            },
            {
              "id": 6,
              "title": "V.6 Komunikacja z osobami sprawującymi nadzór",
              "tabs": []
            },
            {
              "id": 7,
              "title": "V.7 Zakończenie badania zasadniczego i podsumowanie wyników badania",
              "tabs": []
            },
            {
              "id": 8,
              "title": "V.8 Kontrola jakości wykonania zlecenia",
              "tabs": []
            },
            {
              "id": 8,
              "title": "V.9 Lista spraw do rozważenia na przyszłość",
              "tabs": []
            }
          ]
        }
      ]
    },

        {
          "id": 2,
          "name": "DR/2025/123454",
          "status": "completed",
          "progress": 100,
          "deadline": "2025-06-15",
          "klient": "Gamma Demo Logistics",
          "users": [
            "Katarzyna Wiśniewska"
          ],
          "contact": {
            "name": "Maria Wiśniewska",
            "email": "maria.wisniewska@gammalogistics.com",
            "phone": "12 234 56 78"
          }
        },
        {
          "id": 3,
          "name": "MBP/2025/000111",
          "status": "active",
          "progress": 45,
          "deadline": "2024-12-20",
          "klient": "BetaConsulting S.A.",
          "users": [
            "Piotr Zieliński",
            "Magdalena Lewandowska"
          ],
          "contact": {
            "name": "Piotr Zieliński",
            "email": "piotr.zielinski@betaconsulting.com",
            "phone": "33 345 67 89"
          }
        },
        {
          "id": 4,
          "name": "DR/2025/123444",
          "status": "delayed",
          "progress": 20,
          "deadline": "2025-03-15",
          "klient": "Upsilon Design",
          "users": [
            "Tomasz Kamiński"
          ],
          "contact": {
            "name": "Tomasz Kamiński",
            "email": "tomasz.kaminski@upsilondesign.com",
            "phone": "44 456 78 90"
          }
        },
        {
          "id": 5,
          "name": "DR/2025/123457",
          "status": "active",
          "progress": 55,
          "deadline": "2025-08-10",
          "klient": "Delta Solutions",
          "users": [
            "Agnieszka Dąbrowska",
            "Marek Wojciechowski"
          ],
          "contact": {
            "name": "Agnieszka Dąbrowska",
            "email": "a.dabrowska@deltasolutions.com",
            "phone": "55 567 89 01"
          }
        },
        {
          "id": 6,
          "name": "DR/2025/123458",
          "status": "completed",
          "progress": 100,
          "deadline": "2025-05-20",
          "klient": "Epsilon Sp. z o.o.",
          "users": [
            "Joanna Kaczmarek"
          ],
          "contact": {
            "name": "Joanna Kaczmarek",
            "email": "joanna.kaczmarek@epsilon.com",
            "phone": "66 678 90 12"
          }
        },
        {
          "id": 7,
          "name": "DR/2025/123459",
          "status": "delayed",
          "progress": 10,
          "deadline": "2025-02-28",
          "klient": "Zeta Systems",
          "users": [
            "Paweł Grabowski",
            "Magdalena Lewandowska"
          ],
          "contact": {
            "name": "Paweł Grabowski",
            "email": "pawel.grabowski@zetasystems.com",
            "phone": "77 789 01 23"
          }
        },
        {
          "id": 8,
          "name": "MBP/2025/000112",
          "status": "active",
          "progress": 75,
          "deadline": "2025-10-10",
          "klient": "Theta Corp.",
          "users": [
            "Tomasz Kamiński",
            "Anna Kowalska"
          ],
          "contact": {
            "name": "Tomasz Kamiński",
            "email": "t.kaminski@thetacorp.com",
            "phone": "88 890 12 34"
          }
        },
        {
          "id": 9,
          "name": "DR/2025/123460",
          "status": "active",
          "progress": 50,
          "deadline": "2025-07-25",
          "klient": "Iota Group",
          "users": [
            "Jan Nowak"
          ],
          "contact": {
            "name": "Jan Nowak",
            "email": "jan.nowak@iotagroup.com",
            "phone": "99 901 23 45"
          }
        },
        {
          "id": 10,
          "name": "DR/2025/123461",
          "status": "completed",
          "progress": 100,
          "deadline": "2025-06-30",
          "klient": "Kappa Enterprises",
          "users": [
            "Katarzyna Wiśniewska",
            "Piotr Zieliński"
          ],
          "contact": {
            "name": "Katarzyna Wiśniewska",
            "email": "k.wisniewska@kappa.com",
            "phone": "11 112 34 56"
          }
        },
        {
          "id": 11,
          "name": "DR/2025/123462",
          "status": "delayed",
          "progress": 30,
          "deadline": "2025-04-15",
          "klient": "Lambda Innovations",
          "users": [
            "Agnieszka Dąbrowska"
          ],
          "contact": {
            "name": "Agnieszka Dąbrowska",
            "email": "a.dabrowska@lambdainnovations.com",
            "phone": "22 223 45 67"
          }
        },
        {
          "id": 12,
          "name": "DR/2025/123463",
          "status": "active",
          "progress": 65,
          "deadline": "2025-09-01",
          "klient": "Mu Tech",
          "users": [
            "Marek Wojciechowski"
          ],
          "contact": {
            "name": "Marek Wojciechowski",
            "email": "marek.wojciechowski@mutech.com",
            "phone": "33 334 56 78"
          }
        },
        {
          "id": 13,
          "name": "DR/2025/123464",
          "status": "active",
          "progress": 80,
          "deadline": "2025-10-20",
          "klient": "Nu Industries",
          "users": [
            "Joanna Kaczmarek",
            "Paweł Grabowski"
          ],
          "contact": {
            "name": "Joanna Kaczmarek",
            "email": "joanna.k@nuindustries.com",
            "phone": "44 445 67 89"
          }
        },
        {
          "id": 14,
          "name": "MBP/2025/000113",
          "status": "delayed",
          "progress": 25,
          "deadline": "2025-03-30",
          "klient": "Xi Solutions",
          "users": [
            "Tomasz Kamiński"
          ],
          "contact": {
            "name": "Tomasz Kamiński",
            "email": "t.kaminski@xisolutions.com",
            "phone": "55 556 78 90"
          }
        },
        {
          "id": 15,
          "name": "DR/2025/123465",
          "status": "completed",
          "progress": 100,
          "deadline": "2025-07-10",
          "klient": "Omicron Corp.",
          "users": [
            "Anna Kowalska",
            "Jan Nowak"
          ],
          "contact": {
            "name": "Anna Kowalska",
            "email": "anna.kowalska@omicron.com",
            "phone": "66 667 89 01"
          }
        }
      ]
    }
