{
  "msb": [
    { "ref": "200(6)", "desc": "Biegły rewident stosuje koncepcję istotności zarówno podczas planowania i przeprowadzania\nbadania, jak również podczas oceny wpływu na badanie zidentyfikowanych oraz\nnieskorygowanych zniekształceń, o ile występują, na sprawozdanie finansowe1\n. Zasadniczo\nzniekształcenia, w tym pominięcia, są uznawane za istotne, jeśli można racjonalnie oczekiwać,\nże pojedynczo lub łącznie wpłyną na decyzje gospodarcze podejmowane przez użytkowników na\npodstawie sprawozdania finansowego. Osądy dotyczące istotności dokonywane są w świetle\nistniejących okoliczności i wpływa na nie sposób postrzegania przez biegłego rewidenta potrzeb\ninformacyjnych użytkowników sprawozdania finansowego oraz wielkość lub rodzaj\nzniekształcenia bądź połączenie tych dwóch czynników. Opinia biegłego rewidenta dotyczy\nsprawozdania finansowego jako całości i dlatego biegły rewident nie odpowiada za wykrycie\nzniekształceń, które nie są istotne dla sprawozdania finansowego jako całości." },
    { "ref": "200(15)", "desc": "Biegły rewident planuje i przeprowadza badanie, zachowując zawodowy sceptycyzm, uznając,\nże mogą istnieć okoliczności powodujące istotne zniekształcenie sprawozdania finansowego." },

    { "ref": "210(6)", "desc": "W celu ustalenia, czy występują wstępne warunki badania, biegły rewident:\n(a) ustala*\n, czy ramowe założenia sprawozdawczości finansowej, które mają być zastosowane\nprzy sporządzaniu sprawozdania finansowego są akceptowalne, (zob. par. A2-A10) oraz\n(b) uzyskuje od kierownika jednostki zapewnienie, że potwierdza on i rozumie swoją odpowiedzialność: (zob. par. A11-A14, A21)\n(i) za sporządzenie sprawozdania finansowego zgodnie z mającymi zastosowanie\nramowymi założeniami sprawozdawczości finansowej, w tym gdzie to stosowne, za\nich rzetelną prezentację, (zob. par. A15)\n(ii) za taką kontrolę wewnętrzną, którą kierownik jednostki uznaje za nieodzowną dla\numożliwienia sporządzenia sprawozdania finansowego nie zawierającego istotnego\nzniekształcenia spowodowanego błędem lub oszustwem oraz (zob. par. A16-A19)\n(iii) zapewnienie biegłemu rewidentowi:\na. dostępu do wszystkich informacji, takich jak zapisy księgowe, dokumentacja\noraz inne sprawy, co do których kierownik jednostki jest świadomy, że mają\nznaczenie dla sporządzania sprawozdania finansowego,\nb. dodatkowych informacji, o które biegły rewident może na potrzeby badania\npoprosić kierownika jednostki oraz\nc. nieograniczonego kontaktu z osobami wewnątrz jednostki, od których\nuzyskanie dowodów badania jest, zdaniem biegłego rewidenta, konieczne.\n" },
    { "ref": "210(7)", "desc": "Ograniczenie zakresu badania przed akceptacją zlecenia badania\n7. Jeśli kierownik jednostki lub osoby sprawujące nadzór w ramach warunków proponowanego\nzlecenia badania nakładają ograniczenie na zakres badania w sposób, który zdaniem biegłego\nrewidenta, doprowadzi do odstąpienia przez biegłego rewidenta od wyrażenia opinii\no sprawozdaniu finansowym, biegły rewident nie akceptuje tak ograniczonego zlecenia jako\nzlecenia badania, chyba że tego wymagają od niego przepisy prawa lub regulacja." },
    { "ref": "210(9)", "desc": "Biegły rewident uzgadnia warunki zlecenia badania z kierownikiem jednostki lub osobami\nsprawującymi nadzór" },
    { "ref": "210(10)", "desc": "O ile nie ma zastosowania paragraf 11, uzgodnione warunki zlecenia badania zapisuje się\nw formie umowy zlecenia badania lub innej właściwej formie pisemnego porozumienia\ni obejmują one: (zob. par. A23-A27)\n(a) cel i zakres badania sprawozdania finansowego,\n(b) odpowiedzialności biegłego rewidenta,\n(c) odpowiedzialności kierownika jednostki,\n(d) wskazanie mających zastosowanie ramowych założeń sprawozdawczości finansowej\nstosowanych przy sporządzaniu sprawozdania finansowego oraz\nUZGADNIANIE WARUNKÓW ZLECEŃ BADANIA\nMSB 210 5\n(e) informację o oczekiwanej formie i treści wszelkich sprawozdań, które będą wydane przez\nbiegłego rewidenta oraz (zob. par. A24)\n(f) oświadczenie, że mogą wystąpić okoliczności sprawiające, że sprawozdanie będzie się\nróżnić od oczekiwanej formy i treści." },
    { "ref": "210(14)", "desc": "Biegły rewident nie zgadza się na zmianę warunków zlecenia badania, jeżeli nie ma racjonalnego\nuzasadnienia, żeby dokonać tej zmiany. (Zob. par. A31-A33)" },
    { "ref": "210(15)", "desc": "Jeśli przed zakończeniem zlecenia badania biegły rewident jest proszony o zmianę zlecenia\nbadania na zlecenie, które dostarcza niższego poziomu pewności, ustala, czy istnieje racjonalne\nuzasadnienie dla takiego działania. (Zob. par. A34-A35)" },
    { "ref": "210(16)", "desc": "Jeśli warunki zlecenia badania zostały zmienione, biegły rewident oraz kierownik jednostki\npotwierdzają i zamieszczają nowe warunki zlecenia w umowie zlecenia lub w innym\nodpowiednim pisemnym porozumieniu." },
    { "ref": "210(17)", "desc": "Jeśli biegły rewident nie jest w stanie zgodzić się na zmianę warunków zlecenia badania,\na kierownik jednostki nie zezwala mu na dokończenie pierwotnego zlecenia badania, wówczas\nbiegły rewident:\n(a) wycofuje się ze zlecenia badania, jeżeli jest to możliwe zgodnie z obowiązującymi\nprzepisami prawa lub regulacji oraz\n(b) rozważa, czy ciążą na nim umowne lub innego rodzaju zobowiązania do powiadomienia\no zaistniałych okolicznościach innych stron, takich jak osób sprawujących nadzór,\nwłaścicieli lub regulatorów." },
    { "ref": "210(A23)", "desc": "Umowa zlecenia badania lub inna forma pisemnego porozumienia16 (Zob. par. 10-11)\nA23. Wysłanie przez biegłego rewidenta umowy zlecenia badania przed jego rozpoczęciem leży\nzarówno w interesie jednostki, jak i biegłego rewidenta, gdyż pozwala uniknąć nieporozumień\nzwiązanych z badaniem. Jednakże, w niektórych krajach prawo określa cel i zakres badania oraz\nodpowiedzialności kierownika jednostki i biegłego rewidenta w wystarczający sposób, tj.\nreguluje sprawy opisane w paragrafie 10. Chociaż w takich przypadkach paragraf 11 zezwala\nbiegłemu rewidentowi na zmieszczenie w umowie zlecenia tylko wzmianki o tym, że mają\nzastosowanie odpowiednie przepisy prawa lub regulacja oraz, że kierownik jednostki potwierdza\ni rozumie swoją odpowiedzialność zgodnie z zapisami paragrafu 6(b), tym niemniej biegły\nrewident może uznać za odpowiednie, w celu poinformowania kierownika jednostki,\nzamieszczenie w umowie zlecenia badania spraw opisanych w paragrafie 10." },

    { "ref": "220(8)", "desc": "Wymogi niniejszego MSB (PL) są przeznaczone do stosowania w kontekście rodzaju i okoliczności\nkażdego badania. Na przykład:\n(a) gdy badanie przeprowadzane jest w całości przez partnera odpowiedzialnego za zlecenie\nkluczowego biegłego rewidenta, co może mieć miejsce w przypadku badania mniej złożonej\njednostki, niektóre wymogi w niniejszym MSB (PL) nie są stosowne, ponieważ są\nwarunkowane zaangażowaniem innych członków zespołu wykonującego zlecenie. (Zob. par.\nA13–A14);\n(b) gdy badanie nie jest przeprowadzane w całości przez partnera odpowiedzialnego za zlecenie\nkluczowego biegłego rewidenta lub podczas badania jednostki, której charakter i okoliczności\nsą bardziej złożone, partner odpowiedzialny za zlecenie kluczowy biegły rewident może\nprzydzielić zaprojektowanie lub wykonanie niektórych procedur, zadań lub czynności innym\nczłonkom zespołu wykonującego zlecenie." },
    { "ref": "220(9)", "desc": "Partner odpowiedzialny za zlecenie kluczowy biegły rewident ponosi ostateczną odpowiedzialność,\na przez to jest rozliczany z przestrzegania wymogów niniejszego MSB. Wyrażenie „partner\nodpowiedzialny za zlecenie kluczowy biegły rewident ponosi odpowiedzialność za...” jest\nstosowane dla tych wymogów, gdzie partner odpowiedzialny za zlecenie kluczowy biegły rewident\nmoże przydzielić zaprojektowanie lub wykonanie procedur, zadań lub czynności członkom zespołu\nwykonującego zlecenie posiadającym odpowiednie umiejętności lub stosowne doświadczenie. Dla\ninnych wymogów, niniejszy MSB (PL) wyraźnie przewiduje, że taki wymóg lub obowiązek jest\nwypełniany przez partnera odpowiedzialnego za zlecenie kluczowego biegłego rewidenta, który\nmoże uzyskiwać informacje od firmy lub innych członków zespołu wykonującego zlecenie. (Zob.\npar. A22–A25)" },
    { "ref": "220(10)", "desc": "Niniejszy MSB (PL) stosuje się do badań sprawozdań finansowych za okresy rozpoczynające się\n15 grudnia 2022 r. lub później." },
    { "ref": "220(11)", "desc": "Celem biegłego rewidenta jest zarządzanie jakością na poziomie zlecenia, aby uzyskać racjonalną\npewność, że jakość została zapewniona tak, że:\n(a) biegły rewident wypełnił obowiązki biegłego rewidenta oraz przeprowadził badanie zgodnie\nz zawodowymi standardami oraz mającymi zastosowanie wymogami prawnymi\ni regulacyjnymi; oraz\n(b) wydane sprawozdanie biegłego rewidenta jest odpowiednie do okoliczności." },
    { "ref": "220(12)", "desc": "Dla celów MSB (PL) następujące pojęcia mają znaczenia przypisane poniżej:\n(a) Partner odpowiedzialny za zlecenie3 – kluczowy biegły rewident – partner lub inna osoba\nfizyczna wskazana przez firmę, która jest odpowiedzialna za zlecenie badania i jego\nwykonanie oraz za sprawozdanie biegłego rewidenta, które jest wydawane w imieniu firmy\noraz która, jeżeli jest to wymagane, posiada odpowiednie uprawnienia wydane przez organ\nzawodowy, prawny lub regulacyjny.\nDla zleceń badania sprawozdań finansowych przeprowadzanych zgodnie z ustawą z dnia 11\nmaja 2017 r. o biegłych rewidentach, firmach audytorskich oraz nadzorze publicznym (Dz.U.\nz 2020 r. poz. 1415 z późn. zm.; dalej „ustawa o biegłych rewidentach”), przez kluczowego\nbiegłego rewidenta – zwanego dalej „KBR” – należy rozumieć:\n w przypadku badania sprawozdania finansowego – biegły rewident wyznaczony przez\nfirmę audytorską jako w głównym stopniu odpowiedzialny za przeprowadzenie danego\nbadania w imieniu firmy audytorskiej, lub\n w przypadku badania skonsolidowanego sprawozdania finansowego grupy kapitałowej –\nbiegły rewident wyznaczony przez firmę audytorską jako w głównym stopniu\nodpowiedzialny za przeprowadzenie badania skonsolidowanego sprawozdania\nfinansowego grupy kapitałowej w imieniu firmy audytorskiej na poziomie jednostki\ndominującej danej grupy kapitałowej oraz biegłego rewidenta wyznaczonego jako\nw głównym stopniu odpowiedzialnego za przeprowadzenie badania skonsolidowanego\nsprawozdania finansowego grupy kapitałowej na poziomie jednostek zależnych objętych\nskonsolidowanym sprawozdaniem finansowym danej grupy kapitałowej, lub\n biegłego rewidenta podpisującego sprawozdanie z badania.\n(b) Kontrola jakości wykonania zlecenia - obiektywna ocena znaczących osądów dokonanych\nprzez zespół wykonujący zlecenie i wyciągniętych wniosków, wykonana przez kontrolera\n\n3 Pojęcia „partner odpowiedzialny za zlecenie” – kluczowy biegły rewident, „partner” oraz „firma”, należy odczytywać\npoprzez odniesienie do ich odpowiedników w sektorze publicznym, tam, gdzie to stosowne.\nMSB 220 (Zmieniony)\nStrona 8 z 49\njakości wykonania zlecenia oraz zakończona w dacie lub przed datą sprawozdania ze\nzlecenia.\n(c) Kontroler jakości wykonania zlecenia – partner, inna osoba z firmy lub osoba spoza firmy,\nwybrana przez firmę w celu wykonania kontroli jakości wykonania zlecenia.\n(d) Zespół wykonujący zlecenie - wszyscy partnerzy i personel wykonujący zlecenie badania oraz\nwszelkie inne osoby, które wykonują procedury badania podczas zlecenia, z wyłączeniem\nzewnętrznego eksperta biegłego rewidenta4 oraz audytorów wewnętrznych, którzy zapewniają\nbezpośrednią pomoc podczas zlecenia.\n5\n(Zob. par. A15–A25)\nZgodnie z ustawą o biegłych rewidentach, przez zespół wykonujący badanie – należy rozumieć\nwszystkie osoby zaangażowane w przeprowadzanie badania, w szczególności biegłych\nrewidentów, osoby przeprowadzające kontrolę jakości wykonania zlecenia, kadrę kierowniczą\nwyższego szczebla oraz osoby odbywające aplikację, uczestniczących w przeprowadzanym\nbadaniu, a także zatrudnianych przez firmę audytorską ekspertów oraz inne osoby wykonujące,\nw ramach danego badania, czynności na zlecenie lub pod kontrolą biegłego rewidenta lub firmy\naudytorskiej.\n(e) Firma – jednoosobowa działalność (sole practitioner), spółka partnerska lub kapitałowa, bądź\ninna jednostka zrzeszająca zawodowych księgowych, lub osoby będące ich odpowiednikami\nw sektorze publicznym. (Zob. par. A26)\nZgodnie z ustawą o biegłych rewidentach, firmą audytorską jest jednostka, w której badania\nsprawozdań finansowych przeprowadzają biegli rewidenci, wpisana na listę firm\naudytorskich i prowadząca działalność w jednej z następujących form:\n1) działalności gospodarczej prowadzonej przez biegłego rewidenta we własnym imieniu\ni na własny rachunek;\n2) spółki cywilnej, spółki jawnej lub spółki partnerskiej, w której większość głosów\nposiadają biegli rewidenci lub firmy audytorskie, zatwierdzone co najmniej w jednym\npaństwie Unii Europejskiej; w spółkach, w których powołano zarząd, większość\nczłonków zarządu stanowią biegli rewidenci zatwierdzeni co najmniej w jednym\npaństwie Unii Europejskiej; jeżeli zarząd składa się z nie więcej niż 2 osób, jedną\nz nich jest biegły rewident;\n3) spółki komandytowej, w której komplementariuszami są wyłącznie biegli rewidenci\nlub firmy audytorskie zatwierdzeni co najmniej w jednym państwie Unii Europejskiej;\n4) spółki kapitałowej lub spółdzielni, które spełniają następujące wymagania:\na. większość członków zarządu stanowią biegli rewidenci zatwierdzeni co najmniej\nw jednym państwie Unii Europejskiej; jeżeli zarząd składa się z nie więcej niż 2\nosób, jedną z nich jest biegły rewident,\n\n4 MSB 620 „Wykorzystanie pracy eksperta biegłego rewidenta”, paragraf 6(a), określa definicję terminu „ekspert biegłego\nrewidenta”.\n5 MSB 610 (zmieniony w 2013 r.) „Wykorzystanie pracy audytorów wewnętrznych”, ustanawia ograniczenia w korzystaniu\nz pomocy bezpośredniej. Przyznaje również, że na mocy przepisu prawa i regulacji zewnętrznemu biegłego rewidenta może\nobowiązywać zakaz uzyskiwania bezpośredniej pomocy od audytorów wewnętrznych. W związku z powyższym,\nkorzystanie z pomocy bezpośredniej jest ograniczone do sytuacji, w których jest ona dozwolona.\nMSB 220 (Zmieniony)\nStrona 9 z 49\nb. większość głosów na walnym zgromadzeniu posiadają biegli rewidenci lub firmy\naudytorskie zatwierdzeni co najmniej w jednym państwie Unii Europejskiej,\nc. większość członków organów nadzorczych stanowią biegli rewidenci zatwierdzeni\nco najmniej w jednym państwie Unii Europejskiej;\n5) spółdzielczego związku rewizyjnego, który spełnia następujące wymagania:\na. zatrudnia do badania biegłych rewidentów,\nb. większość członków zarządu stanowią biegli rewidenci zatwierdzeni co najmniej\nw jednym państwie Unii Europejskiej; jeżeli zarząd składa się z nie więcej niż 2\nosób, jedną z nich jest biegły rewident.\n(f) Firma należąca do sieci – firma lub jednostka, która należy do sieci firm. (Zob. par. A27)\n(g) Sieć - większa struktura: (zob. par. A27)\n(i) której celem jest współpraca, oraz\n(ii) której wyraźnym celem jest udział w zyskach lub kosztach, albo która posiada\nwspólnego właściciela, system kontroli lub zarządzanie, wspólną politykę i procedury\nzarządzania jakością, wspólną strategię gospodarczą, korzysta ze wspólnego znaku\nfirmowego lub znaczącej części zasobów zawodowych.\nZgodnie z ustawą o biegłych rewidentach przez sieć – należy rozumieć strukturę:\na. której celem jest współpraca i do której należy biegły rewident lub firma audytorska, oraz\nb. której celem jest podział zysków lub kosztów, lub która funkcjonuje w ramach wspólnych\npowiązań właścicielskich, lub która posiada wspólną politykę i procedury kontroli\njakości, lub która posiada wspólną strategię gospodarczą, lub która korzysta ze\nwspólnego oznaczenia lub znaczącej części zasobów.\n(h) Partner – każda osoba uprawniona do zobowiązania firmy do wykonania zlecenia usług\nzawodowych.\n(i) Personel – partnerzy i pracownicy firmy.\n(j) Standardy zawodowe - Międzynarodowe Standardy Badania (MSB) i stosowne wymogi\netyczne.\nZgodnie z ustawą o biegłych rewidentach, przez krajowe standardy badania należy rozumieć\nstandardy badania przyjęte przez Krajową Radę Biegłych Rewidentów zatwierdzone przez\nRadę Polskiej Agencji Nadzoru Audytowego w zakresie, w jakim odnoszą się one do badań\nsprawozdań finansowych.\n(k) Stosowne wymogi etyczne - zasady etyki zawodowej i wymogi etyczne, które mają\nzastosowanie do zawodowych księgowych przy podejmowaniu się zlecenia badania.\nStosowne wymogi etyczne obejmują zazwyczaj postanowienia Międzynarodowego Kodeksu\nEtyki Zawodowych Księgowych (w tym Międzynarodowe Standardy Niezależności) Rady\nMiędzynarodowych Standardów Etyki dla Księgowych (Kodeks IESBA) dotyczące badań\nsprawozdań finansowych wraz z krajowymi wymogami, które są bardziej wymagające.\nBiegli rewidenci w Polsce podlegają wymogom etycznym wynikającym z:\nMSB 220 (Zmieniony)\nStrona 10 z 49\n1) ustawy o biegłych rewidentach; oraz\n2) zasad etyki zawodowej przyjętych przez Krajowa Radę Biegłych Rewidentów, tj.\nMiędzynarodowego Kodeksu etyki zawodowych księgowych (w tym\nMiędzynarodowych standardów niezależności) IESBA (zwanego dalej „Kodeksem”).\n(l) Reakcja (w odniesieniu do systemu zarządzania jakością) - polityki lub procedury\nzaprojektowane i wdrożone przez firmę w celu zareagowania na jedno lub więcej ryzyk\ndotyczących jakości:\n(i) Polityki są deklaracjami tego, co należy lub czego nie należy zrobić, aby zareagować\nna ryzyko(a) dotyczące jakości. Takie deklaracje mogą zostać udokumentowane,\nwprost wyrażone w przekazywanych informacjach lub być dorozumiane na podstawie\ndziałań lub decyzji.\n(ii) Procedury są działaniami w celu wdrożenia polityk.\n(m) Pracownicy - specjaliści nie będący partnerami, w tym zatrudnieni przez firmę eksperci." },
    { "ref": "220(13)", "desc": "Partner odpowiedzialny za zlecenie KBR ponosi całościową odpowiedzialność za zarządzanie\ni zapewnianie jakości podczas zlecenia badania, w tym ponosi odpowiedzialność za stworzenie\nśrodowiska dla zlecenia, które kładzie nacisk na kulturę firmy i zachowania oczekiwane od\nczłonków zespołu wykonującego zlecenie. Dokonując tego, partner odpowiedzialny za zlecenie\nKBR jest wystarczająco i odpowiednio zaangażowany podczas całego zlecenia badania tak, aby\npartner odpowiedzialny za zlecenie KBR miał podstawy do ustalenia, czy dokonane znaczące\nosądy i wyciągnięte wnioski są odpowiednie biorąc pod uwagę charakter i okoliczności zlecenia.\n(Zob. par. A28–A37)" },
    { "ref": "220(14)", "desc": "Tworząc środowisko opisane w paragrafie 13, partner odpowiedzialny za zlecenie KBR bierze\nodpowiedzialność za podejmowanie jasnych, spójnych i skutecznych działań, które odzwierciedlają\nzaangażowanie firmy w jakość oraz ustanawia i komunikuje zachowania oczekiwane od członków\nzespołu wykonującego zlecenie, w tym podkreślając: (zob. par. A30–A34)\n(a) że wszyscy członkowie zespołu wykonującego zlecenie są odpowiedzialni za przyczynianie\nsię do zarządzania i zapewniania jakości na poziomie zlecenia;\n(b) znaczenie etyki zawodowej, wartości i postaw dla członków zespołu wykonującego zlecenie;\n(c) znaczenie otwartej i solidnej komunikacji wewnątrz zespołu wykonującego zlecenie oraz\nwspieranie możliwości zgłaszania obaw przez członków zespołu wykonującego zlecenie bez\nlęku przed odwetem; oraz\n(d) znaczenie stosowania zawodowego sceptycyzmu przez każdego członka zespołu wykonującego\nzlecenie podczas całego zlecenia badania." },
    { "ref": "220(15)", "desc": "Jeżeli partner odpowiedzialny za zlecenie KBR przydzieli zaprojektowanie lub wykonanie\nprocedur, zadań lub czynności związanych z wymogiem niniejszego MSB (PL) innym członkom\nzespołu wykonującego zlecenie, aby pomogli oni partnerowi odpowiedzialnemu za zlecenie KBR\nw przestrzeganiu wymogów niniejszego MSB (PL), partner odpowiedzialny za zlecenie KBR nadal\nponosi całościową odpowiedzialność za zarządzanie i zapewnianie jakości zlecenia badania\nMSB 220 (Zmieniony)\nStrona 11 z 49\npoprzez kierowanie i nadzór nad tymi członkami zespołu wykonującego zlecenie oraz przegląd ich\npracy. (Zob. par. 9, A37)" },
    { "ref": "220(17)", "desc": "Partner odpowiedzialny za zlecenie KBR bierze odpowiedzialność za pouczenie innych członków\nzespołu wykonującego zlecenie o stosownych wymogach etycznych, które mają zastosowanie,\nbiorąc pod uwagę charakter i okoliczności zlecenia badania oraz o powiązanych politykach lub\nprocedurach firmy, w tym tych dotyczących: (zob. par. A23–A25, A40–A44)\n(a) identyfikowania, oceny i zareagowania na zagrożenia dla przestrzegania stosownych\nwymogów etycznych, w tym tych dotyczących niezależności;\n(b) okoliczności, które mogą spowodować naruszenie stosownych wymogów etycznych, w tym\ntych dotyczących niezależności, oraz obowiązków członków zespołu wykonującego zlecenie,\ngdy dowiadują się oni o naruszeniach; oraz\n(c) obowiązków członków zespołu wykonującego zlecenie, gdy dowiadują się oni o przypadku\nnaruszenia przepisów prawa i regulacji przez jednostkę.6" },
    { "ref": "220(18)", "desc": "Jeżeli uwagę partnera odpowiedzialnego za zlecenie KBR zwrócą sprawy, które wskazują na\nistnienie zagrożenia dla zgodności ze stosownymi wymogami etycznymi, partner odpowiedzialny\nza zlecenie KBR ocenia zagrożenia przestrzegając polityk lub procedur firmy, wykorzystując\nstosowne informacje uzyskane od firmy, zespołu wykonującego zlecenie lub z innych źródeł oraz\npodejmuje odpowiednie działania. (Zob. par. A43–A44)" },
    { "ref": "220(19)", "desc": "Przez cały okres zlecenia badania partner odpowiedzialny za zlecenie KBR zachowuje czujność,\npoprzez obserwację i kierowanie zapytań, jeśli to niezbędne, co do naruszeń stosownych wymogów\netycznych lub powiązanych polityk lub procedur firmy przez członków zespołu wykonującego\nzlecenie. (Zob. par. A45)\n" },
    { "ref": "220(20)", "desc": "Jeżeli dzięki systemowi zarządzania jakością firmy lub innym źródłom uwagę partnera\nodpowiedzialnego za zlecenie KBR zwrócą sprawy wskazujące na to, że stosowne wymogi\netyczne, mające zastosowanie do charakteru i okoliczności zlecenia badania, nie zostały spełnione,\npartner odpowiedzialny za zlecenie KBR, po konsultacji z innymi osobami w firmie, podejmuje\nodpowiednie działania. (" },
    { "ref": "220(22)", "desc": "Partner odpowiedzialny za zlecenie KBR ustala, że postępowano zgodnie z politykami lub\nprocedurami firmy dotyczącymi akceptacji i kontynuacji relacji z klientem oraz zleceń badania,\na wnioski wyciągnięte w tym zakresie są odpowiednie" },
    { "ref": "220(23)", "desc": "Partner odpowiedzialny za zlecenie KBR bierze pod uwagę informacje uzyskane w trakcie procesu\nakceptacji i kontynuacji podczas planowania i wykonywania zlecenia badania zgodnie z MSB oraz\nprzestrzegania wymogów niniejszego MSB (PL)." },
    { "ref": "220(24)", "desc": "Jeżeli zespół odpowiedzialny za zlecenie KBR uzyska informacje, które, gdyby były znane firmie\nprzed akceptacją lub kontynuacją relacji z klientem lub określonego zlecenia, spowodowałyby\nodmowę wykonania zlecenia badania przez firmę, partner odpowiedzialny za zlecenie KBR\nniezwłocznie przekazuje te informacje firmie, aby firma oraz partner odpowiedzialny za zlecenie\nKBR mogli podjąć niezbędne działania." },
    { "ref": "220(25)", "desc": "Partner odpowiedzialny za zlecenie KBR ustala, że zespołowi wykonującemu zlecenie\nprzydzielono lub udostępniono w odpowiednim terminie wystarczające i odpowiednie zasoby\nw celu wykonania zlecenia, biorąc pod uwagę charakter i okoliczności zlecenia badania, polityki\nlub procedury firmy oraz wszelkie zmiany, jakie mogą nastąpić podczas zlecenia. (Zob. par. A59–\nA70, A73–A74, A79)\n" },

    { "ref": "230(8)", "desc": "Biegły rewident sporządza dokumentację badania wystarczającą do tego, aby umożliwić\ndoświadczonemu audytorowi, który nie miał wcześniejszych powiązań z tym badaniem,\nzrozumienie: (zob. par. A2-A5, A16-A17)\n(a) rodzaju, rozłożenia w czasie i zakresu przeprowadzonych procedur badania w celu\nwypełnienia wymogów MSB i mających zastosowanie wymogów prawnych\ni regulacyjnych, (zob. par. A6-A7)\n(b) rezultatów przeprowadzonych procedur badania i uzyskanych dowodów badania oraz\n(c) znaczących spraw, które pojawiły się podczas badania, dotyczących ich wniosków\ni znaczących zawodowych osądów dokonanych przy formułowaniu tych wniosków. (Zob.\npar. A8-A11)\n" },
    { "ref": "230(12)", "desc": "Jeżeli, w wyjątkowych okolicznościach, biegły rewident uzna za konieczne odstąpienie od\nstosownego wymogu MSB, to dokumentuje, w jaki sposób przeprowadzone alternatywne\nprocedury badania doprowadziły do osiągnięcia celu tego wymogu oraz podaje przyczyny\nodstąpienia od jego zastosowania. (Zob. par. A18-A19)" },

    { "ref": "240(9)", "desc": "Niniejszy standard stosuje się przy badaniu sprawozdań finansowych sporządzonych za okresy\nrozpoczynające się 15 grudnia 2009 r. i później. " },
    { "ref": "240(15)", "desc": "MSB 315 (zmieniony) wymaga przeprowadzenia dyskusji wśród członków zespołu wykonującego badanie\noraz ustalenia przez partnera odpowiedzialnego za badanie, jakie sprawy należy zakomunikować osobom nie\nuczestniczącym w dyskusji5\n. W dyskusji kładzie się szczególny nacisk na to, w jaki sposób i w którym miejscu\nsprawozdania finansowe jednostki mogą być podatne na ryzyko istotnego zniekształcenia w wyniku oszustwa,\nw tym na sposób, w jaki oszustwo mogłoby zostać popełnione. Dyskusję przeprowadza się, nie biorąc pod\nuwagę przekonania zespołu wykonującego badanie o uczciwości i rzetelności kierownictwa oraz osób\nsprawujących nadzór (zob. par. A10-A11).\n" },
    { "ref": "240(17)", "desc": "Biegły rewident kieruje do kierownictwa zapytania dotyczące:\n (a) dokonanej przez kierownictwo oceny ryzyka istotnego zniekształcenia sprawozdań finansowych\nspowodowanego oszustwem, w tym charakteru, zakresu i częstotliwości dokonywania takich ocen (zob. par.\nA12-A13),\n (b) stosowanego przez kierownictwo procesu rozpoznawania i reagowania na ryzyko oszustwa w jednostce, w\ntym na specyficzne ryzyko oszustwa rozpoznane przez kierownictwo lub na które zwrócono jego uwagę lub\nsalda, grupy transakcji, lub ujawnienia, których może dotyczyć ryzyko oszustwa (zob. par. A14),\n (c) przekazanych przez kierownictwo osobom sprawującym nadzór komunikatów, o ile miały miejsce,\ndotyczących procesu rozpoznawania i reagowania przez kierownictwo na ryzyko oszustwa w jednostce oraz\n (d) przekazanych przez kierownictwo komunikatów, o ile miały miejsce, na temat jego poglądów dotyczących\npraktyki biznesowej oraz etycznego zachowania." },
    { "ref": "240(18)", "desc": "Biegły rewident kieruje zapytania do kierownictwa lub odpowiednio do innych osób wewnątrz jednostki,\njeśli to odpowiednie, aby ustalić, czy posiadają wiedzę na temat wszelkich rzeczywistych, domniemanych lub\nzarzucanych oszustw dotyczących jednostki (zob. par. A15-A17)." },
    { "ref": "240(19)", "desc": "W przypadku jednostek posiadających audyt wewnętrzny biegły rewident kieruje zapytania do audytorów\nwewnętrznych, aby ustalić, czy posiadają wiedzę na temat wszelkich rzeczywistych, domniemanych lub\nzarzucanych oszustw dotyczących jednostki i uzyskać ich opinię na temat ryzyka oszustwa (zob. par. A18)." },
    { "ref": "240(20)", "desc": "O ile nie wszystkie osoby sprawujące nadzór uczestniczą w kierowaniu jednostką\n7\n, biegły rewident stara się\nzrozumieć, w jaki sposób osoby te nadzorują proces rozpoznawania i reagowania przez kierownictwo na ryzyko\noszustwa w jednostce oraz kontrolę wewnętrzną stworzoną przez kierownictwo w celu ograniczenia tego ryzyka\n(zob. par. A19-A21)." },
    { "ref": "240(21)", "desc": "O ile nie wszystkie osoby sprawujące nadzór uczestniczą w zarządzaniu jednostką, biegły rewident kieruje\nzapytania do osób sprawujących nadzór, aby ustalić, czy posiadają wiedzę na temat wszelkich rzeczywistych,\ndomniemanych lub zarzucanych oszustw dotyczących jednostki. Zapytania te są zadawane po to, aby\npotwierdzić odpowiedzi uzyskane od kierownictwa." },
    { "ref": "240(22)", "desc": "Biegły rewident ocenia, czy nietypowe lub nieoczekiwane powiązania, które zostały rozpoznane w trakcie\nprzeprowadzenia procedur analitycznych, w tym odnoszących się do kont przychodów, mogą wskazywać na\nistotne zniekształcenie spowodowane oszustwem." },
    { "ref": "240(23)", "desc": "Biegły rewident rozważa, czy pozostałe informacje przez niego uzyskane wskazują na ryzyko istotnego\nzniekształcenia w spowodowanego oszustwem (zob. par. A22)" },
    { "ref": "240(24)", "desc": "Biegły rewident ocenia, czy informacje uzyskane na podstawie innych procedur oceny ryzyka oraz\nprzeprowadzonych związanych z tym czynności wskazują na istnienie jednego lub większej liczby czynników\nryzyka oszustwa. O ile czynniki ryzyka oszustwa niekoniecznie świadczą o istnieniu oszustwa, często\ntowarzyszą okolicznościom, w których dochodzi do popełnienia oszustwa i dlatego mogą wskazywać na ryzyko\nistotnego zniekształcenia spowodowanego oszustwem (zob. par. A23-A27)." },
    { "ref": "240(25)", "desc": "Zgodnie z MSB 315 (zmienionym) biegły rewident rozpoznaje i ocenia spowodowane oszustwem ryzyko\nistotnego zniekształcenia na poziomie sprawozdania finansowego oraz stwierdzeń dotyczących grup transakcji,\nsald kont i ujawnianych informacji\n" },
    { "ref": "240(26)", "desc": "Rozpoznając i oceniając ryzyko istotnego zniekształcenia spowodowanego oszustwem biegły rewident, w\noparciu o założenie, że ryzyko oszustwa wiąże się z ujmowaniem przychodów, ocenia, które rodzaje\nprzychodów, transakcji powiązanych z przychodami lub twierdzeń, mogą rodzić takie ryzyko. Paragraf 47\nokreśla wymaganą dokumentację, w oparciu o którą, biegły rewident stwierdza, że założenie to nie ma zastosowania w warunkach danego zlecenia, a zatem nie rozpoznał ujmowania przychodów jako ryzyka\nistotnego zniekształcenia spowodowanego oszustwem (zob. par. A28-A30)." },
    { "ref": "240(29)", "desc": "Określając ogólne reakcje na ocenione ryzyko istotnego zniekształcenia spowodowanego oszustwem na\npoziomie sprawozdań finansowych, biegły rewident:\n (a) przydziela i nadzoruje personel, biorąc pod uwagę wiedzę, umiejętności i zdolności członków zespołu,\nktórym przydzielono znaczące zadania związane ze zleceniem oraz ocenę biegłego rewidenta dotyczącą ryzyka\nistotnego zniekształcenia spowodowanego oszustwem (zob. par. A34-A35),\n (b) rozważa, czy wybór i zastosowanie zasad (polityki) rachunkowości przez jednostkę, w szczególności tych\ndotyczących subiektywnych wycen i złożonych transakcji, może wskazywać na oszukańczą sprawozdawczość\nfinansową wynikającą z dążenia kierownictwa do kształtowania dochodów oraz\n (c) uwzględnić element nieprzewidywalności w czasie dokonywania wyboru rodzaju, rozłożenia w czasie i\nzakresu procedur badania (zob. par. A36)." },
    { "ref": "240(30)", "desc": "Zgodnie z MSB 330 biegły rewident projektuje i przeprowadza dalsze procedury badania, których rodzaj,\nrozłożenie w czasie i zakres odpowiadają ocenie ryzyka istotnego zniekształcenia spowodowanego oszustwem\nna poziomie stwierdzeń\n10 (zob. par. A37-A40)." },
    { "ref": "240(31)", "desc": "Kierownictwo jest w wyjątkowej sytuacji, która umożliwia mu popełnienie oszustwa z racji możliwości\nmanipulowania zapisami księgowymi i sporządzania nacechowanych oszustwem sprawozdań finansowych\npoprzez obchodzenie kontroli, które w innych sytuacjach wydają się działać skutecznie. O ile poziom ryzyka\nobchodzenia kontroli przez kierownictwo będzie różny w poszczególnych jednostkach, ryzyko to tym niemniej\nwystępuje we wszystkich jednostkach. Z uwagi na trudny do przywidzenia sposób obejścia tych kontroli, jest to\nryzyko wystąpienia istotnego zniekształcenia powstałego w wyniku oszustwa, dlatego uznaje się je za ryzyko\nznaczące." },
    { "ref": "240(32)", "desc": "Niezależnie od oceny biegłego rewidenta dotyczącej ryzyka obejścia kontroli przez kierownictwo, biegły\nrewident projektuje i przeprowadza procedury badania, aby:\n (a) sprawdzić odpowiedniość zapisów w księdze głównej oraz innych korekt wprowadzonych podczas\nsporządzania sprawozdań finansowych. Projektując i przeprowadzając procedury badania dla takich testów,\nbiegły rewident:\n (i) kieruje zapytania do osób uczestniczących w procesie sprawozdawczości finansowej dotyczące\nnieodpowiedniej lub nietypowej działalności związanej z przetwarzaniem zapisów ksiąg rachunkowych i innych\nkorekt,\n (ii) wybiera zapisy księgowe w księdze głównej i inne korekty wprowadzone na zakończenie okresu\nsprawozdawczego oraz\n (iii) rozważa potrzebę sprawdzenia zapisów księgowych w księdze głównej i korekt dokonanych w ciągu\nokresu (zob. par. A41-A44);\n (b) dokonać przeglądu wartości szacunkowych pod kątem ich subiektywności oraz ocenić, czy okoliczności\nbędące źródłem subiektywizmu, o ile mają miejsce, stanowią ryzyko istotnego zniekształcenia spowodowanego\noszustwem. Dokonując takiego przeglądu, biegły rewident:\n (i) rozważa, czy oceny i decyzje podjęte przez kierownictwo w trakcie ustalania wartości szacunkowych\nuwzględnionych w sprawozdaniach finansowych, mimo iż z osobna wydają się zasadne, wskazują na\nsubiektywizm kierownictwa jednostki, który może być źródłem ryzyka istotnego zniekształcenia\nspowodowanego oszustwem. Jeśli tak, biegły rewident dokonuje ponownej łącznej oceny wszystkich wartości\nszacunkowych oraz  (ii) przeprowadza retrospektywny przegląd osądów i założeń przeprowadzonych przez kierownictwo, które\nodnoszą się do znaczących wartości szacunkowych odzwierciedlonych w sprawozdaniach finansowych za\nubiegły rok (zob. par. A45-A47);\n (c) ocenia, czy w przypadku znaczących transakcji niemieszczących się w ramach zwykłego trybu działalności\ngospodarczej jednostki, bądź też tych, które z innych względów wydają się być nietypowe w świetle wiedzy\nbiegłego rewidenta na temat jednostki i jej środowiska oraz w świetle innych informacji uzyskanych w trakcie\nbadania – uzasadnienie gospodarcze dla tych transakcji (bądź jego brak) sugeruje, że zawarto je w celu realizacji\noszukańczej sprawozdawczości finansowej lub zatajenia faktu zawłaszczenia majątku (zob. par. A48)." },
    { "ref": "240(33)", "desc": "Biegły rewident ustala, czy w celu reakcji na rozpoznane ryzyko obejścia kontroli przez kierownictwo,\npowinien przeprowadzić inne procedury od omówionych w powyższych paragrafach (tj. wtedy, gdy występują\ndodatkowe ryzyka obchodzenia kontroli przez kierownictwo, które nie są objęte procedurami\nprzeprowadzanymi w celu spełnienia wymogów zawartych w paragrafie 32)." },
    { "ref": "240(35)", "desc": "Jeżeli biegły rewident wykrył zniekształcenie, ocenia, czy wskazuje ono na istnienie oszustwa. Jeżeli takie\nwskazanie ma miejsce, biegły rewident ocenia wpływ zniekształcenia na inne aspekty badania, a szczególnie na\nwiarygodność oświadczeń kierownictwa, zakładając, że wystąpienie oszustwa rzadko kiedy jest zdarzeniem\nwyizolowanym (zob. par. A51)." },
    { "ref": "240(36)", "desc": "Jeżeli biegły rewident rozpoznał zniekształcenie, niezależnie od poziomu jego istotności, i biegły rewident\nma powody, aby przypuszczać, że jest lub może być ono wynikiem oszustwa, w które mogą być zamieszane\nosoby z kierownictwa (w szczególności wyższego szczebla), biegły rewident dokonuje ponownej oceny ryzyka\nistotnego zniekształcenia spowodowanego oszustwem oraz jego wpływu na rodzaj, rozłożenie w czasie i zakres\nprocedur badania odpowiadających ocenionemu ryzyku. Biegły rewident ponownie rozważając wiarygodność\nwcześniej uzyskanych dowodów badania rozważa także, czy okoliczności lub warunki wskazują na możliwą\nzmowę obejmującą pracowników, kierownictwo oraz strony trzecie (zob. par. A52)." },
    { "ref": "240(39)", "desc": "Biegły rewident otrzymuje od kierownictwa oraz, tam gdzie to zasadne, od osób sprawujących nadzór\npisemne oświadczenia, że:\n (a) potwierdzają swoją odpowiedzialność za zaprojektowanie, wdrożenie i utrzymywanie kontroli\nwewnętrznej, służącej zapobieganiu i wykrywaniu oszustw;\n (b) ujawnili biegłemu rewidentowi wyniki oceny ryzyka, że sprawozdania finansowe na skutek oszustwa mogą\nzawierać istotne zniekształcenie;\n (c) ujawnili biegłemu rewidentowi wiedzę na temat oszustwa lub podejrzewanego oszustwa wpływającego na\njednostkę, które obejmuje:\n (i) kierownictwo,\n (ii) pracowników odgrywających znaczącą rolę przy kontroli wewnętrznej lub (iii) inne osoby, jeżeli oszustwo ma istotny wpływ na sprawozdania finansowe;\n (d) ujawnili biegłemu rewidentowi wiedzę na temat zarzutów o oszustwo lub podejrzewane oszustwo\nwpływające na sprawozdania finansowe, które to zarzuty zostały zgłoszone przez pracowników, byłych\npracowników, analityków, regulatorów i innych (zob. par. A58-A59)." },
    { "ref": "240(40)", "desc": "Jeżeli biegły rewident rozpoznał oszustwo lub otrzymał informacje wskazujące na możliwość istnienia\noszustwa, biegły rewident niezwłocznie informuje o tym kierownictwo odpowiedniego szczebla, które\nprzekazuje te informacje osobom odpowiedzialnym za zapobieganie i wykrywanie oszustw w podległych im\nobszarach (zob. par. A60)." },
    { "ref": "240(41)", "desc": "O ile nie wszystkie osoby sprawujące nadzór uczestniczą w zarządzaniu jednostką, jeżeli biegły rewident\nstwierdził lub podejrzewa oszustwo z udziałem:\n (a) kierownictwa,\n (b) pracowników pełniących znaczące role w kontroli wewnętrznej lub\n (c) innych osób, jeżeli oszustwo prowadzi do istotnego zniekształcenia sprawozdań finansowych\nbiegły rewident informuje niezwłocznie o tych sprawach osoby sprawujące nadzór. Jeżeli biegły rewident\npodejrzewa oszustwo z udziałem kierownictwa, informuje o swych podejrzeniach osoby sprawujące nadzór i\nomawia z nimi rodzaj, rozłożenie w czasie i zakres procedur badania, które są niezbędne do tego, by zakończyć\nbadanie (zob. par. A61-A63).\n" },
    { "ref": "240(42)", "desc": "Biegły rewident informuje osoby sprawujące nadzór o wszystkich innych sprawach związanych z\noszustwem, które w jego ocenie mają związek z ich odpowiedzialnością (zob. par. A64).\n" },
    { "ref": "240(44)", "desc": "W dokumentacji badania dotyczącej sposobu rozumienia jednostki i jej otoczenia przez biegłego rewidenta\noraz oceny ryzyka istotnego zniekształcenia, której wymaga MSB 315 (zmieniony)12, biegły rewident\nzamieszcza:\n (a) znaczące decyzje podjęte w ciągu dyskusji przeprowadzonej w gronie zespołu wykonującego badanie\ndotyczące podatności sprawozdań finansowych jednostki na istotne zniekształcenia spowodowane oszustwem\noraz\n (b) rozpoznane i ocenione ryzyko istotnego zniekształcenia na poziomie sprawozdania finansowego i na\npoziomie stwierdzeń.\n" },
    { "ref": "240(45)", "desc": "W dokumentacji badania dotyczącej sposobu reakcji biegłego rewidenta na ocenione ryzyko istotnego\nzniekształcenia, biegły rewident zamieszcza wymagane przez MSB 330 informacje o13:\n (a) ogólnej reakcji na ocenione ryzyko istotnego zniekształcenia spowodowanego oszustwem na poziomie\nsprawozdań finansowych oraz rodzaju, rozłożeniu w czasie i zakresie procedur badania, oraz powiązaniu tych\nprocedur z ocenianym ryzykiem istotnego zniekształcenia spowodowanego oszustwem na poziomie stwierdzeń\noraz\n (b) wynikach procedur badania, w tym tych zaprojektowanych w celu zmniejszenia ryzyka obejścia kontroli\nprzez kierownictwo." },
    { "ref": "240(46)", "desc": "Biegły rewident zamieszcza w dokumentacji badania informacje dotyczące oszustwa, które przekazał\nkierownictwu, osobom sprawującym nadzór, regulatorom i innym podmiotom." },

    { "ref": "250(12)", "desc": "Zapoznając się z jednostką i jej otoczeniem, zgodnie z wymogami MSB 315 (zmienionego)4\n, biegły\nrewident uzyskuje*\n podstawową znajomość:\n (a) ramowych założeń prawnych i regulacyjnych dotyczących jednostki i branży lub sektora, w którym\nprowadzi ona działalność oraz określa\n (b) na ile jednostka przestrzega tych założeń (zob. par. A7)" },
    { "ref": "250(13)", "desc": "Biegły rewident uzyskuje wystarczające i odpowiednie dowody badania dotyczące przestrzegania tych praw\ni regulacji, które generalnie uznaje się za mające bezpośredni wpływ na ustalanie istotnych kwot i ujawnień\nprezentowanych w sprawozdaniach finansowych (zob. par. A8)." },
    { "ref": "250(14)", "desc": "Biegły rewident przeprowadza następujące procedury badania, pomagające w rozpoznaniu przypadków\nnaruszenia innych praw i regulacji, które mogą mieć istotny wpływ na sprawozdania finansowe (zob. par. A9-\nA10):\n (a) kieruje do kierownictwa i, gdy jest to uzasadnione, osób sprawujących nadzór zapytania, czy jednostka\nprzestrzega tych praw i regulacji oraz\n (b) sprawdza korespondencję z odpowiednimi organami koncesyjnymi lub regulacyjnymi, jeśli takowe\nistnieją. " },
    { "ref": "250(15)", "desc": "W trakcie badania biegły rewident pozostaje wyczulony na to, że inne zastosowane procedury badania mogą\nmu wskazać przypadki faktycznego lub podejrzewanego naruszenia prawa i regulacji (zob. par. A11)." },
    { "ref": "250(16)", "desc": "Biegły rewident zwraca się z zapytaniem do kierownictwa i, gdy jest to uzasadnione, do osób sprawujących\nnadzór, o przedstawienie pisemnych oświadczeń, że zostały mu ujawnione wszystkie znane lub podejrzewane\nprzypadki naruszenia prawa i regulacji, których wpływ powinien być rozważony przy sporządzaniu sprawozdań\nfinansowych (zob. par. A12)." },
    { "ref": "250(18)", "desc": " Uzyskawszy informacje dotyczące naruszenia lub podejrzenia naruszenia prawa i regulacji biegły rewident\n(zob. par. A13):\n (a) zaznajamia się z charakterem zdarzenia i okolicznościami, w których ono zaszło oraz (b) uzyskuje dalsze informacje, które pozwolą na ocenę możliwego wpływu na sprawozdania finansowe (zob.\npar. A14)." },
    { "ref": "250(19)", "desc": "Jeśli biegły rewident podejrzewa, że mogło dojść do naruszenia prawa i regulacji, omawia to zagadnienie z\nkierownictwem oraz, gdy jest to uzasadnione, z osobami sprawującymi nadzór. Jeśli kierownictwo lub\nodpowiednio osoby sprawujące nadzór nie dostarczą wystarczających informacji potwierdzających, że jednostka\nprzestrzega prawa i regulacji, a wpływ podejrzewanego naruszenia na sprawozdania finansowe może być w\nocenie biegłego rewidenta istotny, wówczas biegły rewident rozważa konieczność skorzystania z porady\nprawnej (zob. par. A15-A16)." },
    { "ref": "250(20)", "desc": "Jeśli nie można uzyskać wystarczających informacji o domniemanym naruszeniu prawa i regulacji, biegły\nrewident ocenia wpływ braku wystarczających i odpowiednich dowodów badania na opinię biegłego rewidenta." },
    { "ref": "250(21)", "desc": "Biegły rewident ocenia wpływ, jaki to naruszenie wywiera na inne aspekty badania, w tym na własną ocenę\nryzyka i wiarygodność pisemnych oświadczeń oraz podejmuje odpowiednie działania (zob. par. A17-A18)." },
    { "ref": "250(22)", "desc": "Jeśli nie wszystkie osoby sprawujące nadzór uczestniczą w zarządzaniu jednostką i z tego względu nie są\nświadome zakomunikowanych już przez biegłego rewidenta spraw5\n, z którymi wiąże się rozpoznane lub\npodejrzewane naruszenie prawa i regulacji, biegły rewident informuje osoby sprawujące nadzór o zauważonych\npodczas badania sprawach związanych z naruszeniem prawa i regulacji, które nie są sprawami w oczywisty\nsposób nieistotnymi." },
    { "ref": "250(23)", "desc": "Jeśli w ocenie biegłego rewidenta naruszenie, o którym mowa w paragrafie 22, można uznać za zamierzone i\nistotne, biegły rewident informuje niezwłocznie o tej sprawie osoby sprawujące nadzór" },
    { "ref": "250(24)", "desc": "Jeśli biegły rewident podejrzewa, że kierownictwo lub osoby sprawujące nadzór uczestniczą w naruszeniu\nprawa i regulacji, informuje o tej sprawie kolejny wyższy szczebel kierowniczy w jednostce, o ile takowy\nistnieje, jak komitet audytu lub rada nadzorcza. Jeśli w jednostce nie istnieje wyższy szczebel kierowniczy lub\ngdy biegły rewident sądzi, że jego informacja może nie wywołać odpowiedniej reakcji lub nie jest pewny, kogo\npoinformować, rozważa konieczność uzyskania porady prawnej." },
    { "ref": "250(25)", "desc": "Jeżeli biegły rewident stwierdza, że naruszenie prawa i regulacji istotnie wpływa na sprawozdania\nfinansowe, jak również, że nie zostało właściwie odzwierciedlone w sprawozdaniach finansowych, zgodnie z\nMSB 705 wyraża opinię z zastrzeżeniem lub opinię negatywną o sprawozdaniach finansowych." },
    { "ref": "250(28)", "desc": "Jeśli biegły rewident rozpoznał lub podejrzewa naruszenie prawa i regulacji, wówczas rozważa, czy jest\nzobowiązany do przedstawienia rozpoznanego lub podejrzewanego naruszenia stronom spoza jednostki (zob.\npar. A19-A20). \n" },
    { "ref": "250(29)", "desc": "Biegły rewident zamieszcza w dokumentacji badania rozpoznane lub podejrzewane przypadki naruszenia\nprawa i regulacji oraz wyniki rozmów z kierownictwem i, gdy jest to uzasadnione, z osobami sprawującymi\nnadzór oraz stronami spoza jednostki7\n (zob. par. A21)." },

    { "ref": "260(2)", "desc": "Niniejszy MSB został opracowany w kontekście badania sprawozdania finansowego, ale może\nmieć również zastosowanie, w razie konieczności po dostosowaniu do okoliczności, przy\nbadaniu innych historycznych informacji finansowych, gdy osoby sprawujące nadzór ponoszą\nodpowiedzialność za nadzorowanie procesu sporządzania innych historycznych informacji\nfinansowych. " },
    { "ref": "260(14)", "desc": "Biegły rewident przedstawia osobom sprawującym nadzór odpowiedzialność biegłego rewidenta\nw odniesieniu do badania sprawozdania finansowego, w tym, że:\n(a) biegły rewident jest odpowiedzialny za sformułowanie i wyrażenie opinii na temat\nsprawozdania finansowego, które zostało sporządzone przez kierownika jednostki pod\nnadzorem osób sprawujących nadzór oraz\n(b) badanie sprawozdania finansowego nie zwalnia kierownika jednostki ani osób\nsprawujących nadzór z ich odpowiedzialności. (Zob. par. A9-A10) " },
    { "ref": "260(15)", "desc": "Biegły rewident przekazuje osobom sprawującym nadzór informacje o planowanym zakresie\ni czasie przeprowadzenia badania, co obejmuje poinformowanie o znaczących ryzykach\nzidentyfikowanych przez biegłego rewidenta. (Zob. par. A11-A16) " },
    { "ref": "260(16)", "desc": "Biegły rewident przedstawia osobom sprawującym nadzór: (Zob. par. A17-A18)\n(a) spojrzenie biegłego rewidenta na znaczące jakościowe aspekty stosowanych zasad\nrachunkowości jednostki, w tym zasad (polityki) rachunkowości, szacunków księgowych\ni ujawnień w sprawozdaniu finansowym. Jeśli stosowne, biegły rewident wyjaśnia osobom\nsprawującym nadzór, dlaczego uważa znaczącą stosowaną zasadę rachunkowości, która jest\nakceptowalna w świetle mających zastosowanie ramowych założeń sprawozdawczości\nfinansowej, za niebędącą najbardziej odpowiednią w szczególnych okolicznościach\njednostki, (Zob. par. A19-A20)\n(b) istotne trudności napotkane podczas badania, jeżeli wystąpiły (Zob. par. A21)\n(c) jeżeli nie wszystkie spośród osób sprawujących nadzór są zaangażowane w zarządzanie\njednostką:\n(i) istotne sprawy pojawiające się w trakcie badania, które zostały omówione lub były\nprzedmiotem korespondencji z kierownikiem jednostki oraz (Zob. par. A22)\n(ii)pisemne oświadczenia, o jakie prosi biegły rewident\n(d) okoliczności, które wpływają na formę i treść sprawozdania biegłego rewidenta – jeżeli\nwystąpiły, oraz (Zob. par. A23-A25)\n(e) wszelkie inne istotne kwestie pojawiające się w trakcie badania, które zgodnie\nz zawodowym osądem biegłego rewidenta, mają związek z nadzorowaniem procesu\nsprawozdawczości finansowej. (Zob. par. A26-A28) \n" },
    { "ref": "260(19)", "desc": "Biegły rewident przekazuje na piśmie osobom sprawującym nadzór znaczące ustalenia\nz badania, jeżeli zgodnie z zawodowym osądem biegłego rewidenta, ustne komunikowanie się nie byłoby odpowiednie. Pisemne informacje nie muszą zawierać wszystkich spraw, które\npojawiły się w toku badania. (Zob. par. A46-A48)" },
    { "ref": "260(22)", "desc": "Biegły rewident ocenia, czy dwustronne komunikowanie się pomiędzy biegłym rewidentem,\na osobami sprawującymi nadzór było odpowiednie dla celu badania. Jeżeli nie było, biegły\nrewident ocenia wpływ tego, jeśli taki istnieje, na ocenę biegłego rewidenta ryzyk istotnego\nzniekształcenia i zdolność do uzyskania wystarczających i odpowiednich dowodów badania,\noraz podejmuje odpowiednie działanie. (Zob. par. 51-A53) " },
    { "ref": "260(23)", "desc": "Jeśli sprawy, których przekazania wymaga niniejszy MSB, są przedstawiane ustnie, biegły\nrewident włącza je do dokumentacji badania wraz z informacją, kiedy i komu zostały one\nprzedstawione. Jeśli sprawy zostały przekazane na piśmie, biegły rewident zachowuje kopię\ninformacji jako część dokumentacji badania.\n2\n(Zob. par. A54) " },

    { "ref": "300(6)", "desc": "Biegły rewident podejmuje na początku bieżącego zlecenia badania następujące czynności:\n(a) przeprowadza wymagane przez MSB 220 procedury dotyczące kontynuacji współpracy z klientem i przyjęcia określonego zlecenia badania,\n(b) ocenia zgodność z określonymi wymogami etycznymi, w tym dotyczącymi niezależności,stosownie do MSB 220 2 oraz\n(c) ustala zrozumienie warunków zlecenia, zgodnie z wymogami zawartymi w MSB 2103.(Zob. par. A5-A7)" },
    { "ref": "300(10)", "desc": "Biegły rewident, jeśli to konieczne, aktualizuje i zmienia ogólną strategię badania i plan badania\nw trakcie trwania badania. (Zob. par. A15)" },
    { "ref": "300(12)", "desc": "Biegły rewident włącza do dokumentacji badania6\n:\n(a) ogólną strategię badania,\n(b) plan badania oraz\n(c) wszelkie znaczące zmiany ogólnej strategii badania lub planu badania, dokonane podczas\nzlecenia badania oraz powody tych zmian. (Zob. par. A18-A21)" },

    { "ref": "315(6)", "desc": "Ryzyka istotnego zniekształcenia zidentyfikowane i oszacowane przez biegłego rewidenta obejmują\nzarówno ryzyka wynikające z błędu, jak i te wynikające z oszustwa. Chociaż oba te rodzaje ryzyka\nsą przedmiotem niniejszego MSB (PL), znaczenie oszustwa jest tego typu, że w MSB 2407\nzawarto\ndalsze wymogi i wytyczne dotyczące procedur oszacowania ryzyka i związanych z nimi działań\nmających na celu uzyskanie informacji, które są wykorzystywane do identyfikacji, oszacowania\ni reagowania na ryzyka istotnego zniekształcenia wynikające z oszustwa." },
    { "ref": "315(9)", "desc": "MSB 200 stwierdza, że niektóre MSB zawierają rozważania dotyczące skalowalności, które ilustrują\nzastosowanie wymogów do wszystkich jednostek, niezależnie od tego, czy ich charakter\ni okoliczności są mniej lub bardziej złożone10\n. Niniejszy MSB (PL) jest przeznaczony do badania\nwszystkich jednostek, bez względu na ich wielkość lub złożoność, a zatem w materiałach dotyczących\nstosowania uwzględnia się, w odpowiednich przypadkach, szczególne rozważania charakterystyczne\nzarówno dla jednostek mniej, jak i bardziej złożonych. O ile wielkość jednostki może być\nwskaźnikiem jej złożoności, niektóre mniejsze jednostki mogą być złożone, a niektóre większe\njednostki mogą być mniej złożone. " },
    { "ref": "315(10)", "desc": "Niniejszy MSB (PL) stosuje się do badań sprawozdań finansowych za okresy sprawozdawcze\nrozpoczynające się 15 grudnia 2021 r. lub później.\n" },
    { "ref": "315(11)", "desc": "Celem biegłego rewidenta jest identyfikacja i oszacowanie ryzyk istotnego zniekształcenia,\nspowodowanego oszustwem lub błędem, na poziomie sprawozdania finansowego i na poziomie\nstwierdzeń, co stanowi podstawę do zaprojektowania i wdrożenia reakcji na oszacowane ryzyka\nistotnego zniekształcenia." },
    { "ref": "315(14)", "desc": "Procedury oszacowania ryzyka obejmują następujące elementy: (zob. par. A19–A21)\n(a) zapytania do kierownika jednostki oraz innych odpowiednich osób w jednostce, w tym osób\nw funkcji audytu wewnętrznego (jeżeli funkcja taka istnieje), (zob. par. A22–A26)\n(b) procedury analityczne, (zob. par. A27–A31)\n(c) obserwacja i inspekcja. (Zob. par. A32–A36)" },
    { "ref": "315(15)", "desc": "Uzyskując dowody badania zgodnie z paragrafem 13, biegły rewident bierze pod uwagę informacje\npochodzące z: (zob. par. A37‒A38)\n(a) procedur biegłego rewidenta dotyczących akceptacji lub kontynuowania relacji z klientem lub\nzlecenia badania, oraz\n(b) jeżeli ma to zastosowanie, innych zleceń wykonywanych dla jednostki przez partnera\nodpowiedzialnego za zlecenie." },
    { "ref": "315(16)", "desc": "Jeżeli biegły rewident zamierza wykorzystać informacje uzyskane ze swoich poprzednich\ndoświadczeń z jednostką i z procedur badania przeprowadzonych podczas poprzednich badań, biegły\nrewident ocenia, czy takie informacje pozostają stosowne i wiarygodne jako dowody badania dla\nbieżącego badania. (Zob. par. A39‒A41)\n" },
    { "ref": "315(17)", "desc": "Partner odpowiedzialny za zlecenie i inni kluczowi członkowie zespołu wykonującego zlecenie\nomawiają zastosowanie mających zastosowanie ramowych założeń sprawozdawczości finansowej\noraz podatność sprawozdania finansowego jednostki na istotne zniekształcenie. (Zob. par. A42–A47)" },
    { "ref": "315(18)", "desc": "Jeżeli w dyskusji w ramach zespołu wykonującego zlecenie nie uczestniczą członkowie tego zespołu,\npartner odpowiedzialny za zlecenie określa, jakie sprawy należy zakomunikować tym członkom." },
    { "ref": "315(19)", "desc": "Biegły rewident przeprowadza procedury oszacowania ryzyka w celu uzyskania zrozumienia:\n(a) następujących aspektów jednostki i jej otoczenia:\n(i) struktura organizacyjna, struktura właścicielska i zarządzanie jednostką oraz jej model\nbiznesowy, w tym zakres włączenia wykorzystania IT do modelu biznesowego, (zob. par.\nA56‒A67)\n(ii) branżowe, regulacyjne i inne czynniki zewnętrzne, (zob. par. A68‒A73), oraz\n(iii) wskaźniki wykorzystywane, wewnętrznie i zewnętrznie, do oceny wyników finansowych\njednostki, (zob. par. A74‒A81)\n(b) mających zastosowanie ramowych założeń sprawozdawczości finansowej i zasad (polityk)\nrachunkowości jednostki oraz przyczyn wszelkich zmian w tych zasadach, (zob. par. A82‒\nA84), oraz\n(c) w jaki sposób oraz w jakim stopniu czynniki ryzyka nieodłącznego wpływają na podatność\nstwierdzeń na zniekształcenia podczas sporządzania sprawozdania finansowego zgodnie\nz mającymi zastosowanie ramowymi założeniami sprawozdawczości finansowej, w oparciu\no zrozumienie uzyskane w punktach (a) i (b). (Zob. par. A85‒A89) " },
    { "ref": "315(20)", "desc": "Biegły rewident ocenia, czy zasady (polityki) rachunkowości jednostki są odpowiednie i spójne\nz mającymi zastosowanie ramowymi założeniami sprawozdawczości finansowej. " },
    { "ref": "315(21)", "desc": "" },
    { "ref": "315(22)", "desc": "" },
    { "ref": "315(23)", "desc": "" },
    { "ref": "315(24)", "desc": "" },
    { "ref": "315(25)", "desc": "" },
    { "ref": "315(27)", "desc": "Na podstawie dokonanej przez biegłego rewidenta oceny każdego z elementów systemu kontroli\nwewnętrznej jednostki, biegły rewident ustala, czy zidentyfikowano jedną lub więcej słabości\nkontroli. (Zob. par. A182–A183)" },
    { "ref": "315(28)", "desc": "Biegły rewident identyfikuje ryzyka istotnego zniekształcenia i określa, czy istnieją one: (zob. par.\nA186–A192)\n(a) na poziomie sprawozdania finansowego, (zob. par. A193–A200), lub\n(b) na poziomie stwierdzeń dla grup transakcji, sald kont i ujawnień. (Zob. par. A201)" },
    { "ref": "315(29)", "desc": "Biegły rewident określa stosowne stwierdzenia i związane z nimi znaczące grupy transakcji, salda\nkont i ujawnienia. (Zob. par. A202–A204)" },
    { "ref": "315(31)", "desc": "W przypadku zidentyfikowanych ryzyk istotnego zniekształcenia na poziomie stwierdzeń, biegły\nrewident dokonuje oszacowania ryzyka nieodłącznego poprzez ocenę prawdopodobieństwa\nwystąpienia i skali zniekształcenia. Postępując w ten sposób, biegły rewident bierze pod uwagę\nsposób i stopień, w jakim: (a) czynniki ryzyka nieodłącznego wpływają na podatność stosownych stwierdzeń na\nzniekształcenia, oraz\n(b) ryzyka istotnego zniekształcenia na poziomie sprawozdania finansowego wpływają na\noszacowanie ryzyka nieodłącznego dla ryzyk istotnego zniekształcenia na poziomie\nstwierdzeń. (Zob. par. A215‒A216)\n" },

    { "ref": "320(10)", "desc": "Ustalając ogólną strategię badania, biegły rewident wyznacza*\nistotność dla sprawozdania\nfinansowego jako całości. Jeżeli w określonych dla danej jednostki warunkach występuje jedna\nlub więcej określonych grup transakcji, sald kont lub ujawnień, których zniekształcenie w kwocie\nniższej niż istotność wyznaczona dla sprawozdania finansowego jako całości, może być\nracjonalnie uznana za wpływającą na decyzje gospodarcze użytkowników podejmowane na\npodstawie sprawozdania finansowego, to biegły rewident wyznacza również odpowiedni poziom\nlub poziomy istotności dla tych określonych grup transakcji, sald kont lub ujawnień. (Zob. par.\nA3- A12)" },
    { "ref": "320(11)", "desc": "Biegły rewident wyznacza istotność wykonawczą w celu oszacowania ryzyk istotnego\nzniekształcenia oraz ustalenia rodzaju, rozłożenia w czasie i zakresu dalszych procedur badania.\n(Zob. par. A13)" },
    { "ref": "320(12)", "desc": "Biegły rewident weryfikuje istotność dla sprawozdania finansowego jako całości (oraz, gdy ma\nto zastosowanie, poziom lub poziomy istotności dla określonych grup transakcji, sald kont lub\nujawnień), w przypadku uzyskania podczas badania informacji, które spowodowałyby\nwyznaczenie przez niego na początku innej kwoty (lub kwot). (Zob. par. A14)" },
    { "ref": "320(13)", "desc": "Jeśli biegły rewident dochodzi do wniosku, że właściwa była niższa istotność dla sprawozdania\nfinansowego jako całości (oraz gdy ma to zastosowanie, poziom lub poziomy istotności dla\nokreślonych grup transakcji, sald kont lub ujawnień) niż początkowo wyznaczono to ustala, czy\nkonieczna jest zmiana istotności wykonawczej oraz czy rodzaj, rozłożenie w czasie i zakres\ndalszych procedur badania pozostają odpowiednie." },

    { "ref": "330(6)", "desc": "Biegły rewident projektuje i przeprowadza dalsze procedury badania, których rodzaj, rozłożenie\nw czasie i zakres uwzględniają i są odpowiednie do oszacowanych ryzyk istotnego\nzniekształcenia na poziomie stwierdzenia. (Zob. par. A4-A8)" },
    { "ref": "330(7)", "desc": "Projektując dalsze procedury badania wymagające przeprowadzenia, biegły rewident:\n(a) rozważa powody uzasadniające oszacowanie danego ryzyka istotnego zniekształcenia na\npoziomie stwierdzenia dla każdej grupy transakcji, salda konta i ujawnienia, w tym:\n(i) prawdopodobieństwo istotnego zniekształcenia będącego skutkiem cech odnośnej\ngrupy transakcji, salda konta lub ujawnienia (tj. ryzyko nieodłączne) oraz\n(ii) czy oszacowanie ryzyka uwzględnia stosowne kontrole (tj. ryzyko kontroli),\na zatem, czy wymaga się od biegłego rewidenta uzyskania dowodów badania przy\nustalaniu, czy kontrole działają skutecznie (tj. biegły rewident określając rodzaj,\nrozłożenie w czasie i zakres procedur wiarygodności zamierza zaufać skuteczności\ndziałania kontroli) oraz (zob. par. A9-A18)\n(b) uzyskuje bardziej przekonujące dowody badania im wyższe jest oszacowanie ryzyka przez\nbiegłego rewidenta. (Zob. par. A19)\n" },
    { "ref": "330(28)", "desc": "Biegły rewident zamieszcza w dokumentacji badania2\n:\n(a) ogólną reakcję na oszacowane ryzyka istotnego zniekształcenia na poziomie sprawozdania\nfinansowego oraz rodzaj, rozłożenie w czasie i zakres dalszych przeprowadzonych\nprocedur badania,\n(b) powiązanie tych procedur z oszacowanymi ryzykami na poziomie stwierdzenia oraz\n(c) wyniki procedur badania, zawierających wnioski, jeżeli nie są one pod innym względem\njednoznaczne. (Zob. par. A63)" },
    { "ref": "330(A2)", "desc": "Na oszacowanie ryzyk istotnego zniekształcenia na poziomie sprawozdania finansowego, a zatem\nna ogólne reakcje biegłego rewidenta, wpływa zrozumienie przez biegłego rewidenta środowiska\nkontroli. Skuteczne środowisko kontroli może zwiększyć zaufanie biegłego rewidenta do kontroli\nwewnętrznej i wiarygodności dowodów badania tworzonych wewnątrz jednostki, z tego względu\nbiegły rewident może pozwolić sobie, na przykład, na przeprowadzenie niektórych procedur\nbadania na datę śródroczną zamiast na jego koniec. Słabości środowiska kontroli mogą mieć\njednak przeciwny skutek, na przykład, biegły rewident może zareagować na nieskuteczne\nśrodowisko kontroli przez:\n• przeprowadzenie większej liczby procedur badania na koniec okresu sprawozdawczego\na nie na datę śródroczną,\n• uzyskanie bardziej rozbudowanych dowodów badania za pomocą procedur wiarygodności,\n• zwiększenie liczby miejsc, które należy objąć zakresem badania." },
    { "ref": "330(A46)", "desc": "Ponieważ oszacowanie ryzyka istotnego zniekształcenia wiąże się z kontrolą wewnętrzną, zakres\nprocedur wiarygodności może zostać poszerzony ze względu na niezadowalające wyniki testów\nkontroli. Tym niemniej, zwiększenie zakresu procedur badania jest odpowiednie tylko wtedy, gdy\ndana procedura, jako taka, jest odpowiednia do określonego ryzyka." },
    { "ref": "330(15)", "desc": "Jeżeli biegły rewident zamierza polegać na kontrolach w obszarach, z którymi wiąże się ryzyko\noszacowane przez niego jako znaczące, to przeprowadza testy tych kontroli w bieżącym okresie." },
    { "ref": "330(21)", "desc": "Jeżeli biegły rewident stwierdził, że oszacowane ryzyko istotnego zniekształcenia na poziomie\nstwierdzenia jest znaczące, to przeprowadza procedury wiarygodności będące reakcją na to\nkonkretne ryzyko. Jeżeli reakcją na znaczące ryzyka są wyłącznie procedury wiarygodności, to\npowinny one polegać na testach szczegółowych. (Zob. par. A53)\n" },
    { "ref": "330(A53)", "desc": "Paragraf 21 niniejszego standardu wymaga od biegłego rewidenta przeprowadzenia procedur\nwiarygodności, które są konkretną reakcją na ryzyka, które biegły rewident ocenił jako znaczące.\nDowód badania w formie potwierdzeń zewnętrznych otrzymany przez biegłego rewidenta\nbezpośrednio od odpowiednich stron potwierdzających może pomóc biegłemu rewidentowi\nuzyskać dowód badania o wysokim poziomie wiarygodności, którego potrzebuje, aby zareagować\nna znaczące ryzyka istotnego zniekształcenia spowodowanego oszustwem lub błędem. Na\nprzykład, jeżeli biegły rewident zidentyfikuje, że kierownik jednostki znajduje się pod presją, aby\nsprostać oczekiwaniom co do wypracowania zysków, może istnieć ryzyko, że zawyża on wyniki\nsprzedaży, nieprawidłowo ujmując przychody dotyczące umów sprzedaży, których warunki\nwykluczają możliwość zakwalifikowania ich do przychodów lub fakturując sprzedaż przed\ndokonaniem wysyłki. W takich okolicznościach biegły rewident może, na przykład,\nzaprojektować procedury zewnętrznego potwierdzenia, które nie tylko potwierdzą kwoty\nnależności, lecz również potwierdzą szczegóły umowy sprzedaży, w tym jej datę, wszelkie prawa\nzwrotu oraz warunki dostawy. Biegły rewident może ponadto uznać za skuteczne uzupełnienie\ntakich procedur zewnętrznego potwierdzenia o zapytania skierowanie do pracowników spoza działu finansowego jednostki na temat jakichkolwiek zmian w umowach sprzedaży i warunkach\ndostaw." },
    { "ref": "330(20)", "desc": "Przeprowadzone przez biegłego rewidenta procedury wiarygodności obejmują następujące\nprocedury badania, dotyczące procesu zakończenia sprawozdania finansowego:\n(a) przyjęcia lub uzgodnienia informacji w sprawozdaniu finansowym ze stanowiącymi ich\npodstawę zapisami księgowymi, w tym przyjęcie lub uzgodnienie informacji\nw ujawnieniach, niezależnie od tego, czy takie informacje zostały uzyskane z księgi\ngłównej lub ksiąg pomocniczych oraz\n(b) sprawdzenie istotnych zapisów dziennika i innych korekt dokonanych podczas\nsporządzania sprawozdania finansowego. (Zob. par. A52)" },
    { "ref": "330(24)", "desc": "Biegły rewident przeprowadza procedury badania, aby ocenić, czy ogólna prezentacja\nsprawozdania finansowego, jest zgodna z mającymi zastosowanie ramowymi założeniami\nsprawozdawczości finansowej. Dokonując tej oceny, biegły rewident rozważa, czy sprawozdanie\nfinansowe zostało zaprezentowane w sposób odpowiednio uwzględniający:\n(a) klasyfikację i opis informacji finansowych oraz związanych z nimi transakcji, zdarzeń\ni warunków oraz\n(b) prezentację, strukturę i treść sprawozdania finansowego. (Zob. par. A59)" },
    { "ref": "330(26)", "desc": "Biegły rewident ustala, czy uzyskano wystarczające i odpowiednie dowody badania. Formułując\nopinię biegły rewident uwzględnia wszystkie odnośne dowody badania, niezależnie od tego, czy\nwydają się one potwierdzać lub zaprzeczać stwierdzeniom w sprawozdaniu finansowym. (Zob.\npar. A62)" },
    { "ref": "330(19)", "desc": "Biegły rewident ocenia, czy jako procedury wiarygodności należy przeprowadzić procedury\nzewnętrznego potwierdzenia. (Zob. par. A48-A51)" },
    { "ref": "330(22)", "desc": "Jeżeli procedury wiarygodności są przeprowadzane na datę śródroczną, to biegły rewident\nobejmuje badaniem pozostały okres:\n(a) procedurami wiarygodności łącznie z testami kontroli za okres pozostały od tego dnia lub\n(b) jedynie dalsze procedury wiarygodności, jeśli uzna to za wystarczające.\nktóre zapewniają racjonalną podstawę do rozszerzenia wniosków z badania na datę\nśródroczną, na czas do końca okresu. (Zob. par. A54-A57)" },
    { "ref": "330(30)", "desc": "Dokumentacja biegłego rewidenta powinna dowodzić, że informacje w sprawozdaniu\nfinansowym są przyjęte lub uzgodnione ze stanowiącymi ich podstawę zapisami księgowymi,\nobejmującymi także przyjęcia lub uzgodnienia ujawnień, niezależnie od tego, czy takie informacje zostały uzyskane z wewnętrznych lub zewnętrznych ksiąg głównych lub\npomocniczych." },
    { "ref": "330(26)", "desc": "Biegły rewident ustala, czy uzyskano wystarczające i odpowiednie dowody badania. Formułując\nopinię biegły rewident uwzględnia wszystkie odnośne dowody badania, niezależnie od tego, czy\nwydają się one potwierdzać lub zaprzeczać stwierdzeniom w sprawozdaniu finansowym. (Zob.\npar. A62)" },

    { "ref": "402(9)", "desc": "Uzyskując zrozumienie jednostki korzystającej z organizacji usługowej zgodnie z MSB 315 (zmienionym)3\n, biegły rewident tej jednostki uzyskuje zrozumienie*\nsposobu, w jaki jednostka ta\nkorzysta z usług organizacji usługowej w ramach swojej działalności, w tym: (zob. par. A1-A2)\n(a) charakteru usług świadczonych przez organizację usługową oraz znaczenia tych usług dla\njednostki korzystającej z organizacji usługowej, w tym wpływu tych usług na kontrolę\nwewnętrzną jednostki, (zob. par. A3-A5)\n(b) charakteru i istotności przetwarzanych transakcji lub kont, lub procesów\nsprawozdawczości finansowej, na które ma wpływ organizacja usługowa, (zob. par. A6)\n(c) stopnia wzajemnego oddziaływania pomiędzy organizacją usługową i jednostką\nkorzystającą z organizacji usługowej, (zob. par. A7)\n(d) rodzaju powiązania pomiędzy jednostką korzystającą z organizacji usługowej a organizacją\nusługową, w tym istotnych warunków umownych dotyczących działań podejmowanych\nprzez organizację usługową. (Zob. par. A8-A11)" },
    { "ref": "402(10)", "desc": "Uzyskując zrozumienie kontroli wewnętrznej mającej znaczenie dla badania zgodnie z MSB 315\n(zmienionym)4\n, biegły rewident jednostki korzystającej z organizacji usługowej dokonuje oceny\nmodelu i wdrożenia odpowiednich kontroli w jednostce korzystającej z organizacji usługowej,\nktóre odnoszą się do usług świadczonych przez organizację usługową, w tym kontroli\nstosowanych w odniesieniu do transakcji przetwarzanych przez organizację usługową. (Zob. par.\nA12- A14)" },
    { "ref": "402(11)", "desc": "Biegły rewident jednostki korzystającej z organizacji usługowej określa, czy w wystarczającym\nstopniu zrozumiał rodzaj i znaczenie ważnych dla badania usług świadczonych przez organizację\nusługową oraz ich wpływ na mającą znaczenie dla badania kontrolę wewnętrzną jednostki\nkorzystającej z organizacji usługowej, co będzie stanowić podstawę dla zidentyfikowania\ni oszacowania ryzyk istotnego zniekształcenia." },
    { "ref": "402(12)", "desc": "Jeśli biegły rewident jednostki korzystającej z organizacji usługowej nie jest w stanie uzyskać\nwystarczającego zrozumienia bezpośrednio w jednostce korzystającej z organizacji usługowej,\nuzyskuje ich zrozumienie przez zastosowanie jednej lub kilku z następujących procedur:\n(a) uzyskanie raportu typu 1 lub 2, jeśli są dostępne,\n(b) kontakt z organizacją usługową za pośrednictwem jednostki korzystającej z usług\norganizacji usługowej w celu uzyskania określonych informacji,\n(c) wizyta w organizacji usługowej i przeprowadzenie procedur, które dostarczą koniecznych\ninformacji o stosownych kontrolach tej organizacji,\n(d) korzystanie z pomocy innego biegłego rewidenta do przeprowadzenia procedur, które\ndostarczą koniecznych informacji o stosownych kontrolach w organizacji usługowej. (Zob.\npar. A15-A 20)\n" },

    { "ref": "450(14)", "desc": "Biegły rewident zwraca się do kierownika jednostki oraz, jeśli to odpowiednie, do osób\nsprawujących nadzór, o złożenie pisemnego oświadczenia czy ich zdaniem wpływ\nnieskorygowanych zniekształceń, pojedynczo i łącznie, na sprawozdanie finansowe jako całość\nnie jest istotny. Opis takich zniekształceń zamieszcza się w lub dołącza do pisemnego\noświadczenia. (Zob. par A29)" },
    { "ref": "450(12)", "desc": "Biegły rewident informuje osoby sprawujące nadzór o nieskorygowanych zniekształceniach oraz\no ich wpływie, pojedynczo lub łącznie, jaki mogą mieć na opinię w sprawozdaniu biegłego\nrewidenta, chyba że nie pozwalają na to przepisy prawa lub regulacja\n4\n. Informacja przekazywana\nprzez biegłego rewidenta wskazuje na poszczególne istotne nieskorygowane zniekształcenia.\nBiegły rewident zwraca się o skorygowanie zniekształceń, które nie zostały skorygowane.\n(Zob. par. A26-A28)" },
    { "ref": "450(13)", "desc": "Biegły rewident informuje również osoby sprawujące nadzór o wpływie nieskorygowanych\nzniekształceń z poprzednich okresów sprawozdawczych na odnośne grupy transakcji, salda kont\nlub ujawnienia i sprawozdanie finansowe jako całość." },

    { "ref": "500(6)", "desc": "Biegły rewident projektuje*\ni przeprowadza procedury badania, które są odpowiednie\nw danych okolicznościach w celu uzyskania wystarczających i odpowiednich dowodów\nbadania. (Zob. par. A1-A25)\n" },
    { "ref": "500(8)", "desc": "Jeżeli informacje, które będą wykorzystane jako dowody badania zostały przygotowane\nz wykorzystaniem pracy eksperta kierownictwa, biegły rewident, uwzględniając znaczenie\npracy eksperta dla celów biegłego rewidenta: (zob. par. A34-A36)\n(a) ocenia kompetencje, umiejętności i obiektywizm eksperta, (zob. par. A37-A43)\n(b) uzyskuje zrozumienie pracy eksperta, oraz (zob. par. A44-A47)\n(c) ocenia odpowiedniość pracy eksperta jako dowodu badania dla danego stwierdzenia.\n(Zob. par. A48)" },
    { "ref": "500(9)", "desc": "Wykorzystując informacje przygotowane przez jednostkę, biegły rewident ocenia, czy\ninformacje te są wystarczająco wiarygodne dla celów biegłego rewidenta, w tym, jeśli jest to\nkonieczne w danych okolicznościach:\n(a) uzyskując dowody badania dotyczące dokładności i kompletności tych informacji, oraz\n(zob. par. A49-A50)\n(b) dokonując oceny czy informacje te są wystarczająco precyzyjne i szczegółowe dla\ncelów biegłego rewidenta. (Zob. par. A51)\n" },

    { "ref": "501(4)", "desc": "Jeżeli zapasy są istotne dla sprawozdania finansowego, biegły rewident uzyskuje*\nwystarczające i odpowiednie dowody badania dotyczące istnienia i stanu zapasów poprzez:\n(a) obecność podczas spisu z natury, chyba że jest to niewykonalne, w celu: (zob. par.\nA1-A3)\n(i) oceny instrukcji i procedur kierownictwa dotyczących rejestrowania\ni kontrolowania wyników spisu z natury jednostki, (zob. par. A4),\n(ii) obserwacji wykonywania określonych przez kierownictwo procedur liczenia,\n(zob. par. A5)\n(iii) inspekcji zapasów i (zob. par. A6)\n(iv) wykonania kontrolnych przeliczeń, oraz (zob. par. A7-A8)\n(b) przeprowadzenie procedur badania w odniesieniu do ostatecznego wykazu zapasów,\nw celu ustalenia czy odzwierciedla on dokładnie rzeczywiste wyniki spisu z natury." },
    { "ref": "501(5)", "desc": "Jeżeli spis z natury jest przeprowadzany w dacie innej niż data sprawozdania finansowego,\nbiegły rewident, oprócz procedur wymaganych przez paragraf 4, przeprowadza procedury\nbadania w celu uzyskania dowodów badania na temat tego czy zmiany stanu zapasów\npomiędzy datą spisu z natury i datą sprawozdania finansowego zostały ujęte właściwie. (Zob.\npar. A9-A11)" },
    { "ref": "501(6)", "desc": "Jeżeli z powodu nieprzewidzianych okoliczności biegły rewident nie może być obecny\npodczas spisu z natury zapasów, biegły rewident wykonuje lub obserwuje spis z natury\nw innym terminie, oraz przeprowadza procedury badania w odniesieniu do transakcji, które\nnastąpiły w międzyczasie.\n" },
    { "ref": "501(7)", "desc": "Jeżeli obecność podczas spisu z natury zapasów jest niewykonalna, biegły rewident\nprzeprowadza alternatywne procedury badania w celu uzyskania wystarczających\ni odpowiednich dowodów badania dotyczących istnienia i stanu zapasów. Jeżeli nie jest to\nmożliwe, biegły rewident modyfikuje opinię w sprawozdaniu biegłego rewidenta zgodnie\nz MSB 705 (zmienionym).\n3\n(Zob. par. A12-A14)" },
    { "ref": "501(8)", "desc": "Jeżeli zapasy powierzone opiece i kontroli strony trzeciej są istotne dla sprawozdania\nfinansowego, biegły rewident uzyskuje wystarczające i odpowiednie dowody badania\ndotyczące istnienia i stanu zapasów w drodze wykonania jednej lub obydwu poniższych\nczynności:\n(a) prośba o potwierdzenie przez stronę trzecią ilości i stanu zapasów posiadanych\nw imieniu jednostki, (zob. par. A15)\n(b) przeprowadzenie inspekcji lub innych procedur badania odpowiednich w danych\nokolicznościach. (Zob. par. A16)" },
    { "ref": "501(12)", "desc": "Biegły rewident kieruje do kierownictwa oraz gdzie to odpowiednie, do osób sprawujących\nnadzór prośbę o złożenie pisemnych oświadczeń potwierdzających, że wszystkie znane im\nfaktyczne lub możliwe spory prawne i roszczenia, których skutki powinny być rozważone\npodczas sporządzania sprawozdania finansowego, zostały ujawnione biegłemu rewidentowi\noraz ujęte i ujawnione zgodnie z mającymi zastosowanie ramowymi założeniami\nsprawozdawczości finansowej.\n" },

    { "ref": "505(7)", "desc": "Stosując procedury potwierdzeń zewnętrznych, biegły rewident sprawuje* kontrolę nad\nprośbami o potwierdzenia zewnętrzne, uwzględniając:\n(a) określenie informacji, które mają być potwierdzone lub uzyskane, (zob. par. A1)\n(b) wybór odpowiedniej strony potwierdzającej, (zob. par. A2)\n(c) zaprojektowanie próśb o potwierdzenie, obejmujące ustalenie czy prośby są\nodpowiednio zaadresowane i zawierają informację zwrotną dla odpowiedzi, które mają\nzostać przesyłane bezpośrednio do biegłego rewidenta, oraz (zob. par. A3-A6)\n(d) wysyłanie próśb, w tym ponownych próśb, gdy ma to zastosowanie, do strony\npotwierdzającej. (Zob. par. A7)" },
    { "ref": "505(9)", "desc": "Jeżeli biegły rewident stwierdza, że odmowa wyrażenia przez kierownika jednostki biegłemu\nrewidentowi zgody na wysłanie prośby o potwierdzenie zewnętrzne jest nieracjonalna lub że\nbiegły rewident nie jest w stanie uzyskać odpowiednich i wiarygodnych dowodów badania\nz alternatywnych procedur badania, biegły rewident komunikuje się z osobami sprawującymi\nnadzór zgodnie z MSB 260 (zmienionym)12\n. Biegły rewident określa również skutki dla\nbadania i opinii biegłego rewidenta zgodnie z MSB 705 (zmienionym)13\n." },
    { "ref": "505(10)", "desc": "Jeżeli biegły rewident identyfikuje czynniki, które wzbudzają wątpliwości co do\nwiarygodności odpowiedzi na prośbę o potwierdzenie, biegły rewident uzyskuje dalsze\ndowody badania, aby rozwiać te wątpliwości. (Zob. par. A11-A16)" },
    { "ref": "505(11)", "desc": "Jeżeli biegły rewident ustala, że odpowiedź na prośbę o potwierdzenie nie jest wiarygodna,\nwówczas ocenia wpływ tego faktu na oszacowanie znaczących ryzyk istotnego\nzniekształcenia, włączając ryzyko oszustwa, oraz na rodzaj, rozłożenie w czasie i zakres\ninnych procedur badania. (Zob. par. A17)" },
    { "ref": "505(12)", "desc": "W przypadku braku odpowiedzi, biegły rewident przeprowadza alternatywne procedury\nbadania w celu uzyskania odpowiednich i wiarygodnych dowodów badania. (Zob. par. A18-\nA19)" },

    { "ref": "510(3)", "desc": "Podczas wykonywania zlecenia badania po raz pierwszy, celem biegłego rewidenta\nw odniesieniu do stanów początkowych jest uzyskanie wystarczających i odpowiednich\ndowodów badania na temat tego, czy:\n(a) stany początkowe zawierają zniekształcenia, które istotnie wpływają na sprawozdanie\nfinansowe za bieżący okres sprawozdawczy; oraz\n(b) odpowiednie zasady (polityka) rachunkowości odzwierciedlone w stanach\npoczątkowych zostały spójnie zastosowane przy sporządzaniu sprawozdania\nfinansowego za bieżący okres sprawozdawczy lub czy zmiany, których w nich\ndokonano są prawidłowo rozliczone i odpowiednio zaprezentowane zgodnie\nz mającymi zastosowanie ramowymi założeniami sprawozdawczości finansowej." },
    { "ref": "510(5)", "desc": "Biegły rewident zapoznaje* się z najbardziej aktualnym sprawozdaniem finansowym, o ile\nistnieje, oraz ze sprawozdaniem poprzedniego biegłego rewidenta na jego temat, o ile zostało\nsporządzone, pod kątem informacji mających znaczenie dla stanów początkowych, w tym\nujawnień." },
    { "ref": "510(6)", "desc": "Biegły rewident uzyskuje wystarczające i odpowiednie dowody badania na temat tego, czy\nstany początkowe zawierają zniekształcenia, które istotnie wpływają na sprawozdanie\nfinansowe za bieżący okres sprawozdawczy, poprzez: (zob. par. A1-A2)\n(a) ustalenie czy stany końcowe z poprzedniego okresu sprawozdawczego zostały\nprawidłowo przeniesione do ksiąg rachunkowych bieżącego okresu sprawozdawczego\nlub, gdy to odpowiednie, czy zostały przekształcone,\n(b) ustalenie czy stany początkowe odzwierciedlają zastosowanie odpowiednich zasad\n(polityki) rachunkowości, oraz\n(c) przeprowadzenie jednego lub kilku z poniższych działań: (zob. par. A3-A7)\n(i) jeżeli sprawozdanie finansowe za poprzedni rok obrotowy zostało zbadane,\nprzegląd dokumentów roboczych poprzedniego biegłego rewidenta celem\nuzyskania dowodów badania dotyczących stanów początkowych,\n(ii) ocenę czy procedury badania przeprowadzone w bieżącym okresie\nsprawozdawczym dostarczają dowodów mających znaczenie dla stanów\npoczątkowych, lub\n(iii) wykonanie specyficznych procedur badania w celu uzyskania dowodów\ndotyczących stanów początkowych.\n" },
    { "ref": "510(7)", "desc": "Jeśli biegły rewident uzyskuje dowody badania, że stany początkowe zawierają\nzniekształcenia, które mogłyby istotnie wpływać na sprawozdanie finansowe za bieżący\nokres sprawozdawczy, biegły rewident przeprowadza dodatkowe procedury badania,\nodpowiednie w danych okolicznościach, w celu ustalenia wpływu tych zniekształceń na\nsprawozdanie finansowe za bieżący okres sprawozdawczy. Jeżeli biegły rewident stwierdza,\nże takie zniekształcenia istnieją w sprawozdaniu finansowym za bieżący okres\nsprawozdawczy, biegły rewident informuje o nich odpowiedni szczebel kierownictwa oraz\nosoby sprawujące nadzór zgodnie z MSB 4503\n.\n" },
    { "ref": "510(8)", "desc": "Biegły rewident uzyskuje wystarczające i odpowiednie dowody badania na temat tego, czy\nzasady (polityka) rachunkowości odzwierciedlone w stanach początkowych były spójnie\nstosowane podczas sporządzania sprawozdania finansowego za bieżący okres\nsprawozdawczy, a jeśli nastąpiły zmiany w zasadach (polityce) rachunkowości to czy zostały\none odpowiednio rozliczone, adekwatnie zaprezentowane i ujawnione zgodnie z mającymi\nzastosowanie ramowymi założeniami sprawozdawczości finansowej." },
    { "ref": "510(9)", "desc": "Jeżeli sprawozdanie finansowe za poprzedni okres sprawozdawczy było badane przez\npoprzedniego biegłego rewidenta, a opinia została zmodyfikowana, obecny biegły rewident\nocenia skutek sprawy będącej powodem modyfikacji przy szacowaniu ryzyka istotnego\nzniekształcenia sprawozdania finansowego za bieżący okres sprawozdawczy zgodnie z MSB\n315 (zmienionym)4\n" },

    { "ref": "520(5)", "desc": "Przy projektowaniu i przeprowadzaniu analitycznych procedur wiarygodności, samych czy\nw połączeniu z testami szczegółowymi, jako procedur wiarygodności zgodnie z MSB 3303\n,\nbiegły rewident: (zob. par. A4-A5)\n(a) ustala* odpowiedniość określonej analitycznej procedury wiarygodności dla danych stwierdzeń, biorąc pod uwagę oszacowane ryzyka istotnego zniekształcenia oraz, o ile\nwystępują, testy szczegółowe dla tych stwierdzeń, (zob. par. A6-A11)\n(b) ocenia wiarygodność danych, na podstawie których formułuje oczekiwanie co do\nzaewidencjonowanych kwot lub wskaźników biorąc pod uwagę źródło,\nporównywalność oraz rodzaj i odpowiedniość dostępnych informacji oraz kontrole\nw trakcie ich przygotowania, (zob. par. A12-A14)\n(c) formułuje oczekiwanie co do zaewidencjonowanych kwot lub wskaźników i ocenia,\nczy oczekiwanie to jest wystarczająco precyzyjne dla zidentyfikowania\nzniekształcenia, które, pojedynczo lub łącznie z innymi zniekształceniami, może\nspowodować istotne zniekształcenie sprawozdania finansowego, oraz (zob. par. A15)\n(d) ustala kwotę każdej różnicy pomiędzy zaewidencjonowanymi a oczekiwanymi\nkwotami, która jest akceptowalna bez dalszej analizy wymaganej przez paragraf 7.\n(Zob. par. A16)" },
    { "ref": "520(6)", "desc": "Biegły rewident projektuje i przeprowadza blisko końca badania procedury analityczne, które\numożliwiają mu sformułowanie ogólnego wniosku na temat tego, czy sprawozdanie\nfinansowe jest spójne ze zrozumieniem jednostki przez biegłego rewidenta, (Zob. par. A17-\nA19)" },
    { "ref": "520(7)", "desc": "Jeżeli procedury analityczne przeprowadzone zgodnie z niniejszym MSB prowadzą do\nrozpoznania odchyleń lub zależności, które są niespójne z innymi odpowiednimi\ninformacjami lub różnią się znacząco od oczekiwanych wielkości, biegły rewident analizuje\nte różnice poprzez:\n(a) skierowanie zapytań do kierownictwa oraz uzyskanie odpowiednich dowodów badania\nmających znaczenie dla odpowiedzi kierownictwa, oraz\n(b) przeprowadzenie innych procedur badania, niezbędnych w danych okolicznościach.\n(Zob. par. A20- A21)" },

    { "ref": "530(6)", "desc": "Podczas projektowania próbki do badania biegły rewident rozważa*\ncel procedury badania oraz\ncechy populacji z której dana próbka zostanie wylosowana. (Zob. par. A4-A9)" },
    { "ref": "530(7)", "desc": "Biegły rewident określa wielkość próbki wystarczającą do obniżenia ryzyka próbkowania do\nakceptowalnie niskiego poziomu. (Zob. par. A10-A11)" },
    { "ref": "530(8)", "desc": "Biegły rewident wybiera pozycje do próbki w taki sposób, że każda jednostka w populacji ma\nszansę wyboru. (Zob. par. A12 -A13)" },

    { "ref": "540(8)", "desc": "Wpływ na stosowanie zawodowego osądu w odniesieniu do szacunków księgowych ma\nrozważenie przez biegłego rewidenta czynników ryzyka nieodłącznego, a jego znaczenie wzrasta,\ngdy szacunki księgowe w większym stopniu są narażone na niepewność szacowania lub wpływa\nna nie złożoność, subiektywizm albo inne czynniki ryzyka nieodłącznego. Stosowanie\nzawodowego osądu jest ponadto ważne, gdy występuje większa podatność na zniekształcenie na\nskutek stronniczości kierownictwa lub oszustwa. (Zob. par. A11)\n" },
    { "ref": "540(9)", "desc": "Niniejszy MSB wymaga, aby biegły rewident ocenił, w oparciu o wykonane procedury badania\ni uzyskane dowody badania czy szacunki księgowe i powiązane ujawnienia są racjonalne7\nw kontekście mających zastosowanie ramowych założeń sprawozdawczości finansowej, czy też\nsą zniekształcone. Dla potrzeb niniejszego MSB, racjonalne w kontekście mających zastosowanie\nramowych założeń sprawozdawczości finansowej oznacza, że odpowiednie wymogi mających\nzastosowanie ramowych założeń sprawozdawczości finansowej zostały zastosowane prawidłowo, z uwzględnieniem tych wymogów, które odnoszą się do: (zob. par. A12-A13, A139-\nA144)\n• ustalania szacunku księgowego, w tym wyboru metody, założeń oraz danych mając na\nuwadze rodzaj szacunku księgowego oraz fakty i okoliczności dotyczące danej jednostki,\n• wyboru szacunku punktowego kierownictwa, oraz\n• ujawnień odnoszących się do szacunku księgowego, w tym ujawnień dotyczących procesu\nustalania szacunku księgowego i objaśnienia rodzaju, zakresu i źródeł niepewności\nszacowania.\n" },
    { "ref": "540(10)", "desc": "Niniejszy MSB stosuje się do badań sprawozdań finansowych za okresy sprawozdawcze\nrozpoczynające się 15 grudnia 2019 r. i później." },
    { "ref": "540(11)", "desc": "Celem biegłego rewidenta jest uzyskanie wystarczających i odpowiednich dowodów badania na\ntemat tego, czy szacunki księgowe i powiązane ujawnienia w sprawozdaniu finansowym są\nracjonalne w kontekście mających zastosowanie ramowych założeń sprawozdawczości\nfinansowej." },
    { "ref": "540(12)", "desc": "Dla celów MSB poniższe pojęcia mają znaczenia przypisane poniżej:\n(a) Szacunek księgowy – kwota pieniężna, której pomiar, zgodnie z mającymi zastosowanie\nramowymi założeniami sprawozdawczości finansowej, podlega niepewności oszacowania.\n(Zob. par. A14)\n(b) Szacunek punktowy biegłego rewidenta lub przedział biegłego rewidenta – odpowiednio\nkwota lub przedział kwot, ustalone przez biegłego rewidenta podczas oceny szacunku\npunktowego kierownictwa. (Zob. par. A15)\n(c) Niepewność szacowania – podatność na nieodłączny brak precyzji w pomiarze. (Zob. par.\nA16, Załącznik 1)\n(d) Stronniczość kierownictwa – brak neutralności kierownictwa przy sporządzaniu\ninformacji. (Zob. par. A17)\n(e) Szacunek punktowy kierownictwa – kwota wybrana przez kierownictwo do ujęcia lub\nujawnienia w sprawozdaniu finansowym jako szacunek księgowy.\n(f) Wynik szacunku księgowego – rzeczywista kwota pieniężna będąca wynikiem wystąpienia\ntransakcji, zdarzenia(-eń) lub warunku(-ów), do których odnosił się szacunek księgowy.\n(Zob. par. A18)" },
    { "ref": "540(13)", "desc": "Podczas uzyskiwania zrozumienia jednostki i jej otoczenia, w tym jej kontroli wewnętrznej\nzgodnie z wymogami MSB 315 (zmienionego)8\n, biegły rewident uzyskuje*\nzrozumienie\nponiższych kwestii odnoszących się do szacunków księgowych jednostki. Procedury biegłego\nrewidenta prowadzące do uzyskania tego zrozumienia powinny zostać przeprowadzone\nw zakresie niezbędnym do zapewnienia odpowiedniej podstawy dla identyfikacji i oszacowania\nryzyk istotnego zniekształcenia zarówno na poziomie sprawozdania finansowego jak i na\npoziomie stwierdzeń. (Zob. par. A19-A22)\nJednostka i jej otoczenie\n(a) transakcje jednostki oraz inne zdarzenia i uwarunkowania, które mogą skutkować potrzebą\nujęcia lub ujawnienia, albo zmiany szacunków księgowych w sprawozdaniu finansowym,\n(zob. par. A23)\n(b) wymogi mających zastosowanie ramowych założeń sprawozdawczości finansowej\ndotyczące szacunków księgowych (w tym kryteria ujęcia, podstawy pomiaru, oraz\npowiązane wymogi odnoszące się do ujawnień i prezentacji), a także sposób, w jaki są one\nstosowane w kontekście rodzaju i okoliczności dotyczących jednostki i jej otoczenia,\nw tym w jaki sposób transakcje i inne zdarzenia lub okoliczności są podatne na czynniki\nryzyka nieodłącznego lub wpływają na nie, (zob. par. A24-A25)\n(c) czynniki regulacyjne odnoszące się do szacunków księgowych jednostki, a tam, gdy ma to\nzastosowanie, ramowe założenia regulacyjne związane z nadzorem ostrożnościowym,\n(zob. par. A26)\n(d) rodzaj szacunków księgowych i powiązanych ujawnień, których uwzględnienia\nw sprawozdaniu finansowym jednostki oczekuje biegły rewident na podstawie\nzrozumienia przez niego kwestii z par. 13(a)-(c) powyżej. (Zob. par. A27)\nKontrola wewnętrzna jednostki\n(e) rodzaj i zakres nadzoru oraz ładu korporacyjnego, jaki występuje w jednostce w zakresie\nprocesu sprawozdawczości finansowej kierownictwa w odniesieniu do szacunków\nksięgowych, (zob. par. A28-A30)\n(f) w jaki sposób kierownictwo identyfikuje potrzebę oraz stosuje specjalistyczną wiedzę\ni doświadczenie w zakresie szacunków księgowych, w tym w odniesieniu do\nwykorzystania eksperta kierownictwa, (zob. par. A31)\n(g) w jaki sposób proces szacowania ryzyka przez jednostkę identyfikuje i reaguje na ryzyka\nodnoszące się do szacunków księgowych, (zob. par. A32-A33)\n(h) system informacyjny jednostki w zakresie, w jakim odnosi się do szacunków księgowych,\nw tym: i. grup transakcji, zdarzeń i uwarunkowań, które są znaczące dla sprawozdania\nfinansowego i mogą skutkować potrzebą ujęcia szacunków księgowych\ni powiązanych ujawnień lub ich zmianą, (zob. par. A34-A35)\nii. w jaki sposób, dla takich szacunków księgowych i powiązanych ujawnień,\nkierownictwo:\na. identyfikuje właściwe metody, założenia lub źródła danych oraz potrzebę\ndokonania w nich zmian, które są odpowiednie w kontekście mających\nzastosowanie ramowych założeń sprawozdawczości finansowej, w tym,\nw jaki sposób kierownictwo: (zob. par. A36-A37)\ni. wybiera lub projektuje, oraz stosuje wykorzystywane metody, w tym\nwykorzystywanie modeli, (zob. par. A38-A39)\nii. wybiera założenia, które zostaną wykorzystane, uwzględniając\nrozważenie alternatywnych rozwiązań oraz identyfikuje znaczące\nzałożenia, oraz (zob. par. A40-A43)\niii. wybiera dane do zastosowania, (zob. par. A44)\nb. rozumie stopnień niepewności szacowania, w tym poprzez rozważenie\nzakresu możliwych wyników pomiaru, oraz (zob. par. A45)\nc. odnosi się do niepewności oszacowania, w tym wybierając szacunek\npunktowy oraz powiązane ujawnienia, w celu ich ujęcia w sprawozdaniu\nfinansowym, (zob. par. A46-A49)\n(i) mające znaczenie dla badania czynności kontrolne nad procesem ustalania szacunków\nksięgowych przez kierownictwo, jak opisano to w paragrafie 13(h)(ii), (zob. par. A50-A54)\n(j) w jaki sposób kierownictwo dokonuje przeglądu wyniku(-ów) wcześniejszych szacunków\nksięgowych i odnosi się do rezultatów tego przeglądu. " },
    { "ref": "540(14)", "desc": "Biegły rewident dokonuje przeglądu wyników wcześniejszych szacunków księgowych, lub gdy\nma to zastosowanie, ich późniejszych ponownych ustaleń, w celu ułatwienia identyfikacji\ni oszacowania ryzyk istotnego zniekształcenia w bieżącym okresie sprawozdawczym. Określając\nrodzaj i zakres tego przeglądu biegły rewident bierze pod uwagę charakterystykę szacunków\nksięgowych. Przegląd ten nie ma na celu podważenia ocen szacunków księgowych dokonanych\nw poprzednich okresach sprawozdawczych, które były prawidłowo oparte na informacjach\ndostępnych w chwili ich dokonywania. (Zob. par. A55–A60)" },
    { "ref": "540(15)", "desc": "W odniesieniu do szacunków księgowych biegły rewident określa, czy zespół wykonujący\nzlecenie posiada specjalistyczne umiejętności lub wiedzę do wykonania procedur oszacowania\nryzyka, identyfikacji i oszacowania ryzyk istotnego zniekształcenia, zaprojektowania\ni wykonania procedur badania stanowiących reakcję na te ryzyka, lub oceny uzyskanych\ndowodów badania. (Zob. par. A61–A63)\n" },
    { "ref": "540(16)", "desc": "W trakcie identyfikacji i oszacowania ryzyk istotnego zniekształcenia odnoszących się do\nszacunków księgowych i powiązanych ujawnień na poziomie stwierdzeń, jak jest to wymagane\nprzez MSB 315 (zmieniony)\n9\n, biegły rewident szacuje odrębnie ryzyko nieodłączne i ryzyko kontroli. Podczas identyfikacji ryzyk istotnego zniekształcenia i szacowania ryzyka\nnieodłącznego, biegły rewident bierze pod uwagę następujące zagadnienia: (zob. par. A64–A71)\n(a) stopień, w jakim szacunek księgowy jest narażony na niepewność szacowania, oraz (zob.\npar. A62–A75)\n(b) stopień, w jakim na poniższe ma wpływ niepewność szacowania, złożoność, subiektywizm\nlub inne czynniki ryzyka nieodłącznego: (zob. par. A76–A79)\n(i) wybór i zastosowanie metod, założeń i danych podczas ustalania szacunku\nksięgowego, oraz\n(ii) wybór szacunku punktowego kierownictwa i powiązanych ujawnień do włączenia\ndo sprawozdania finansowego. " },
    { "ref": "540(17)", "desc": "Biegły rewident ustala, czy którekolwiek z ryzyk istotnego zniekształcenia zidentyfikowanych\ni oszacowanych zgodnie z par. 16 są, według jego osądu, ryzykami znaczącymi10\n. Jeżeli biegły\nrewident określił, że istnieje znaczące ryzyko, uzyskuje zrozumienie kontroli jednostki, w tym\nczynności kontrolnych dotyczących tego ryzyka11\n. (Zob. par. A80)" },
    { "ref": "540(18)", "desc": "Zgodnie z wymogami MSB 33012\n, dalsze procedury badania biegłego rewidenta powinny\nstanowić reakcję na oszacowane ryzyka istotnego zniekształcenia na poziomie stwierdzeń13\n,\nz uwzględnieniem przyczyn oszacowania tych ryzyk. Dalsze procedury badania a powinny\nuwzględniać jedno lub więcej z poniższych podejść:\n(a) uzyskiwanie dowodów badania ze zdarzeń, jakie mają miejsce do dnia sprawozdania\nbiegłego rewidenta, (zob. paragraf 21)\n(b) sprawdzenie, w jaki sposób kierownictwo ustala szacunki księgowe, (zob. paragrafy 22-\n27)\n(c) ustalenie szacunku punktowego lub przedziału biegłego rewidenta. (Zob. paragrafy 28-29)\nDalsze procedury badania biegłego rewidenta powinny uwzględniać fakt, że im wyżej\noszacowane jest ryzyko istotnego zniekształcenia, tym bardziej przekonujące muszą być dowody\nbadania14\n. Biegły rewident projektuje i wykonuje dalsze procedury badania w sposób, który nie\njest ukierunkowany na uzyskanie dowodów badania potwierdzających ustalenia lub wykluczenie\ndowodów badania przeczących ustaleniom. (Zob. par. A81-A84)" },
    { "ref": "540(19)", "desc": "Zgodnie z wymogami MSB 33015 biegły rewident projektuje i wykonuje testy w celu uzyskania\nwystarczających i odpowiednich dowodów badania na temat operacyjnej skuteczności\nstosownych kontroli, jeżeli:\n (a) oszacowanie ryzyk istotnego zniekształcenia na poziomie stwierdzeń dokonane przez\nbiegłego rewidenta obejmuje oczekiwanie, że te kontrole działają skutecznie, lub\n(b) same procedury wiarygodności nie dostarczą wystarczających i odpowiednich dowodów\nbadania na poziomie stwierdzeń.\nW odniesieniu do szacunków księgowych, testy kontroli wykonywane przez biegłego rewidenta\nstanowią reakcję na oszacowanie przypisane ryzykom istotnego zniekształcenia. Projektując\ni wykonując testy kontroli biegły rewident uzyskuje tym bardziej przekonujące dowody badania,\nim bardziej polega na skuteczności danej kontroli16\n. (Zob. par. A85-A89)" },
    { "ref": "540(20)", "desc": "W przypadku znaczącego ryzyka dotyczącego szacunku księgowego, dalsze procedury badania\nbiegłego rewidenta obejmują testy kontroli w bieżącym okresie sprawozdawczym, jeżeli biegły\nrewident planuje polegać na tych kontrolach. Gdy podejście do znaczącego ryzyka obejmuje\nwyłącznie procedury wiarygodności, procedury te obejmują testy szczegółowe17\n. (Zob. par. A90)" },
    { "ref": "540(21)", "desc": "Gdy dalsze procedury badania zakładają uzyskanie dowodów badania ze zdarzeń następujących\ndo daty sprawozdania biegłego rewidenta, biegły rewident ocenia, czy takie dowody badania są\nwystarczające i odpowiednie, aby odnieść się do ryzyk istotnego zniekształcenia dotyczącego\nszacunków księgowych, mając na uwadze, że zmiany w okolicznościach i innych znaczących\nwarunkach pomiędzy zdarzeniem a datą pomiaru mogą mieć wpływ na przydatność takich\ndowodów badania w kontekście mających zastosowanie ramowych założeń sprawozdawczości\nfinansowej. (Zob. par. A91-A93)\n" },
    { "ref": "540(22)", "desc": "Podczas badania sposobu, w jaki kierownictwo ustala szacunki księgowe, dalsze procedury\nbadania obejmują procedury zaprojektowane i wykonywane zgodnie z paragrafami 23-26, w celu\nuzyskania wystarczających i odpowiednich dowodów badania dotyczących ryzyk istotnego\nzniekształcenia odnoszących się do: (zob. par. A94)\n(a) wyboru i zastosowania metod, znaczących założeń oraz danych wykorzystanych przez\nkierownictwo podczas ustalania szacunku księgowego, oraz\n(b) sposobu, w jaki kierownictwo dokonało wyboru szacunku punktowego i przedstawiło\npowiązane ujawnienia dotyczące niepewności szacowania." },

    { "ref": "550(3)", "desc": "Ze względu na fakt, że strony powiązane nie są od siebie niezależne, wiele ramowych\nzałożeń sprawozdawczości finansowej ustanawia specyficzne wymogi dotyczące ujęcia\nksięgowego i ujawniania powiązań, transakcji i sald ze stronami powiązanymi, aby\numożliwić użytkownikom sprawozdania finansowego zrozumienie ich charakteru\ni faktycznego lub potencjalnego wpływu na sprawozdanie finansowe. Tam, gdzie mające\nzastosowanie ramowe założenia sprawozdawczości finansowej ustanawiają takie wymogi,\nbiegły rewident ponosi odpowiedzialność za przeprowadzenie procedur badania służących\nidentyfikacji, oszacowaniu i reakcji na ryzyka istotnego zniekształcenia wynikające\nz niezdolności jednostki do odpowiedniego rozliczenia lub ujawnienia powiązań, transakcji\nlub sald ze stronami powiązanymi zgodnie z wymogami ramowych założeń." },
    { "ref": "550(4)", "desc": "Nawet jeżeli mające zastosowanie ramowe założenia sprawozdawczości finansowej\nustanawiają minimalne lub nie ustanawiają żadnych wymogów dotyczących stron\npowiązanych, biegły rewident potrzebuje uzyskać zrozumienie powiązań i transakcji\njednostki ze stronami powiązanymi wystarczające do tego, aby móc stwierdzić, czy sprawozdanie finansowe w zakresie, w jakim wpływają na nie te powiązania i transakcje:\n(zob. par. A1)\n(a) zapewnia rzetelną prezentację (dla ramowych założeń rzetelnej prezentacji), lub (zob.\npar A2)\n(b) nie wprowadza w błąd (dla ramowych założeń zgodności). (Zob. par. A3)" },
    { "ref": "550(5)", "desc": "Zrozumienie powiązań i transakcji jednostki ze stronami powiązanymi jest ponadto\nprzydatne przy ocenie przez biegłego rewidenta występowania jednego lub więcej\nczynników ryzyka oszustwa zgodnie z wymogami MSB 2404\n, ponieważ oszustwo może być\nłatwiej popełnione poprzez strony powiązane." },
    { "ref": "550(6)", "desc": "Ze względu na nieodłączne ograniczenia badania, występuje nieuniknione ryzyko, że\nniektóre istotne zniekształcenia sprawozdania finansowego mogą nie zostać wykryte,\npomimo że badanie zostało odpowiednio zaplanowane i przeprowadzone zgodnie z MSB5\n.\nW kontekście stron powiązanych, potencjalny wpływ nieodłącznych ograniczeń na zdolność\nbiegłego rewidenta do wykrycia istotnych zniekształceń jest większy z następujących\npowodów:\n• kierownictwo może być nieświadome istnienia wszystkich powiązań i transakcji ze\nstronami powiązanymi, szczególnie wtedy, gdy mające zastosowanie ramowe\nzałożenia sprawozdawczości finansowej nie ustanawiają wymogów dotyczących\nstron powiązanych,\n• powiązania ze stronami powiązanymi mogą wiązać się z większą możliwością\nzmowy, zatajenia lub manipulacji przez kierownictwo." },
    { "ref": "550(7)", "desc": "Zaplanowanie i przeprowadzenie badania przy zachowaniu zawodowego sceptycyzmu tak,\njak wymaga tego MSB 2006\n, jest więc szczególnie ważne, zważywszy na ewentualność\nnieujawnienia powiązań i transakcji ze stronami powiązanymi. W niniejszym MSB zostały\nokreślone wymogi mające wspomóc biegłego rewidenta w identyfikacji i oszacowaniu\nryzyk istotnego zniekształcenia dotyczących powiązań i transakcji ze stronami\npowiązanymi oraz w zaprojektowaniu procedur badania stanowiących reakcję na te\noszacowane ryzyka." },
    { "ref": "550(8)", "desc": "Niniejszy MSB stosuje się do badań sprawozdań finansowych za okresy sprawozdawcze\nrozpoczynające się 15 grudnia 2009 r. i później" },
    { "ref": "550(9)", "desc": "Celami biegłego rewidenta są:\n(a) niezależnie od tego, czy mające zastosowanie ramowe założenia sprawozdawczości\nfinansowej ustanawiają wymogi dotyczące stron powiązanych, uzyskanie\nzrozumienia powiązań i transakcji ze stronami powiązanymi wystarczającego, aby\nmógł on: (i) rozpoznać, o ile występują, czynniki ryzyka oszustwa wynikające z powiązań\ni transakcji ze stronami powiązanymi, stosowne dla identyfikacji i oszacowania\nryzyk istotnego zniekształcenia spowodowanych oszustwem, oraz\n(ii) stwierdzić, w oparciu o uzyskane dowody badania czy sprawozdanie\nfinansowe w zakresie, w jakim wpływają na nie te powiązania i transakcje:\na. zapewnia rzetelną prezentację (dla ramowych założeń rzetelnej\nprezentacji), lub\nb. nie wprowadza w błąd (dla ramowych założeń zgodności),\n(b) dodatkowo tam, gdzie mające zastosowanie ramowe założenia sprawozdawczości\nfinansowej ustanawiają wymogi dotyczące stron powiązanych, uzyskanie\nwystarczających i odpowiednich dowodów badania na temat tego czy powiązania\ni transakcje ze stronami powiązanymi zostały odpowiednio zidentyfikowane,\nrozliczone i ujawnione w sprawozdaniu finansowym zgodnie z tymi ramowymi\nzałożeniami." },
    { "ref": "550(10)", "desc": "Dla celów MSB następujące pojęcia mają znaczenia przypisane poniżej:\n(a) Transakcja na warunkach rynkowych – transakcja przeprowadzona na warunkach\nwłaściwych dla transakcji pomiędzy zainteresowanymi nabywcą i sprzedawcą, którzy\nsą niepowiązani ze sobą oraz działają niezależnie od siebie i realizują swoje własne\nnajlepiej pojęte interesy.\n(b) Strona powiązana – strona, która jest albo: (zob. par. A4 – A7)\n(i) stroną powiązaną w myśl definicji zawartej w mających zastosowanie\nramowych założeniach sprawozdawczości finansowej, albo\n(ii) tam, gdzie mające zastosowanie ramowe założenia sprawozdawczości\nfinansowej ustanawiają minimalne lub nie ustanawiają żadnych wymogów\ndotyczących stron powiązanych:\na. osoba lub inna jednostka, która sprawuje kontrolę lub wywiera znaczący\nwpływ na jednostkę sprawozdawczą, bezpośrednio lub pośrednio przez\njednego lub większą liczbę pośredników,\nb. inna jednostka, nad którą jednostka sprawozdawcza sprawuje kontrolę\nlub wywiera znaczący wpływ, bezpośrednio lub pośrednio przez jednego\nlub większą liczbę pośredników, lub\nc. inna jednostka, która znajduje się pod wspólną kontrolą wraz z jednostką\nsprawozdawczą przez posiadanie:\ni. wspólnego właściciela sprawującego kontrolę,\nii. właścicieli, którzy są bliskimi członkami rodziny, lub\niii. wspólnego kluczowego kierownictwa.\nJednakże nie uznaje się za powiązane jednostek znajdujących się pod\nwspólną kontrolą państwa (tj. władz krajowych, regionalnych lub\nlokalnych), chyba że uczestniczą w znaczących transakcjach lub\nw znaczącym stopniu dzielą między sobą zasoby." },
    { "ref": "550(11)", "desc": "W ramach części procedur oszacowania ryzyka i powiązanych czynności, których\nprzeprowadzenia w trakcie badania wymagają od biegłego rewidenta MSB 315 (zmieniony)\ni MSB 2407\n, biegły rewident przeprowadza* procedury badania i powiązane czynności\nokreślone w paragrafach 12-17, w celu uzyskania informacji odpowiednich dla\nzidentyfikowania ryzyk istotnego zniekształcenia związanych z powiązaniami\ni transakcjami ze stronami powiązanymi. (Zob. par. A8)" },
    { "ref": "550(12)", "desc": "Dyskusja w gronie zespołu wykonującego zlecenie, zgodnie z wymogami MSB 315\n(zmienionego) i MSB 2408\n, obejmuje szczególne rozważenie podatności sprawozdania\nfinansowego na istotne zniekształcenie spowodowane oszustwem lub błędem, mogące\nwynikać z powiązań i transakcji ze stronami powiązanymi. (Zob. par. A9-A10)" },
    { "ref": "550(13)", "desc": "Biegły rewident kieruje do kierownictwa zapytania dotyczące:\n(a) tożsamości stron powiązanych z jednostką, w tym zmian w stosunku do poprzedniego\nokresu sprawozdawczego, (zob. par. A11-A14)\n(b) rodzaju powiązań jednostki ze stronami powiązanymi, oraz\n(c) informacji, czy jednostka zawarła jakiekolwiek transakcje ze stronami powiązanymi\nw trakcie okresu sprawozdawczego, a jeśli tak, typu i celu tych transakcji." },
    { "ref": "550(14)", "desc": "Biegły rewident kieruje do kierownictwa i innych osób z jednostki zapytania oraz\nprzeprowadza inne procedury oszacowania ryzyka uznane za odpowiednie, dla uzyskania\nzrozumienia, kontroli ustanowionych przez kierownictwo, o ile istnieją, w celu: (zob. par.\nA15-A20)\n(a) identyfikacji, rozliczenia i ujawnienia powiązań i transakcji ze stronami powiązanymi\nzgodnie z mającymi zastosowanie ramowymi założeniami sprawozdawczości\nfinansowej,\n(b) autoryzacji i zatwierdzenia znaczących transakcji i porozumień ze stronami\npowiązanymi, oraz (zob. par. A21)\n(c) autoryzacji i zatwierdzenia znaczących transakcji i porozumień wykraczających poza\nnormalny tok działalności." },
    { "ref": "550(15)", "desc": "W trakcie badania biegły rewident pozostaje wyczulony, podczas inspekcji zapisów lub\ndokumentów, na porozumienia lub inne informacje, które mogą wskazywać na istnienie powiązań i transakcji ze stronami powiązanymi, wcześniej nie zidentyfikowanych przez\nkierownictwo lub nie ujawnionych biegłemu rewidentowi. (Zob. par. A22-A23)\nBiegły rewident analizuje w szczególności poniższe poszukując oznak istnienia powiązań\nlub transakcji ze stronami powiązanymi, wcześniej nie zidentyfikowanych przez\nkierownictwo lub nie ujawnionych biegłemu rewidentowi:\n(a) potwierdzenia bankowe i prawne uzyskane jako część procedur badania biegłego\nrewidenta,\n(b) protokoły ze zgromadzeń udziałowców i posiedzeń osób sprawujących nadzór, oraz\n(c) wszelkie inne zapisy lub dokumenty, które biegły rewident uznaje za niezbędne\nw okolicznościach dotyczących jednostki." },
    { "ref": "550(16)", "desc": "Jeżeli biegły rewident zidentyfikuje, w trakcie przeprowadzania procedur badania zgodnie\nz paragrafem 15 lub podczas innych procedur badania, znaczące transakcje wykraczające\npoza normalny tok działalności, wówczas biegły rewident kieruje do kierownictwa\nzapytania dotyczące: (zob. par. A24-A25)\n(a) charakteru tych transakcji, (zob. par. A26) oraz\n(b) informacji czy strony powiązane mogły brać w nich udział. (Zob. par. A27)" },
    { "ref": "550(17)", "desc": "Biegły rewident dzieli się z innymi członkami zespołu wykonującego zlecenie stosownymi\ninformacjami uzyskanymi na temat stron powiązanych z jednostką. (Zob. par. A28)" },
    { "ref": "550(18)", "desc": "Wypełniając wymóg MSB 315 (zmienionego) dotyczący identyfikacji i oszacowania ryzyk\nistotnego zniekształcenia9\n, biegły rewident identyfikuje i szacuje ryzyka istotnego\nzniekształcenia dotyczące powiązań i transakcji ze stronami powiązanymi oraz ustala, czy\nktórekolwiek z tych ryzyk są ryzykami znaczącymi. Dokonując tych ustaleń, biegły\nrewident traktuje zidentyfikowane znaczące transakcje ze stronami powiązanymi,\nwykraczające poza normalny tok działalności jednostki jako prowadzące do znaczących\nryzyk." },
    { "ref": "550(20)", "desc": "W ramach części wymogu MSB 330 stanowiącej, że biegły rewident reaguje na oszacowane\nryzyka\n10\n, biegły rewident projektuje i przeprowadza dalsze procedury badania w celu\nuzyskania wystarczających i odpowiednich dowodów badania dotyczących oszacowanych ryzyk istotnego zniekształcenia dotyczących powiązań i transakcji ze stronami\npowiązanymi. Te procedury badania obejmują procedury wymagane przez paragrafy 21-24.\n(Zob. par. A31-A34)" },
    { "ref": "550(21)", "desc": "Jeżeli biegły rewident identyfikuje porozumienia lub informacje, które wskazują na\nistnienie powiązań lub transakcji ze stronami powiązanymi, których kierownictwo\nwcześniej nie zidentyfikowało lub nie ujawniło, biegły rewident ustala, czy faktyczne\nokoliczności potwierdzają istnienie tych powiązań lub transakcji." },
    { "ref": "550(22)", "desc": "Jeżeli biegły identyfikuje strony powiązane lub znaczące transakcje ze stronami\npowiązanymi, których kierownictwo wcześniej nie zidentyfikowało lub nie ujawniło\nbiegłemu rewidentowi, biegły rewident:\n(a) niezwłocznie przekazuje stosowne informacje innym członkom zespołu\nwykonującego zlecenie, (zob. par. A35)\n(b) tam, gdzie mające zastosowanie ramowe założenia sprawozdawczości finansowej\nustanawiają wymogi dotyczące stron powiązanych:\n(i) zwraca się do kierownictwa z prośbą o zidentyfikowanie wszystkich transakcji\nz nowo zidentyfikowanymi stronami powiązanymi w celu dokonania ich\ndalszej oceny przez biegłego rewidenta, oraz\n(ii) zwraca się z zapytaniem, dlaczego kontrole jednostki dotyczące powiązań\ni transakcji ze stronami powiązanymi nie zapewniły identyfikacji lub\nujawnienia powiązań i transakcji ze stronami powiązanymi,\n(c) przeprowadza odpowiednie procedury badania wiarygodności odnoszące się do\ntakich nowo zidentyfikowanych stron powiązanych lub znaczących transakcji ze\nstronami powiązanymi, (zob. par. A36)\n(d) ponownie rozważa ryzyko, że mogą istnieć inne strony powiązane lub znaczące\ntransakcje ze stronami powiązanymi, których kierownictwo wcześniej nie\nzidentyfikowało lub nie ujawniło biegłemu rewidentowi i w razie potrzeby,\nprzeprowadza dodatkowe procedury badania, oraz\n(e) jeżeli nieujawnienie przez kierownictwo wydaje się zamierzone (i w ten sposób\nwskazuje na ryzyko istotnego zniekształcenia spowodowanego oszustwem) ocenia\nwpływ tego faktu na badanie. (Zob. par. A37)" },
    { "ref": "550(23)", "desc": "W odniesieniu do zidentyfikowanych znaczących transakcji ze stronami powiązanymi\nwykraczających poza normalny tok działalności jednostki, biegły rewident:\n(a) przeprowadza inspekcję istniejących umów lub porozumień, o ile występują, i ocenia,\nczy:\n(i) gospodarcze uzasadnienie transakcji (lub jego brak) wskazuje, że mogły być\none zawarte z zamiarem oszukańczej sprawozdawczości finansowej lub ukrycia zawłaszczenia majątku11\n, (zob. par. A38-A39)\n(ii) warunki transakcji są spójne z wyjaśnieniami kierownictwa, oraz\n(iii) transakcje zostały odpowiednio rozliczone i ujawnione zgodnie z mającymi\nzastosowanie ramowymi założeniami sprawozdawczości finansowej,\n(b) uzyskuje dowody badania, że transakcje zostały odpowiednio autoryzowane\ni zatwierdzone. (Zob. par. A40-A41)" },
    { "ref": "550(24)", "desc": "Jeżeli kierownictwo zamieściło w sprawozdaniu finansowym stwierdzenie wskazujące, że\ntransakcje ze stronami powiązanymi zostały przeprowadzone na warunkach równorzędnych\nz warunkami stosowanymi w transakcjach rynkowych, biegły rewident uzyskuje\nwystarczające i odpowiednie dowody badania dotyczące tego stwierdzenia. (Zob. par. A42-\nA45)" },
    { "ref": "550(25)", "desc": "Przy formułowaniu opinii na temat sprawozdania finansowego zgodnie z MSB 700\n(zmienionym)12 biegły rewident ocenia: (zob. par. A46)\n(a) czy zidentyfikowane powiązania i transakcje ze stronami powiązanymi zostały\nodpowiednio rozliczone i ujawnione zgodnie z mającymi zastosowanie ramowymi\nzałożeniami sprawozdawczości finansowej, oraz (zob. par. A47)\n(b) czy skutki powiązań i transakcji ze stronami powiązanymi:\n(i) uniemożliwiają zapewnienie rzetelnej prezentacji sprawozdania finansowego,\n(dla ramowych założeń rzetelnej prezentacji) lub\n(ii) sprawiają, że sprawozdanie finansowe wprowadza w błąd (dla ramowych\nzałożeń zgodności)." },
    { "ref": "550(26)", "desc": "Tam, gdzie mające zastosowanie ramowe założenia sprawozdawczości finansowej\nustanawiają wymogi dotyczące stron powiązanych, biegły rewident uzyskuje pisemne\noświadczenia od kierownictwa oraz gdy jest to odpowiednie, od osób sprawujących nadzór,\nże: (zob. par. A48-A49)\n(a) ujawnili oni biegłemu rewidentowi tożsamość stron powiązanych z jednostką oraz\nwszystkie powiązania i transakcje ze stronami powiązanymi, które są im znane, oraz\n(b) takie powiązania i transakcje zostały odpowiednio rozliczone oraz ujawnione zgodnie\nz wymogami ramowych założeń." },
    { "ref": "550(27)", "desc": "Biegły rewident informuje osoby sprawujące nadzór, o ile nie wszystkie te osoby\nuczestniczą w zarządzaniu jednostką13\n, o znaczących sprawach jakie pojawiły się podczas\nbadania w związku ze stronami powiązanymi z jednostką. (Zob. par. A50)\n" },
    { "ref": "550(28)", "desc": "Biegły rewident włącza do dokumentacji badania nazwy zidentyfikowanych stron\npowiązanych oraz charakter powiązań ze stronami powiązanymi14." },

    { "ref": "560(7a)", "desc": "uzyskanie zrozumienia wszelkich procedur ustanowionych przez kierownika\njednostki dla zapewnienia, że późniejsze zdarzenia są zidentyfikowane," },
    { "ref": "560(7b)", "desc": "skierowanie zapytania do kierownika jednostki oraz gdzie to odpowiednie, osób\nsprawujących nadzór, czy nastąpiły jakiekolwiek późniejsze zdarzenia, które mogą\nwpływać na sprawozdanie finansowe, (zob. par. A9)\n" },
    { "ref": "560(7c)", "desc": "zapoznanie się z protokołami, o ile istnieją, z posiedzeń właścicieli, kierownika\njednostki i osób sprawujących nadzór, które odbyły się po dacie sprawozdania\nfinansowego oraz skierowanie zapytań o sprawy omawiane na tych posiedzeniach,\nz których protokoły nie są jeszcze dostępne, (zob. par. A10)" },
    { "ref": "560(7d)", "desc": "zapoznanie się z najbardziej aktualnymi śródrocznymi sprawozdaniami finansowymi\njednostki, o ile takie istnieją." },
    { "ref": "560(4)", "desc": "Celami biegłego rewidenta są:\n(a) uzyskanie wystarczających i odpowiednich dowodów badania na temat tego, czy\nzdarzenia następujące pomiędzy datą sprawozdania finansowego a datą sprawozdania\nbiegłego rewidenta, które wymagają korekty lub ujawnienia w sprawozdaniu\nfinansowym, są odpowiednio odzwierciedlone w tym sprawozdaniu finansowym,\nzgodnie z mającymi zastosowanie ramowymi założeniami sprawozdawczości\nfinansowej oraz\n(b) odpowiednia reakcja na fakty, o których biegły rewident dowiaduje się po dacie\nsprawozdania biegłego rewidenta, które, gdyby były mu znane na ten dzień, mogłyby\nspowodować, że biegły rewident zmieniłby sprawozdanie biegły rewidenta." },
    { "ref": "560(5)", "desc": "Dla celów MSB następujące pojęcia mają znaczenia przypisane poniżej:\n(a) Data sprawozdania finansowego – data zakończenia najpóźniejszego okresu\nsprawozdawczego objętego sprawozdaniem finansowym.\n(b) Data akceptacji sprawozdania finansowego – data, na którą sporządzone zostały\nwszystkie pojedyncze składniki, które wchodzą w skład sprawozdania finansowego,\nw tym powiązane noty, a osoby do tego uprawnione stwierdziły, że przyjmują\nodpowiedzialność za to sprawozdanie finansowe. (Zob. par. A2)\n(c) Data sprawozdania biegłego rewidenta – data, którą biegły rewident zamieszcza\nw sprawozdaniu na temat sprawozdania finansowego zgodnie z MSB 700. (Zob. par.\nA3)\n(d) Data udostępnienia sprawozdania finansowego – data, w której sprawozdanie\nbiegłego rewidenta i zbadane sprawozdanie finansowe są udostępnione stronom\ntrzecim. (Zob. par. A4-A5)\n(e) Późniejsze zdarzenia – zdarzenia następujące pomiędzy datą sprawozdania\nfinansowego a datą sprawozdania biegłego rewidenta oraz fakty, o których biegły\nrewident dowiaduje się po dacie sprawozdania biegłego rewidenta.\n" },
    { "ref": "560(6)", "desc": "Biegły rewident przeprowadza procedury badania zaprojektowane w celu uzyskania\nwystarczających i odpowiednich dowodów badania, że wszystkie zdarzenia następujące\npomiędzy datą sprawozdania finansowego a datą sprawozdania biegłego rewidenta, które\nwymagają korekty lub ujawnienia w sprawozdaniu finansowym, zostały zidentyfikowane.\nOd biegłego rewidenta nie oczekuje się jednak przeprowadzania dodatkowych procedur\nbadania spraw, w odniesieniu do których wcześniej przeprowadzone procedury badania\ndostarczyły zadowalających wniosków. (Zob. par. A6)" },
    { "ref": "560(7)", "desc": "Biegły rewident przeprowadza procedury badania wymagane przez paragraf 6, w taki\nsposób, aby pokryły okres od daty sprawozdania finansowego do daty sprawozdania\nbiegłego rewidenta lub przedział czasu możliwie najbliższy temu okresowi. Biegły rewident\nbierze pod uwagę oszacowanie ryzyka przy ustalaniu rodzaju i zakresu takich procedur\nbadania, które obejmują: (zob. par. A7-A8)\n(a) uzyskanie zrozumienia wszelkich procedur ustanowionych przez kierownika\njednostki dla zapewnienia, że późniejsze zdarzenia są zidentyfikowane,\n(b) skierowanie zapytania do kierownika jednostki oraz gdzie to odpowiednie, osób\nsprawujących nadzór, czy nastąpiły jakiekolwiek późniejsze zdarzenia, które mogą\nwpływać na sprawozdanie finansowe, (zob. par. A9)\n (c) zapoznanie się z protokołami, o ile istnieją, z posiedzeń właścicieli, kierownika\njednostki i osób sprawujących nadzór, które odbyły się po dacie sprawozdania\nfinansowego oraz skierowanie zapytań o sprawy omawiane na tych posiedzeniach,\nz których protokoły nie są jeszcze dostępne, (zob. par. A10)\n(d) zapoznanie się z najbardziej aktualnymi śródrocznymi sprawozdaniami finansowymi\njednostki, o ile takie istnieją." },
    { "ref": "560(8)", "desc": "Jeżeli w wyniku przeprowadzenia procedur wymaganych przez paragrafy 6 i 7, biegły\nrewident zidentyfikuje zdarzenia, które wymagają korekty lub ujawnienia w sprawozdaniu\nfinansowym, biegły rewident ustala, czy każde takie zdarzenie jest odpowiednio\nodzwierciedlone w tym sprawozdaniu finansowym zgodnie z mającymi zastosowanie\nramowymi założeniami sprawozdawczości finansowej.\n" },
    { "ref": "560(9)", "desc": "Biegły rewident zwraca się z prośbą do kierownika jednostki oraz gdzie to odpowiednie,\nosób sprawujących nadzór, o dostarczenie pisemnego oświadczenia zgodnie z MSB 5804\n, że\nwszystkie zdarzenia, następujące po dacie sprawozdania finansowego dla których mające\nzastosowanie ramowe założenia sprawozdawczości finansowej wymagają korekty lub\nujawnienia, zostały skorygowane lub ujawnione." },
    { "ref": "560(10)", "desc": "Biegły rewident nie ma obowiązku przeprowadzania jakichkolwiek procedur badania\nodnoszących się do sprawozdania finansowego po dacie sprawozdania biegłego rewidenta.\nJednakże, jeżeli, po dacie sprawozdania biegłego rewidenta, ale przed datą udostępnienia\nsprawozdania finansowego, biegły rewident dowiaduje się o fakcie, który, gdyby był mu\nznany w dacie sprawozdania biegłego rewidenta, mógłby spowodować, że biegły rewident\nzmieniłby sprawozdanie biegłego rewidenta, wówczas: (zob. par. A11-A12)\n(a) omawia daną sprawę z kierownikiem jednostki i gdzie to odpowiednie, osobami\nsprawującymi nadzór,\n(b) ustala, czy sprawozdanie finansowe wymaga zmiany, a jeśli tak,\n(c) kieruje zapytanie, w jaki sposób kierownik jednostki zamierza odnieść się do tej\nsprawy w sprawozdaniu finansowym." },
    { "ref": "560(11)", "desc": "Jeżeli kierownik jednostki zmienia sprawozdanie finansowe, biegły rewident:\n(a) przeprowadza procedury badania niezbędne w okolicznościach związanych\nz wprowadzeniem zmiany,\n(b) jeżeli okoliczności określone w paragrafie 12 nie mają zastosowania:\n(i) rozszerza procedury badania, o których mowa w paragrafach 6 i 7 do daty\nnowego sprawozdania biegłego rewidenta oraz\n(ii) dostarcza nowe sprawozdanie biegłego rewidenta na temat zmienionego\nsprawozdania finansowego. Nowe sprawozdanie biegłego rewidenta nie\npowinno mieć daty wcześniejszej niż data akceptacji zmienionego\nsprawozdania finansowego.\n" },
    { "ref": "560(12)", "desc": "Tam, gdzie przepisy prawa, regulacja lub ramowe założenia sprawozdawczości finansowej\nnie zabraniają kierownikowi jednostki ograniczenia wprowadzania zmiany do sprawozdania\nfinansowego do tej stanowiącej skutki późniejszego zdarzenia lub zdarzeń powodujących tę\nzmianę, a osobom odpowiedzialnym za akceptację sprawozdania finansowego nie zabrania\nsię ograniczenia ich akceptacji do tej zmiany, biegły rewident ma prawo ograniczyć\nprocedury badania dotyczące późniejszych zdarzeń, wymagane przez paragraf 11(b)(i), do\ntej zmiany. W takich przypadkach biegły rewident albo:\n(a) zmienia sprawozdanie biegłego rewidenta, aby włączyć do niego dodatkową datę\nograniczoną wyłącznie do tej zmiany i w ten sposób wskazuje, że procedury biegłego\nrewidenta dotyczące późniejszych zdarzeń są ograniczone wyłącznie do zmiany\nwprowadzonej do sprawozdania finansowego, opisanej w stosownej nocie do\nsprawozdania finansowego, lub (zob. par. A13)\n(b) dostarcza nowe lub zmienione sprawozdanie biegłego rewidenta, które zawiera\noświadczenie w akapicie objaśniającym ze zwróceniem uwagi5\nlub w akapicie\nzawierającym inne sprawy, informujące, że procedury biegłego rewidenta dotyczące\npóźniejszych zdarzeń są ograniczone wyłącznie do zmiany wprowadzonej do\nsprawozdania finansowego, jak opisano to w stosownej nocie do sprawozdania\nfinansowego." },
    { "ref": "560(13)", "desc": "W niektórych systemach prawnych przepisy prawa, regulacja lub ramowe założenia\nsprawozdawczości finansowej mogą nie wymagać od kierownika jednostki udostępnienia\nzmienionego sprawozdania finansowego i odpowiednio, biegły rewident nie musi\ndostarczyć zmienionego lub nowego sprawozdania biegłego rewidenta. Jednakże, jeżeli\nkierownik jednostki nie zmienia sprawozdania finansowego w okolicznościach, w których\nbiegły rewident uważa, że wymaga ono zmiany, wówczas: (zob. par. A14-A15)\n(a) jeżeli sprawozdanie biegłego rewidenta nie zostało jeszcze dostarczone do jednostki,\nbiegły rewident modyfikuje opinię zgodnie z wymogami MSB 705 (zmienionego)\n6\n,\na następnie dostarcza sprawozdanie biegłego rewidenta lub\n(b) jeżeli sprawozdanie biegłego rewidenta zostało już dostarczone do jednostki, biegły\nrewident pisemnie powiadamia kierownika jednostki oraz osoby sprawujące nadzór,\no ile nie wszystkie osoby sprawujące nadzór uczestniczą w zarządzaniu jednostką,\naby nie udostępniały stronom trzecim sprawozdania finansowego przed\nwprowadzeniem do niego koniecznych zmian. Jeżeli mimo to sprawozdanie\nfinansowe zostanie udostępnione bez wprowadzenia wcześniej koniecznych zmian,\nwówczas biegły rewident podejmuje odpowiednie działania zapobiegające temu, aby\npolegano na tym sprawozdaniu biegłego rewidenta. (Zob. par. A16-A17)" },
    { "ref": "560(14)", "desc": "Po udostępnieniu sprawozdania finansowego, biegły rewident nie ma obowiązku\nprzeprowadzania jakichkolwiek procedur badania dotyczących sprawozdania finansowego.\nJednakże, jeżeli po udostępnieniu sprawozdania finansowego biegły rewident dowiaduje się\no fakcie, który, gdyby był mu znany w dacie sprawozdania biegłego rewidenta, mogłyby\nspowodować, że biegły rewident zmieniłby sprawozdanie biegłego rewidenta, wówczas: (a) omawia sprawę z kierownikiem jednostki, a jeśli to zasadne z osobami sprawującymi\nnadzór,\n(b) ustala, czy sprawozdanie finansowe wymaga zmiany, a jeśli tak,\n(c) kieruje zapytanie do kierownika jednostki, w jaki sposób zamierza odnieść się do tej\nsprawy w sprawozdaniu finansowym. (Zob. par. A18)\n" },
    { "ref": "560(15)", "desc": "Jeżeli kierownik jednostki zmienia sprawozdanie finansowe, biegły rewident: (zob. par.\nA19)\n(a) przeprowadza procedury badania niezbędne w okolicznościach związanych\nz wprowadzeniem zmiany,\n(b) dokonuje przeglądu kroków podjętych przez kierownika jednostki służących\nzapewnieniu, że każdy, kto otrzymał poprzednio udostępnione sprawozdanie\nfinansowe wraz ze sprawozdaniem biegłego rewidenta został poinformowany\no zaistniałej sytuacji,\n(c) jeżeli, okoliczności określone w paragrafie 12 nie mają zastosowania:\n(i) rozszerza procedury badania, o których mowa w paragrafach 6 i 7, do daty\nnowego sprawozdania biegłego rewidenta i opatruje nowe sprawozdanie\nbiegłego rewidenta datą, która nie jest wcześniejsza od daty akceptacji\nzmienionego sprawozdania finansowego, oraz\n(ii) dostarcza nowe sprawozdanie biegłego rewidenta na temat zmienionego\nsprawozdania finansowego,\n(d) gdy okoliczności określone w paragrafie 12 mają miejsce, zmienia sprawozdanie\nbiegłego rewidenta lub dostarcza nowe sprawozdanie biegłego rewidenta zgodnie\nz wymogami paragrafu 12." },
    { "ref": "560(16)", "desc": "Biegły rewident zamieszcza w nowym lub zmienionym sprawozdaniu biegłego rewidenta\nakapit objaśniający ze zwróceniem uwagi lub akapit zawierający inne sprawy odnoszący się\ndo noty w sprawozdaniu finansowym, która bardziej obszernie omawia powód\nwprowadzenia zmiany do wcześniej udostępnionego sprawozdania finansowego oraz do\nwcześniejszego sprawozdania dostarczonego przez biegłego rewidenta.\n" },
    { "ref": "560(17)", "desc": "Jeżeli kierownik jednostki nie podejmuje kroków niezbędnych do zapewnienia, że każdy,\nkto otrzymał poprzednio wydane sprawozdanie finansowe jest informowany o sytuacji, i nie\nzmienia sprawozdania finansowego w okolicznościach, w których biegły rewident sądzi, że\nwymaga ono zmiany, biegły rewident powiadamia kierownika jednostki oraz osoby\nsprawujące nadzór o ile nie wszystkie osoby sprawujące nadzór uczestniczą w zarządzaniu\njednostką7\n, że biegły rewident podejmie działania zapobiegające temu, aby\nw przyszłości polegano na tym sprawozdaniu biegłego rewidenta. Jeżeli, pomimo tego\npowiadomienia, kierownik jednostki lub osoby sprawujące nadzór nie podejmą niezbędnych\nkroków, biegły rewident podejmuje odpowiednie działania zapobiegające temu, aby\npolegano na tym sprawozdaniu biegłego rewidenta. (Zob. par. A20)" },

    { "ref": "265(A12)", "desc": "Informowanie na piśmie osób sprawujących nadzór o znaczących słabościach odzwierciedla ważność tych spraw i pomaga osobom sprawującym nadzór w pełnieniu swoich obowiązków\nnadzorczych. MSB 260 (zmieniony) zawiera stosowne rozważania dotyczące informowania osób\nsprawujących nadzór w sytuacji, gdy wszystkie te osoby są zaangażowane w zarządzanie jednostką." },

    { "ref": "570(10)", "desc": "Przy przeprowadzaniu procedur oceny ryzyka wymaganych przez MSB 315 (zmieniony) 3\nbiegły rewident rozpatruje*, czy występują zdarzenia lub warunki mogące budzić poważne\nwątpliwości co do zdolności jednostki do kontynuacji działalności. Biegły rewident ustala\nwówczas, czy kierownik jednostki dokonał już wstępnej oceny zdolności jednostki do\nkontynuacji działalności oraz: (Zob. par. A3-A6)\n(a) w przypadku, gdy ocena taka została dokonana, biegły rewident omawia ją z kierownikiem\njednostki i ustala, czy rozpoznało ono zdarzenia lub warunki, które pojedynczo lub łącznie\nmogą budzić poważne wątpliwości co do zdolności jednostki do kontynuacji działalności,\na jeżeli tak, plany kierownika jednostki w odpowiedzi na tę ocenę lub\n(b) jeżeli ocena taka nie została jeszcze dokonana, biegły rewident omawia z kierownikiem\njednostki uzasadnienie przyjęcia zasady kontynuacji działalności i kieruje zapytanie do\nkierownika jednostki, czy istnieją zdarzenia lub warunki, które pojedynczo lub łącznie\nmogą budzić poważne wątpliwości co do zdolności jednostki do kontynuacji działalności. " },
    { "ref": "570(11)", "desc": "W trakcie całego badania biegły rewident pozostaje wyczulony na dowody badania dotyczące\nzdarzeń lub warunków, które mogą budzić poważne wątpliwości co do zdolności jednostki do\nkontynuacji działalności (Zob. par. A7).\n" },
    { "ref": "570(12)", "desc": "Biegły rewident ocenia osąd kierownika jednostki dotyczący zdolności jednostki do kontynuacji\ndziałalności (Zob. par. A8-A10, A12-A13). " },
    { "ref": "570(13)", "desc": "Dokonując oceny osądu kierownika jednostki co do zdolności jednostki do kontynuacji\ndziałalności biegły rewident uwzględnia ten sam okres, którego dotyczy ocena kierownika\njednostki przeprowadzona zgodnie z mającymi zastosowanie ramowymi założeniami\nsprawozdawczości finansowej bądź też zgodnie z przepisami prawa lub regulacji, jeśli określa\nona dłuższy okres. Jeżeli ocena kierownika jednostki dotycząca zdolności jednostki do\nkontynuacji działalności obejmuje okres krótszy niż dwanaście miesięcy od daty sprawozdania\nfinansowego, określonej w MSB 5604\n, biegły rewident zwraca się do kierownika jednostki\nz prośbą o wydłużenie okresu co najmniej do dwunastu miesięcy od tej daty (Zob. par. A11-\nA13). " },
    { "ref": "570(14)", "desc": "Dokonując oceny osądu kierownika jednostki, biegły rewident rozpatruje, czy osąd ten\nuwzględnia wszystkie ważne informacje, które biegły rewident uzyskał w rezultacie badania. " },
    { "ref": "570(15)", "desc": "Biegły rewident zwraca się do kierownika jednostki z zapytaniem, czy znane mu są zdarzenia\nlub warunki dotyczące okresu nieobjętego oceną kierownika jednostki, które mogłyby budzić\npoważne wątpliwości co do zdolności jednostki do kontynuacji działalności (Zob. par. A14-\nA15). " },
    { "ref": "570(16)", "desc": "W przypadku rozpoznania zdarzeń lub warunków, które mogą budzić poważne wątpliwości co\ndo zdolności jednostki do kontynuacji działalności, biegły rewident uzyskuje wystarczające\ni odpowiednie dowody badania w celu określenia, czy istnieje lub też, czy nie istnieje znacząca\nniepewność dotycząca zdarzeń lub warunków, które mogą budzić poważne wątpliwości co do\nzdolności jednostki do kontynuacji działalności (dalej określana jako „znacząca niepewność”)\nw drodze przeprowadzenia dodatkowych procedur badania uwzględniających rozpatrzenie\nczynników łagodzących. Procedury te obejmują (Zob. par. A16):\n(a) w przypadku braku dokonania przez kierownika jednostki oceny zdolności jednostki do\nkontynuacji działalności, zwrócenie się z prośbą do kierownika jednostki o jej dokonanie;\n(b) przy ocenie planów kierownika jednostki co do przyszłych działań w związku z jego oceną\nkontynuacji działalności; czy realizacja tych planów może poprawić sytuację i czy plany\nkierownika jednostki są wykonalne w danych okolicznościach (Zob. par. A17);\n(c) w przypadku, gdy jednostka przygotowała prognozę przepływów środków pieniężnych,\na analiza prognozy jest istotnym czynnikiem przy rozpatrywaniu przyszłego wyniku\nzdarzeń lub warunków przy ocenie planów kierownika jednostki co do przyszłych działań\n(Zob. par. A18-A19):\n(i) ocenę wiarygodności podstawowych danych wykorzystanych w przygotowanych\nprognozach oraz\n(ii) określenie, czy istnieje odpowiednie uzasadnienie dla założeń stanowiących podstawę\nprognoz;\n(d) rozpatrzenie, czy od daty dokonania oceny przez kierownika jednostki pojawiły się jakieś\ndodatkowe fakty lub informacje;\n(e) uzyskanie pisemnych oświadczeń kierownika jednostki i tam, gdzie to odpowiednie, osób\nsprawujących nadzór, dotyczących ich planów co do przyszłych działań oraz możliwości\nwykonania tych planów (Zob. par. A20). " },
    { "ref": "570(18)", "desc": "W oparciu o uzyskane dowody badania biegły rewident wyciąga wniosek, czy w jego ocenie\nwystępuje znacząca niepewność dotycząca zdarzeń lub warunków, które, pojedynczo lub\nłącznie, mogą budzić poważne wątpliwości co do zdolności jednostki do kontynuacji\ndziałalności. Znacząca niepewność zachodzi, gdy wielkość jej potencjalnego wpływu\ni prawdopodobieństwa wystąpienia jest taka, że według osądu biegłego rewidenta odpowiednie\nujawnienie rodzaju i wpływu tej niepewności jest niezbędne do (Zob. par. A21-22):\n(a) w przypadku ramowych założeń rzetelnej prezentacji – rzetelnej prezentacji sprawozdania\nfinansowego – lub\n(b) w przypadku ramowych założeń zgodności – tego, aby sprawozdanie finansowe nie\nwprowadzało w błąd." },
    { "ref": "570(21)", "desc": "Jeżeli sprawozdanie zostało sporządzone zgodnie z zasadą kontynuacji działalności, ale według\nosądu biegłego rewidenta przyjęcie przez kierownika jednostki tej zasady było niewłaściwe,\nbiegły rewident wyraża opinię negatywną. (Zob. par. A26-A27)." },
    { "ref": "570(22)", "desc": "Jeśli sprawozdanie finansowe zawiera odpowiednie ujawnienie dotyczące znaczącej\nniepewności, biegły rewident wyraża niezmodyfikowaną opinię, a sprawozdanie biegłego\nrewidenta zawiera odrębną sekcję pod nagłówkiem „Znacząca niepewność dotycząca\nkontynuacji działalności”, aby: (Zob. par A28-A31, A34)\n(a) zwrócić uwagę na notę w sprawozdaniu finansowym, która ujawnia sprawy opisane\nw paragrafie 19 i\n(b) stwierdzić, że te zdarzenia lub warunki wskazują, że występuje znacząca niepewność,\nktóra może budzić poważne wątpliwości co do zdolności jednostki do kontynuacji\ndziałalności i że opinia nie jest zmodyfikowana z tego powodu,\nSprawozdanie finansowe nie zawiera odpowiednich ujawnień dotyczących znaczącej niepewności " },
    { "ref": "570(23)", "desc": "Jeżeli sprawozdanie finansowe nie zawiera odpowiedniego ujawnienia dotyczącego znaczącej\nniepewności, biegły rewident (Zob. par. A32-A34):\n(a) wyraża odpowiednio opinię z zastrzeżeniem lub opinię negatywną, zgodnie z MSB 705\n(zmienionym)5 oraz (b) w sekcji „Podstawa opinii z zastrzeżeniem (opinii negatywnej)” w sprawozdaniu biegłego\nrewidenta, stwierdza, że występuje znacząca niepewność, która może budzić poważne\nwątpliwości co do zdolności jednostki do kontynuacji działalności i że sprawozdanie\nfinansowe nie zawiera odpowiedniego ujawnienia tej sprawy." },
    { "ref": "570(24)", "desc": "W przypadku, gdy kierownik jednostki odmawia dokonania lub wydłużenia okresu oceny,\npomimo prośby biegłego rewidenta, biegły rewident rozpatruje wpływ tego faktu na\nsprawozdanie biegłego rewidenta (Zob. par. A35). " },
    { "ref": "570(25)", "desc": "munikacja z osobami sprawującymi nadzór\n25. Jeżeli nie wszystkie osoby sprawujące nadzór uczestniczą w zarządzaniu jednostką6\n, biegły\nrewident informuje osoby sprawujące nadzór o zidentyfikowanych zdarzeniach i warunkach,\nktóre mogą poddawać w wątpliwość zdolność jednostki do kontynuacji działalności.\nInformowanie osób sprawujących nadzór obejmuje następujące zagadnienia:\n(a) czy te zdarzenia lub warunki wskazują, że występuje znacząca niepewność;\n(b) czy przyjęcie przez kierownika jednostki przy sporządzaniu sprawozdania finansowego\nzasady kontynuacji działalności jest odpowiednie;\n(c) wystarczalność powiązanych ujawnień w sprawozdaniu finansowym; i\n(d) tam, gdzie ma to zastosowanie, wpływ na sprawozdanie biegłego rewidenta. " },

    { "ref": "580(10)", "desc": "Biegły rewident zwraca się do kierownictwa z wnioskiem o złożenie pisemnego\noświadczenia, że kierownictwo wywiązało się z odpowiedzialności za sporządzenie\nsprawozdania finansowego zgodnie z mającymi zastosowanie ramowymi założeniami\nsprawozdawczości finansowej obejmującymi, gdzie to odpowiednie, jego rzetelną\nprezentację, zgodnie z warunkami zlecenia badania2\n. (Zob. par. A7-A9, A14, A22)" },
    { "ref": "580(11)", "desc": "Biegły rewident zwraca się do kierownictwa z wnioskiem o złożenie pisemnego\noświadczenia, że:\n(a) przedstawiło biegłemu rewidentowi wszystkie odpowiednie informacje i zapewniło\ntaki dostęp jak uzgodniono w warunkach zlecenia badania3\n, oraz\n(b) wszystkie transakcje zostały zaewidencjonowane i odzwierciedlone w sprawozdaniu\nfinansowym. (Zob. par. A7-A9, A14, A22) " },
    { "ref": "580(13)", "desc": "Inne MSB wymagają od biegłego rewidenta zwrócenia się z wnioskiem o pisemne\noświadczenia. Jeżeli oprócz takich wymaganych oświadczeń, biegły rewident stwierdza, że\nkonieczne jest uzyskanie jednego lub więcej pisemnych oświadczeń na poparcie innych\ndowodów badania mających znaczenie dla sprawozdania finansowego lub jednego lub więcej\nzawartych w nim konkretnych stwierdzeń, to wymaga takich innych pisemnych oświadczeń.\n(Zob. par. A10-A13, A14, A22)\n" },
    { "ref": "580(14)", "desc": "Data pisemnych oświadczeń powinna być możliwie najbliższa dacie sprawozdania biegłego\nrewidenta na temat sprawozdania finansowego, ale nie późniejsza od niej. Pisemne\noświadczenia odnoszą się do wszystkich sprawozdań finansowych i okresów\nsprawozdawczych objętych sprawozdaniem biegłego rewidenta. (Zob. par. A15-A18)" },
    { "ref": "580(17)", "desc": "W szczególności, jeżeli pisemne oświadczenia są niespójne z innymi dowodami badania,\nbiegły rewident przeprowadza procedury badania próbując wyjaśnić tę sprawę. Jeżeli sprawa\npozostaje niewyjaśniona, biegły rewident ponownie rozważa ocenę kompetencji, uczciwości,\nwartości etycznych lub staranności kierownictwa, bądź jego przywiązania do lub\negzekwowania tych wartości oraz określa wpływ, jaki mogą one mieć na wiarygodność\noświadczeń (ustnych lub pisemnych) i ogólnie na dowody badania. (Zob. par. A23)\n" },

    { "ref": "600(2)", "desc": "Sprawozdanie finansowe grupy obejmuje informacje finansowe więcej niż jednej jednostki lub\njednostki biznesowej poprzez proces konsolidacji, jak opisano w paragrafie 14(k). Pojęcie proces\nkonsolidacji użyte w tym MSB (PL) odnosi się nie tylko do sporządzania skonsolidowanych\nsprawozdań finansowych zgodnie z mającymi zastosowanie ramowymi założeniami\nsprawozdawczości finansowej, ale także do prezentacji łącznych sprawozdań finansowych oraz do\nagregacji informacji finansowych jednostek lub jednostek biznesowych, takich jak oddziały lub\nwydziały. (Zob. par. A3-A5, A27)" },
    { "ref": "600(14)", "desc": "Dla celów MSB (PL) następujące pojęcia mają znaczenia przypisane poniżej:\n(a) Ryzyko agregacji – prawdopodobieństwo, że łączne nieskorygowane i niewykryte\nzniekształcenia przekraczają istotność dla sprawozdania finansowego jako całości. (Zob. par.\nA19)\n(b) Część składowa grupy – jednostka, jednostka biznesowa, funkcja lub działalność\ngospodarcza, lub jakaś ich kombinacja, ustalona przez audytora grupy dla celów planowania\ni wykonywania procedur badania podczas badania grupy. (Zob. par. A20)\n(c) Audytor części składowej grupy – audytor, który wykonuje prace rewizyjne związane\nz częścią składową grupy dla celów badania grupy. Audytor części składowej grupy jest\nczęścią zespołu wykonującego zlecenie10 dla badania grupy. (Zob. par. A21-A23)\nDla zleceń badania przeprowadzanych zgodnie z ustawą z dnia 11 maja 2017 r. o biegłych\nrewidentach, firmach audytorskich oraz nadzorze publicznym (Dz. U. z 2022 r. poz.1302\nz późn. zm.; dalej „ustawa o biegłych rewidentach”), przez audytora części składowej grupy\nnależy rozumieć biegłego rewidenta oraz osoby z nim współpracujące, zgodnie z definicją\nzawartą w KSB 200 „Ogólne cele niezależnego biegłego rewidenta oraz przeprowadzanie\nbadania zgodnie z Międzynarodowymi Standardami Badania”, paragraf 13.(d), podczas\nbadania sprawozdania finansowego części składowej grupy.\n(d) Kierownictwo części składowej grupy – kierownictwo odpowiedzialne za część składową\ngrupy. (Zob. par. A24)\n(e) Istotność wykonawcza dla części składowej grupy – kwota ustalona przez audytora grupy,\naby obniżyć ryzyko agregacji do odpowiednio niskiego poziomu dla celów planowania\ni wykonywania procedur badania w odniesieniu do części składowej grupy.\n(f) Grupa – jednostka sprawozdawcza, dla której sporządzane jest sprawozdanie finansowe\ngrupy.\n(g) Badanie grupy – badanie sprawozdania finansowego grupy.\n(h) Audytor grupy – partner odpowiedzialny za zlecenie dla grupy oraz członkowie zespołu\nwykonującego zlecenie inni niż audytorzy części składowych grupy. Audytor grupy jest\nodpowiedzialny za:\n(i) ustalenie ogólnej strategii badania grupy i plan badania grupy,\n(ii) kierowanie i nadzorowanie audytorów części składowych grupy i dokonywanie\nprzeglądu ich pracy,\n(iii) ocenę wniosków wyciągniętych z dowodów badania uzyskanych jako podstawa dla\nsformułowania opinii o sprawozdaniu finansowym grupy.\nDla zleceń badania przeprowadzanych zgodnie z ustawą o biegłych rewidentach, przez\naudytora grupy należy rozumieć biegłego rewidenta oraz osoby z nim współpracujące,\nzgodnie z definicją zawartą w KSB 200 „Ogólne cele niezależnego biegłego rewidenta oraz  przeprowadzanie badania zgodnie z Międzynarodowymi Standardami Badania”, paragraf\n13.(d), inne niż audytorzy części składowych grupy, podczas badania sprawozdania\nfinansowego grupy.\n(i) Opinia z badania grupy – opinia z badania na temat sprawozdania finansowego grupy.\n(j) Partner odpowiedzialny za zlecenie dla grupy – partner odpowiedzialny za zlecenie11\n, który\njest odpowiedzialny za badanie grupy. (Zob. par. A25)\nDla zleceń badania przeprowadzanych zgodnie z ustawą z dnia o biegłych rewidentach przez\npartnera odpowiedzialnego za zlecenie należy rozumieć kluczowego biegłego rewidenta, tj.:\n- w przypadku badania sprawozdania finansowego – biegłego rewidenta wyznaczonego\nprzez firmę audytorską, jako w głównym stopniu odpowiedzialnego za\nprzeprowadzenie danego badania w imieniu firmy audytorskiej, lub\n- w przypadku badania skonsolidowanego sprawozdania finansowego grupy kapitałowej\n– biegłego rewidenta wyznaczonego przez firmę audytorską jako w głównym stopniu\nodpowiedzialnego za przeprowadzenie badania skonsolidowanego sprawozdania\nfinansowego grupy kapitałowej w imieniu firmy audytorskiej na poziomie jednostki\ndominującej danej grupy kapitałowej oraz biegłego rewidenta wyznaczonego jako\nw głównym stopniu odpowiedzialnego za przeprowadzenie badania skonsolidowanego\nsprawozdania finansowego grupy kapitałowej na poziomie istotnych jednostek\nzależnych objętych skonsolidowanym sprawozdaniem finansowym danej grupy\nkapitałowej, lub\n- biegłego rewidenta podpisującego sprawozdanie z badania.\n(k) Sprawozdanie finansowe grupy – sprawozdanie finansowe, które obejmuje informacje\nfinansowe więcej niż jednej jednostki lub jednostki biznesowej poprzez proces konsolidacji.\nDla celów niniejszego MSB (PL) proces konsolidacji obejmuje: (zob. par. A26-A28)\n(i) konsolidację, konsolidację proporcjonalną lub ujęcie metodą praw własności,\n(ii) prezentację w połączonym sprawozdaniu finansowym informacji finansowych\njednostek lub jednostek biznesowych, które nie mają jednostki dominującej, ale\nznajdują się pod wspólną kontrolą lub wspólnym zarządem lub\n(iii) połączenie informacji finansowych jednostek lub jednostek biznesowych, takich jak\noddziały lub wydziały.\n(l) Kierownictwo grupy – kierownictwo odpowiedzialne za sporządzenie sprawozdania\nfinansowego grupy.\n(m) Istotność wykonawcza dla grupy – istotność wykonawcza12 w odniesieniu do sprawozdania\nfinansowego grupy jako całości, ustalona przez audytora grupy.\n" },
    { "ref": "600(15)", "desc": "Odwołanie w niniejszym MSB (PL) do „mających zastosowanie ramowych założeń\nsprawozdawczości finansowej” oznacza ramowe założenia sprawozdawczości finansowej, które\nmają zastosowanie do sprawozdania finansowego grupy." },
    { "ref": "600(19)", "desc": "Stosując MSB 210 14 audytor grupy uzyskuje zgodę kierownictwa grupy, że potwierdza ono\ni rozumie swoją odpowiedzialność za zapewnienie zespołowi wykonującemu zlecenie: (zob. par.\nA37)\n(a) dostępu do wszystkich informacji, których kierownictwo grupy jest świadome, a które są\nstosowne dla sporządzenia sprawozdania finansowego grupy, takich jak zapisy, dokumentacja\ni inne sprawy,\n(b) dodatkowych informacji, których zespół wykonujący zlecenie może zażądać od kierownictwa\ngrupy lub kierownictwa części składowej grupy dla celu badania grupy oraz\n(c) nieograniczonego dostępu do osób w grupie, co do których zespół wykonujący zlecenie\nustalił, że konieczne jest uzyskanie od nich dowodów badania." },

    { "ref": "610(13)", "desc": "Celami biegłego rewidenta, w przypadku, gdy jednostka posiada funkcję audytu wewnętrznego,\na biegły rewident przewiduje wykorzystanie pracy tej funkcji, aby zmienić rodzaj lub rozłożenie\nw czasie, albo ograniczyć zakres procedur badania, przeprowadzanych bezpośrednio przez\nbiegłego rewidenta, lub wykorzystanie audytorów wewnętrznych do udzielenia bezpośredniej\npomocy, są:\n(a) ustalenie czy praca funkcji audytu wewnętrznego lub bezpośrednia pomoc audytorów\nwewnętrznych mogą być wykorzystane, a jeżeli tak, to w których obszarach i w jakim\nzakresie,\noraz po dokonaniu takiego ustalenia:\n(b) jeżeli wykorzystuje się pracę funkcji audytu wewnętrznego, ustalenie czy praca ta jest\nadekwatna dla celów badania, oraz\n(c) jeżeli wykorzystuje się audytorów wewnętrznych do udzielania bezpośredniej pomocy,\nodpowiednie kierowanie, nadzorowanie i przegląd ich pracy." },
    { "ref": "610(14)", "desc": "Dla celów MSB następujące pojęcia mają znaczenia przypisane poniżej:\n(a) Funkcja audytu wewnętrznego – funkcja jednostki, która przeprowadza czynności\natestacyjne i doradcze zaprojektowane w celu oceny i poprawy skuteczności nadzoru nad\njednostką, zarządzania ryzykiem oraz procesów kontroli wewnętrznej. (Zob. par. A1-A4)\n(b) Bezpośrednia pomoc – wykorzystanie audytorów wewnętrznych do przeprowadzenia\nprocedur badania pod kierownictwem i nadzorem biegłego rewidenta oraz podlegających\njego przeglądowi." },
    { "ref": "610(16)", "desc": "Biegły rewident nie wykorzystuje pracy funkcji audytu wewnętrznego, jeżeli ustali, że:\n(a) status organizacyjny funkcji audytu wewnętrznego oraz stosowne polityki i procedury nie\nwspierają w odpowiedni sposób obiektywizmu audytorów wewnętrznych, (b) funkcji tej brakuje wystarczających kompetencji, lub\n(c) funkcja ta nie stosuje systematycznego i metodycznego podejścia, obejmującego kontrolę\njakości. (Zob. par. A12-A14)\n" },
    { "ref": "610(17)", "desc": "Jako podstawę dla ustalania obszarów i zakresu, w jakim praca funkcji audytu wewnętrznego\nmoże zostać wykorzystana, biegły rewident rozważa rodzaj i zakres pracy, która została\nwykonana lub jest zaplanowana do przeprowadzenia przez funkcję audytu wewnętrznego oraz\njej odpowiedniość do określonej przez biegłego rewidenta ogólnej strategii badania oraz planu\nbadania. (Zob. par. A15-A17)" },

    { "ref": "620(8)", "desc": "Rodzaj, rozłożenie w czasie i zakres procedur biegłego rewidenta odnoszących się do\nwymogów z paragrafów 9-13 niniejszego MSB będzie się różnił w zależności od\nokoliczności. Ustalając rodzaj, rozłożenie w czasie i zakres tych procedur, biegły rewident\nrozważa: (zob. par. A10)\n(a) rodzaj sprawy, której dotyczy praca eksperta,\n(b) ryzyka istotnego zniekształcenia w sprawie, której dotyczy praca tego eksperta,\n(c) znaczenie pracy tego eksperta w kontekście badania,\n(d) wiedzę biegłego rewidenta oraz jego doświadczenie z wcześniej wykonaną przez tego\neksperta pracą,\n(e) czy ekspert ten podlega zasadom i procedurom kontroli jakości firmy. (Zob. par. A11-\nA13)\n" },
    { "ref": "620(9)", "desc": "Biegły rewident ocenia, czy ekspert biegłego rewidenta posiada niezbędne dla celów biegłego\nrewidenta kompetencje, umiejętności i obiektywizm. W przypadku zewnętrznego eksperta\nbiegłego rewidenta, ocena obiektywizmu obejmuje uzyskanie informacji na temat interesów\ni powiązań, które mogą stwarzać zagrożenie dla obiektywizmu tego eksperta. (Zob. par. A14-\nA20)" },
    { "ref": "620(10)", "desc": "Biegły rewident uzyskuje wystarczające zrozumienie dziedziny specjalistycznej wiedzy\neksperta biegłego rewidenta, aby umożliwić: (zob. par. A21-A22)\n(a) ustalenie rodzaju, zakresu i celów pracy tego eksperta dla celów biegłego rewidenta,\n(b) ocenę adekwatności tej pracy dla celów biegłego rewidenta." },
    { "ref": "620(11)", "desc": "Biegły rewident uzgadnia, w miarę potrzeby na piśmie, następujące sprawy z ekspertem\nbiegłego rewidenta: (zob. par. A23-A26)\n(a) rodzaj, zakres i cele pracy eksperta, (zob. par. A27)\n(b) role i obowiązki odpowiednio, biegłego rewidenta i eksperta, (zob. par. A28-A29)\n(c) rodzaj, rozłożenie w czasie i zakres komunikacji pomiędzy biegłym rewidentem\na ekspertem, w tym formę wszelkich raportów przedkładanych przez eksperta, (zob.\npar. A30)\n(d) potrzebę przestrzegania przez eksperta biegłego rewidenta wymogów zachowania\npoufności. (Zob. par. A31)" },

    { "ref": "700(8)", "desc": "Odniesienie do “sprawozdania finansowego” w niniejszym MSB oznacza “pełne sprawozdanie\nfinansowe ogólnego przeznaczenia”\n8\n. Wymogi mających zastosowanie ramowych założeń sprawozdawczości finansowej określają prezentację, strukturę i zawartość sprawozdania\nfinansowego oraz to, co się składa na pełne sprawozdanie finansowe.\n" },
    { "ref": "700(9)", "desc": "Odniesienie do “Międzynarodowych Standardów Sprawozdawczości Finansowej” w niniejszym\nMSB oznacza Międzynarodowe Standardy Sprawozdawczości Finansowej (MSSF) wydane przez\nRadę Międzynarodowych Standardów Rachunkowości, a odniesienie do “Międzynarodowych\nStandardów Rachunkowości Sektora Publicznego” oznacza Międzynarodowe Standardy\nRachunkowości Sektora Publicznego (MSRSP) wydane przez Radę Międzynarodowych\nStandardów Rachunkowości Sektora Publicznego." },

    { "ref": "710(5)", "desc": "Celami biegłego rewidenta są:\n(a) uzyskanie wystarczających i odpowiednich dowodów badania na temat tego, czy\ninformacje porównawcze ujęte w sprawozdaniu finansowym zostały zaprezentowane, we\nwszystkich istotnych aspektach, zgodnie z wymogami przewidzianymi dla informacji\nporównawczych zawartymi w mających zastosowanie ramowych założeniach\nsprawozdawczości finansowej,\n(b) przedstawienie sprawozdania zgodnie z obowiązkami sprawozdawczymi biegłego\nrewidenta." },
    { "ref": "710(7)", "desc": "Biegły rewident ustala*\n, czy sprawozdanie finansowe obejmuje informacje porównawcze\nwymagane przez mające zastosowanie ramowe założenia sprawozdawczości finansowej i czy\ninformacje te są odpowiednio sklasyfikowane. W tym celu biegły rewident ocenia, czy:\n(a) informacje porównawcze są zgodne z kwotami i innymi ujawnieniami zaprezentowanymi\nw poprzednim okresie sprawozdawczym oraz gdy to odpowiednie, czy zostały\nprzekształcone, oraz\n(b) zasady (polityki) rachunkowości odzwierciedlone w informacjach porównawczych są\nspójne z tymi zastosowanymi w bieżącym okresie sprawozdawczym lub jeżeli nastąpiły\nzmiany w zasadach (politykach) rachunkowości, czy zmiany te zostały odpowiednio ujęte\noraz zaprezentowane i ujawnione." },
    { "ref": "710(9)", "desc": "Zgodnie z wymogami MSB 5803\n, biegły rewident zwraca się z wnioskiem o pisemne\noświadczenia dla wszystkich okresów sprawozdawczych do których odnosi się opinia biegłego\nrewidenta. Biegły rewident powinien także otrzymać szczegółowe pisemne oświadczenie\ndotyczące wszelkich przekształceń dokonanych w celu skorygowania w sprawozdaniu\nfinansowym za poprzedni okres sprawozdawczy istotnego zniekształcenia, które wpływa na\ninformacje porównawcze. (Zob. par. A1)" },

    { "ref": "720(8)", "desc": "Obowiązki biegłego rewidenta zgodnie z niniejszym MSB nie stanowią usługi atestacyjnej na\ntemat innych informacji lub nie nakładają na biegłego rewidenta obowiązku upewnienia się na\ntemat innych informacji. " }

  ]
}
